// UserDefinedStruct AbilityStruct.AbilityStruct
// Size: 0x58 (Inherited: 0x00)
struct FAbilityStruct {
	struct UPaperSprite* Image_13_2EB7A3F5424B554350E81CAFF9D111BF; // 0x00(0x08)
	float Cooldown_5_B5AB22B7415F1ABD1B0462B9BD6CD584; // 0x08(0x04)
	char pad_C[0x4]; // 0x0c(0x04)
	struct FString Hotkey_9_638EA1DB4EEF0B81A2BA4FA32A996C4C; // 0x10(0x10)
	bool Charge?_12_92D29B234BB793C1210CE281E4B8C098; // 0x20(0x01)
	char pad_21[0x7]; // 0x21(0x07)
	struct FText Description_22_625887964F9910A4E7F99DA754FA2031; // 0x28(0x18)
	struct FText DisplayName_23_15BE98144FD0DE75B24C53A589B7D0FC; // 0x40(0x18)
};

