// WidgetBlueprintGeneratedClass AlarmsCountWBP.AlarmsCountWBP_C
// Size: 0x6b9 (Inherited: 0x260)
struct UAlarmsCountWBP_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* NotificationStart_LastSurv_Ground; // 0x268(0x08)
	struct UWidgetAnimation* NotificationStart_LastSurv; // 0x270(0x08)
	struct UWidgetAnimation* AllAlarmsDone; // 0x278(0x08)
	struct UWidgetAnimation* Alarm0; // 0x280(0x08)
	struct UWidgetAnimation* NotificationStart_34; // 0x288(0x08)
	struct UWidgetAnimation* NotificationStart_23; // 0x290(0x08)
	struct UWidgetAnimation* Alarm4; // 0x298(0x08)
	struct UWidgetAnimation* Alarm3; // 0x2a0(0x08)
	struct UWidgetAnimation* Alarm2; // 0x2a8(0x08)
	struct UWidgetAnimation* Alarm1; // 0x2b0(0x08)
	struct UWidgetAnimation* SwitchColor; // 0x2b8(0x08)
	struct UWidgetAnimation* ShowTimer; // 0x2c0(0x08)
	struct UWidgetAnimation* GetReadyAppearanceFinish; // 0x2c8(0x08)
	struct UWidgetAnimation* OverlayHide; // 0x2d0(0x08)
	struct UWidgetAnimation* TextHide_Target; // 0x2d8(0x08)
	struct UWidgetAnimation* Timer5_2; // 0x2e0(0x08)
	struct UWidgetAnimation* Timer5; // 0x2e8(0x08)
	struct UWidgetAnimation* TimerAdd; // 0x2f0(0x08)
	struct UWidgetAnimation* GetReadyAppearanceStart; // 0x2f8(0x08)
	struct UWidgetAnimation* NotificationStart; // 0x300(0x08)
	struct UWidgetAnimation* LastSurvivorStart; // 0x308(0x08)
	struct UWidgetAnimation* HardModeStart; // 0x310(0x08)
	struct UTextBlock* AddedTime; // 0x318(0x08)
	struct UWidgetSwitcher* AlarmSwitch; // 0x320(0x08)
	struct UImage* Background; // 0x328(0x08)
	struct UImage* Background_2; // 0x330(0x08)
	struct UImage* Background_3; // 0x338(0x08)
	struct UCanvasPanel* CanvasPanel_1; // 0x340(0x08)
	struct UTextBlock* GameplayNotification; // 0x348(0x08)
	struct UTextBlock* GameplayNotification_2; // 0x350(0x08)
	struct USizeBox* GetReadyTextBox; // 0x358(0x08)
	struct USizeBox* GetReadyTextBox_2; // 0x360(0x08)
	struct USizeBox* GetReadyTextBox_AlarmsDone; // 0x368(0x08)
	struct UImage* HMLMIcon; // 0x370(0x08)
	struct UImage* HMLMIcon_2; // 0x378(0x08)
	struct UHorizontalBox* HorizontalBox_3; // 0x380(0x08)
	struct UHorizontalBox* HorizontalBox_GameMode; // 0x388(0x08)
	struct UHorizontalBox* HorizontalBox_LastSurv; // 0x390(0x08)
	struct UIconAbilityCooldownAlarmWBP_Survivor_Middle_C* IconAbilityCooldownAlarmWBP_Survivor_Middle; // 0x398(0x08)
	struct UImage* Image; // 0x3a0(0x08)
	struct UImage* Image_2; // 0x3a8(0x08)
	struct UImage* Image_3; // 0x3b0(0x08)
	struct UImage* Image_4; // 0x3b8(0x08)
	struct UImage* Image_5; // 0x3c0(0x08)
	struct UImage* Image_6; // 0x3c8(0x08)
	struct UImage* Image_7; // 0x3d0(0x08)
	struct UImage* Image_8; // 0x3d8(0x08)
	struct UImage* Image_9; // 0x3e0(0x08)
	struct UImage* Image_10; // 0x3e8(0x08)
	struct UImage* Image_11; // 0x3f0(0x08)
	struct UImage* Image_12; // 0x3f8(0x08)
	struct UImage* Image_13; // 0x400(0x08)
	struct UImage* Image_14; // 0x408(0x08)
	struct UImage* Image_15; // 0x410(0x08)
	struct UImage* Image_16; // 0x418(0x08)
	struct UImage* Image_17; // 0x420(0x08)
	struct UImage* Image_18; // 0x428(0x08)
	struct UImage* Image_19; // 0x430(0x08)
	struct UImage* Image_20; // 0x438(0x08)
	struct UImage* Image_21; // 0x440(0x08)
	struct UImage* Image_22; // 0x448(0x08)
	struct UImage* Image_23; // 0x450(0x08)
	struct UImage* Image_122; // 0x458(0x08)
	struct UImage* Image_126; // 0x460(0x08)
	struct UImage* Image_152; // 0x468(0x08)
	struct UImage* Image_347; // 0x470(0x08)
	struct UImage* Image_403; // 0x478(0x08)
	struct UImage* Image_475; // 0x480(0x08)
	struct UImage* Image_541; // 0x488(0x08)
	struct UImage* Image_556; // 0x490(0x08)
	struct UImage* Image_AddedTime; // 0x498(0x08)
	struct UImage* Image_backtimer; // 0x4a0(0x08)
	struct UTextBlock* KillerSee; // 0x4a8(0x08)
	struct UTextBlock* MinutesText; // 0x4b0(0x08)
	struct UOverlay* Overlay_AddedTime; // 0x4b8(0x08)
	struct UOverlay* Overlay_Alarm; // 0x4c0(0x08)
	struct UOverlay* Overlay_Detect; // 0x4c8(0x08)
	struct UProgressBar* ProgressBar_01; // 0x4d0(0x08)
	struct UProgressBar* ProgressBar_02; // 0x4d8(0x08)
	struct UProgressBar* ProgressBar_03; // 0x4e0(0x08)
	struct UProgressBar* ProgressBar_04; // 0x4e8(0x08)
	struct UTextBlock* ReadyText; // 0x4f0(0x08)
	struct UTextBlock* ReadyText_2; // 0x4f8(0x08)
	struct UTextBlock* ReadyText_3; // 0x500(0x08)
	struct UTextBlock* ReadyText_4; // 0x508(0x08)
	struct UTextBlock* ReadyText_5; // 0x510(0x08)
	struct UTextBlock* ReadyText_6; // 0x518(0x08)
	struct UTextBlock* ReadyText_7; // 0x520(0x08)
	struct UTextBlock* ReadyText_8; // 0x528(0x08)
	struct UTextBlock* ReadyText_12; // 0x530(0x08)
	struct UTextBlock* ReadyText_14; // 0x538(0x08)
	struct UTextBlock* ReadyText_15; // 0x540(0x08)
	struct USafeZone* SafeZone; // 0x548(0x08)
	struct USafeZone* SafeZone_2; // 0x550(0x08)
	struct USafeZone* SafeZone_3; // 0x558(0x08)
	struct USafeZone* SafeZone_4; // 0x560(0x08)
	struct USafeZone* SafeZone_108; // 0x568(0x08)
	struct UTextBlock* SecondsText; // 0x570(0x08)
	struct UTextBlock* SecondsText_2; // 0x578(0x08)
	struct UTextBlock* SurvLive; // 0x580(0x08)
	struct UTextBlock* TextBlock_89; // 0x588(0x08)
	struct UTextBlock* TextBlock_123; // 0x590(0x08)
	struct UTextBlock* TextBlock_Exit; // 0x598(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_730; // 0x5a0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_GETREADYTEXT; // 0x5a8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Points; // 0x5b0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_StatusSurv; // 0x5b8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_TIMER; // 0x5c0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Tip_Alarms; // 0x5c8(0x08)
	struct FString str; // 0x5d0(0x10)
	struct FText AlarmText; // 0x5e0(0x18)
	int32_t AlarmsCount; // 0x5f8(0x04)
	int32_t AlarmsDone; // 0x5fc(0x04)
	bool GameStarting?; // 0x600(0x01)
	char pad_601[0x7]; // 0x601(0x07)
	struct FFMODEventInstance GameEndEvent; // 0x608(0x08)
	struct FFMODEventInstance HardModeEvent; // 0x610(0x08)
	struct FFMODEventInstance LastManStandEvent; // 0x618(0x08)
	bool HardMode?; // 0x620(0x01)
	bool LastManStand?; // 0x621(0x01)
	char pad_622[0x2]; // 0x622(0x02)
	float Volume; // 0x624(0x04)
	struct FFMODEventInstance Sound2D; // 0x628(0x08)
	bool StartGame?; // 0x630(0x01)
	char pad_631[0x3]; // 0x631(0x03)
	int32_t Minutes; // 0x634(0x04)
	int32_t Seconds; // 0x638(0x04)
	bool IsStop; // 0x63c(0x01)
	char pad_63D[0x3]; // 0x63d(0x03)
	struct FFMODEventInstance KillerSeeSound; // 0x640(0x08)
	float DeltaSecond; // 0x648(0x04)
	float Speed; // 0x64c(0x04)
	bool LastSecondsMusic?; // 0x650(0x01)
	char pad_651[0x3]; // 0x651(0x03)
	float LastSecondVolume; // 0x654(0x04)
	bool GameEnd?; // 0x658(0x01)
	bool Chased?; // 0x659(0x01)
	char pad_65A[0x2]; // 0x65a(0x02)
	float EyeScale; // 0x65c(0x04)
	float Delay; // 0x660(0x04)
	bool StopMusic?; // 0x664(0x01)
	char pad_665[0x3]; // 0x665(0x03)
	float VolumeKillerSee; // 0x668(0x04)
	char pad_66C[0x4]; // 0x66c(0x04)
	struct FFMODEventInstance 10Sec; // 0x670(0x08)
	struct FText CountAliveSurv; // 0x678(0x18)
	struct FFMODEventInstance Last; // 0x690(0x08)
	bool LastChance; // 0x698(0x01)
	char pad_699[0x3]; // 0x699(0x03)
	float Seconds_Start5; // 0x69c(0x04)
	bool GameStarting?_6; // 0x6a0(0x01)
	char pad_6A1[0x7]; // 0x6a1(0x07)
	struct UMaterialInstanceDynamic* Material INstance; // 0x6a8(0x08)
	float Seconds_Start3; // 0x6b0(0x04)
	int32_t Alarms; // 0x6b4(0x04)
	bool LastSurvPlay?; // 0x6b8(0x01)

	struct FText Get_ReadyText_3_Text_1(); // Function AlarmsCountWBP.AlarmsCountWBP_C.Get_ReadyText_3_Text_1 // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText GetText_1(); // Function AlarmsCountWBP.AlarmsCountWBP_C.GetText_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	void GetCountSurv(struct FText SurvCount); // Function AlarmsCountWBP.AlarmsCountWBP_C.GetCountSurv // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText Get_KillerSee_Text_1(); // Function AlarmsCountWBP.AlarmsCountWBP_C.Get_KillerSee_Text_1 // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	enum class ESlateVisibility Get_HMLMIcon_Visibility_1(); // Function AlarmsCountWBP.AlarmsCountWBP_C.Get_HMLMIcon_Visibility_1 // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	enum class ESlateVisibility Get_KillerSee_Visibility_1(); // Function AlarmsCountWBP.AlarmsCountWBP_C.Get_KillerSee_Visibility_1 // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText GetSeconds(); // Function AlarmsCountWBP.AlarmsCountWBP_C.GetSeconds // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText GetMinutes(); // Function AlarmsCountWBP.AlarmsCountWBP_C.GetMinutes // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	enum class ESlateVisibility HardModeFunc(); // Function AlarmsCountWBP.AlarmsCountWBP_C.HardModeFunc // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	enum class ESlateVisibility LastManStandingFunc(); // Function AlarmsCountWBP.AlarmsCountWBP_C.LastManStandingFunc // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	void TimerControlUI(bool Add?, int32_t Seconds); // Function AlarmsCountWBP.AlarmsCountWBP_C.TimerControlUI // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EyeAnim(); // Function AlarmsCountWBP.AlarmsCountWBP_C.EyeAnim // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void CallNotification(enum class GameplayNotificationType Type); // Function AlarmsCountWBP.AlarmsCountWBP_C.CallNotification // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void StopGameEnd(); // Function AlarmsCountWBP.AlarmsCountWBP_C.StopGameEnd // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void SurvRemain(int32_t OnChairSurv); // Function AlarmsCountWBP.AlarmsCountWBP_C.SurvRemain // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void LastManStanding(); // Function AlarmsCountWBP.AlarmsCountWBP_C.LastManStanding // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void DecreaseAlarmEvent(struct AActor* Surv_AlarmDone); // Function AlarmsCountWBP.AlarmsCountWBP_C.DecreaseAlarmEvent // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function AlarmsCountWBP.AlarmsCountWBP_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void Construct(); // Function AlarmsCountWBP.AlarmsCountWBP_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void PlayAnimAlarms(int32_t Alarm_Done); // Function AlarmsCountWBP.AlarmsCountWBP_C.PlayAnimAlarms // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void ExecuteUbergraph_AlarmsCountWBP(int32_t EntryPoint); // Function AlarmsCountWBP.AlarmsCountWBP_C.ExecuteUbergraph_AlarmsCountWBP // (Final|UbergraphFunction|HasDefaults) // @ game+0x132e1a0
};

