// AnimBlueprintGeneratedClass bansheeAnimBp.bansheeAnimBp_C
// Size: 0x2510 (Inherited: 0x2c0)
struct UbansheeAnimBp_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_102; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_101; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_100; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_99; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_98; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_97; // 0x3c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_96; // 0x3e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_95; // 0x410(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_94; // 0x438(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93; // 0x460(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92; // 0x488(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91; // 0x4b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90; // 0x4d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89; // 0x500(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88; // 0x528(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87; // 0x550(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86; // 0x578(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85; // 0x5a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84; // 0x5c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83; // 0x5f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82; // 0x618(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81; // 0x640(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80; // 0x668(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79; // 0x690(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78; // 0x6b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0x6e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0x708(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0x730(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0x758(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0x780(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0x7a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0x7d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0x7f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0x820(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0x848(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x870(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x898(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x8c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x8e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x910(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x938(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x960(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x988(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x9b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x9d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0xa00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0xa28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0xa50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0xa78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0xaa0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0xac8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0xaf0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0xb18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0xb40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0xb68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0xb90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0xbb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0xbe0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0xc08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0xc30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0xc58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0xc80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0xca8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0xcd0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0xcf8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0xd20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0xd48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0xd70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0xd98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0xdc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0xde8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0xe10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0xe38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0xe60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0xe88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0xeb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0xed8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0xf00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0xf28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0xf50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0xf78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0xfa0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0xfc8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0xff0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x1018(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x1040(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x1068(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x1090(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x10b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x10e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x1108(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x1130(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x1158(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x1180(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x11a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x11d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x11f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x1220(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x1248(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x1270(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x1298(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x12c0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x12e8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x1368(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x13e8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x1488(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x14b8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x1538(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1568(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x1650(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x1680(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x1700(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x1730(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x17b0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x17e0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1860(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x1890(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x1910(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x1940(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x19c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x19f0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1a70(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x1aa0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1b20(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x1b50(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1bd0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1c00(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1c80(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1cb0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1d30(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x1db0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1e50(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1e80(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1f00(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1f30(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1fb0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x2050(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x20d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x2100(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x2180(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x21b0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2230(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x22d0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2350(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2380(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2400(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2430(0xb0)
	float keepSurv; // 0x24e0(0x04)
	bool IsInAir; // 0x24e4(0x01)
	char pad_24E5[0x3]; // 0x24e5(0x03)
	float Speed; // 0x24e8(0x04)
	float Direction; // 0x24ec(0x04)
	bool AttackBool; // 0x24f0(0x01)
	bool JumpEndChek; // 0x24f1(0x01)
	bool FIRE; // 0x24f2(0x01)
	bool Plant; // 0x24f3(0x01)
	bool MarioStun; // 0x24f4(0x01)
	char pad_24F5[0x3]; // 0x24f5(0x03)
	int32_t TypeAttack; // 0x24f8(0x04)
	bool KnifeIn; // 0x24fc(0x01)
	bool KnifeSpawn; // 0x24fd(0x01)
	bool Astral; // 0x24fe(0x01)
	bool Fly; // 0x24ff(0x01)
	bool Flashed; // 0x2500(0x01)
	bool PropHunt?; // 0x2501(0x01)
	char pad_2502[0x2]; // 0x2502(0x02)
	float SpeedRateF; // 0x2504(0x04)
	float Delta Time X; // 0x2508(0x04)
	float TimeRun; // 0x250c(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function bansheeAnimBp.bansheeAnimBp_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void Speed Rate(); // Function bansheeAnimBp.bansheeAnimBp_C.Speed Rate // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_bansheeAnimBp_AnimGraphNode_TransitionResult_E381109447715CEEE41AC8B01C12F59A(); // Function bansheeAnimBp.bansheeAnimBp_C.EvaluateGraphExposedInputs_ExecuteUbergraph_bansheeAnimBp_AnimGraphNode_TransitionResult_E381109447715CEEE41AC8B01C12F59A // (BlueprintEvent) // @ game+0x132e1a0
