// AnimBlueprintGeneratedClass BanshAnimBP.BanshAnimBP_C
// Size: 0x2a10 (Inherited: 0x2c0)
struct UBanshAnimBP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0x2c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0x2f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0x318(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0x340(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0x368(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0x390(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x3b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x3e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x408(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x430(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x458(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x480(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x4a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x4d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x4f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x520(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x548(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x570(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x598(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x5c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x5e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x610(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0x638(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0x660(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x688(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x6b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x6d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x700(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x728(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x750(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x778(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x7a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x7c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x7f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x818(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x840(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x868(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x890(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x8b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x8e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x908(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x930(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x958(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x980(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x9a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x9d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x9f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0xa20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0xa48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0xa70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0xa98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0xac0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0xae8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0xb10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0xb38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xb60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xb88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xbb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xbd8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xc00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xc28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xc50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xc78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xca0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xcc8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xcf0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xd18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xd40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xd68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xd90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xdb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xde0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xe08(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0xe30(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0xeb0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0xee0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0xf60(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0xf90(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x1010(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x1040(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x10c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x10f0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1170(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x11a0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x1220(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x1250(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x12d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x1300(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1380(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x13b0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x1430(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x14b0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1550(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x1580(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x1600(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x1680(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x1768(0xc0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x1828(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x18f0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x1920(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x19a0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x19d0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1a50(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1a80(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1b00(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1b30(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1bb0(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x1c30(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1cf8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1d28(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1da8(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x1e28(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1ef0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1f20(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1fa0(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x2020(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x20e8(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x2118(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2200(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x22c0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x2340(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x23c0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2460(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x2500(0xe8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x25e8(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x26b0(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2798(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x27c8(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2878(0xa0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2918(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2948(0x80)
	float IsHolded; // 0x29c8(0x04)
	bool IsOnAir?; // 0x29cc(0x01)
	char pad_29CD[0x3]; // 0x29cd(0x03)
	float Speed; // 0x29d0(0x04)
	float SpeedChek; // 0x29d4(0x04)
	int32_t TypeAttack; // 0x29d8(0x04)
	bool Attak; // 0x29dc(0x01)
	char pad_29DD[0x3]; // 0x29dd(0x03)
	float Direction; // 0x29e0(0x04)
	bool JumpEndChek; // 0x29e4(0x01)
	bool FIRE; // 0x29e5(0x01)
	bool Plant; // 0x29e6(0x01)
	bool Flashed; // 0x29e7(0x01)
	bool Drop; // 0x29e8(0x01)
	bool ChairDrop; // 0x29e9(0x01)
	bool Catch; // 0x29ea(0x01)
	bool MarioStun; // 0x29eb(0x01)
	bool Runaway; // 0x29ec(0x01)
	bool KnifeIn; // 0x29ed(0x01)
	bool KnifeSpawn; // 0x29ee(0x01)
	bool AstralBuild; // 0x29ef(0x01)
	struct FRotator HeadR; // 0x29f0(0x0c)
	float Vertical rotation; // 0x29fc(0x04)
	float HorizontalValue; // 0x2a00(0x04)
	bool bTurnL; // 0x2a04(0x01)
	bool bTurnR; // 0x2a05(0x01)
	bool Astral; // 0x2a06(0x01)
	bool Fly; // 0x2a07(0x01)
	bool IsOwner?; // 0x2a08(0x01)
	bool Get Ready; // 0x2a09(0x01)
	bool PropHunt?; // 0x2a0a(0x01)
	char pad_2A0B[0x1]; // 0x2a0b(0x01)
	float SpeedRateF; // 0x2a0c(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function BanshAnimBP.BanshAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void Speed Rate(); // Function BanshAnimBP.BanshAnimBP_C.Speed Rate // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BanshAnimBP_AnimGraphNode_TransitionResult_BA87DB99455E01CC37012C82BB58A2EB(); // Function BanshAnimBP.BanshAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BanshAnimBP_AnimGraphNode_TransitionResult_BA87DB99455E01CC37012C82BB58A2EB // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BanshAnimBP_AnimGraphNode_TransitionResult_B222E8E2480CEA3C212717B3C4B37417(); // Function BanshAnimBP.BanshAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BanshAnimBP_AnimGraphNode_TransitionResult_B222E8E2480CEA3C212717B3C4B37417 // (BlueprintEvent) // @ game+0x132e1a0
