// AnimBlueprintGeneratedClass BPA_RHG_AnimGame.BPA_RHG_AnimGame_C
// Size: 0x1286a (Inherited: 0x2c0)
struct UBPA_RHG_AnimGame_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0x2c8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0x2f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x318(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x340(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x388(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x4e0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x580(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x5a8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x5d0(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x728(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x880(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x9d8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0xa00(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16; // 0xaa0(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15; // 0xb60(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0xc20(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0xcc0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0xe18(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0xe40(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0xe68(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_279; // 0xe90(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0xf10(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0xfb0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x1108(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_53; // 0x1130(0xb0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14; // 0x11e0(0xc0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_52; // 0x12a0(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x1350(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x14a8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x14d0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13; // 0x14f8(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x15b8(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x15e0(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x1600(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1628(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x1648(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x1670(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1778(0x108)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x1880(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x1940(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x1968(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x1a08(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x1ac8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x1c20(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x1c48(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_51; // 0x1c70(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x1d20(0xa0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_96; // 0x1dc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_95; // 0x1de8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_94; // 0x1e10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93; // 0x1e38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92; // 0x1e60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91; // 0x1e88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90; // 0x1eb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89; // 0x1ed8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88; // 0x1f00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87; // 0x1f28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86; // 0x1f50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85; // 0x1f78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84; // 0x1fa0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83; // 0x1fc8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82; // 0x1ff0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81; // 0x2018(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80; // 0x2040(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79; // 0x2068(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78; // 0x2090(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0x20b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0x20e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0x2108(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0x2130(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0x2158(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0x2180(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0x21a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0x21d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0x21f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0x2220(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x2248(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x2270(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x2298(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x22c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x22e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x2310(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x2338(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x2360(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x2388(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x23b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x23d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x2400(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x2428(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x2450(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x2478(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x24a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0x24c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0x24f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x2518(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x2540(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x2568(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x2590(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x25b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x25e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x2608(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x2630(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x2658(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x2680(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x26a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x26d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x26f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x2720(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x2748(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x2770(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x2798(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x27c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x27e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x2810(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x2838(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x2860(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x2888(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x28b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x28d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x2900(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x2928(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x2950(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x2978(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x29a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x29c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x29f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x2a18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x2a40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x2a68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x2a90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x2ab8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x2ae0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x2b08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x2b30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x2b58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x2b80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x2ba8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x2bd0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2bf8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2c20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x2c48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x2c70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2c98(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_278; // 0x2cc0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_277; // 0x2d40(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_276; // 0x2dc0(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_11; // 0x2e40(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_275; // 0x2ee0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_47; // 0x2f60(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x2f90(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_274; // 0x3058(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_273; // 0x30d8(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x3158(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_272; // 0x3220(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_271; // 0x32a0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_270; // 0x3320(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_10; // 0x33a0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_269; // 0x3440(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_46; // 0x34c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_268; // 0x34f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_267; // 0x3570(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_266; // 0x35f0(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_9; // 0x3670(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_265; // 0x3710(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_45; // 0x3790(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_264; // 0x37c0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_263; // 0x3840(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_262; // 0x38c0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_261; // 0x3940(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_260; // 0x39c0(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_50; // 0x3a40(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_44; // 0x3af0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_259; // 0x3b20(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_258; // 0x3ba0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_257; // 0x3c20(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_256; // 0x3ca0(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_8; // 0x3d20(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_43; // 0x3dc0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_255; // 0x3df0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_254; // 0x3e70(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_253; // 0x3ef0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_252; // 0x3f70(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_7; // 0x3ff0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_42; // 0x4090(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_251; // 0x40c0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_250; // 0x4140(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_249; // 0x41c0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_248; // 0x4240(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_6; // 0x42c0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_41; // 0x4360(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_247; // 0x4390(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_246; // 0x4410(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_245; // 0x4490(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_244; // 0x4510(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_49; // 0x4590(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_243; // 0x4640(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_40; // 0x46c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_242; // 0x46f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_241; // 0x4770(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_240; // 0x47f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_239; // 0x4870(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_48; // 0x48f0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_238; // 0x49a0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_39; // 0x4a20(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_237; // 0x4a50(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_236; // 0x4ad0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_235; // 0x4b50(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_234; // 0x4bd0(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_47; // 0x4c50(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_233; // 0x4d00(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_38; // 0x4d80(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_232; // 0x4db0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_231; // 0x4e30(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_230; // 0x4eb0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_229; // 0x4f30(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_228; // 0x4fb0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_227; // 0x5030(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_226; // 0x50b0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_225; // 0x5130(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_46; // 0x51b0(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_45; // 0x5260(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_224; // 0x5310(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_223; // 0x5390(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_32; // 0x5410(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_31; // 0x54f8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_30; // 0x55e0(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x56c8(0xa0)
	struct FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel_2; // 0x5768(0x68)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_44; // 0x57d0(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x5880(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_37; // 0x5920(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_222; // 0x5950(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_221; // 0x59d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_220; // 0x5a50(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_219; // 0x5ad0(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_43; // 0x5b50(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_218; // 0x5c00(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_36; // 0x5c80(0x30)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_42; // 0x5cb0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_217; // 0x5d60(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_216; // 0x5de0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_215; // 0x5e60(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_214; // 0x5ee0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_213; // 0x5f60(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_35; // 0x5fe0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_212; // 0x6010(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_211; // 0x6090(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_210; // 0x6110(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_209; // 0x6190(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_41; // 0x6210(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_208; // 0x62c0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_34; // 0x6340(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_207; // 0x6370(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_206; // 0x63f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_205; // 0x6470(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_204; // 0x64f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_203; // 0x6570(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_202; // 0x65f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_201; // 0x6670(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_200; // 0x66f0(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_40; // 0x6770(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_39; // 0x6820(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_199; // 0x68d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_198; // 0x6950(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_29; // 0x69d0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_28; // 0x6ab8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_27; // 0x6ba0(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x6c88(0xa0)
	struct FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel; // 0x6d28(0x68)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x6d90(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_38; // 0x6e30(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_33; // 0x6ee0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_197; // 0x6f10(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_196; // 0x6f90(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_195; // 0x7010(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_194; // 0x7090(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_193; // 0x7110(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_37; // 0x7190(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_192; // 0x7240(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_32; // 0x72c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_191; // 0x72f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_190; // 0x7370(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_189; // 0x73f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_188; // 0x7470(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_187; // 0x74f0(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_36; // 0x7570(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_186; // 0x7620(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_31; // 0x76a0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_185; // 0x76d0(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x7750(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_184; // 0x7810(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_183; // 0x7890(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_182; // 0x7910(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_181; // 0x7990(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_35; // 0x7a10(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_180; // 0x7ac0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_30; // 0x7b40(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_179; // 0x7b70(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x7bf0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_178; // 0x7cb0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_177; // 0x7d30(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_176; // 0x7db0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_175; // 0x7e30(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_34; // 0x7eb0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_174; // 0x7f60(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_29; // 0x7fe0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_173; // 0x8010(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x8090(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_172; // 0x8150(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_171; // 0x81d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_170; // 0x8250(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_169; // 0x82d0(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_33; // 0x8350(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_168; // 0x8400(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_28; // 0x8480(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_167; // 0x84b0(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x8530(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_166; // 0x85f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_165; // 0x8670(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_164; // 0x86f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_163; // 0x8770(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_32; // 0x87f0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_162; // 0x88a0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_27; // 0x8920(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_161; // 0x8950(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x89d0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_160; // 0x8a90(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_159; // 0x8b10(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_158; // 0x8b90(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_157; // 0x8c10(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_31; // 0x8c90(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_156; // 0x8d40(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x8dc0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_155; // 0x8df0(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x8e70(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_154; // 0x8f30(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_153; // 0x8fb0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_152; // 0x9030(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_151; // 0x90b0(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_30; // 0x9130(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_150; // 0x91e0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x9260(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_149; // 0x9290(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_148; // 0x9310(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_147; // 0x9390(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_146; // 0x9410(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_5; // 0x9490(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x9530(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_145; // 0x9560(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_144; // 0x95e0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_143; // 0x9660(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_142; // 0x96e0(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_4; // 0x9760(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x9800(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x9830(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_141; // 0x98d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_140; // 0x9950(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_139; // 0x99d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_138; // 0x9a50(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_137; // 0x9ad0(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_3; // 0x9b50(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x9bf0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_136; // 0x9c20(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_135; // 0x9ca0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_134; // 0x9d20(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_133; // 0x9da0(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_29; // 0x9e20(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_132; // 0x9ed0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x9f50(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_131; // 0x9f80(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_130; // 0xa000(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_129; // 0xa080(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_128; // 0xa100(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_28; // 0xa180(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_127; // 0xa230(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0xa2b0(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_26; // 0xa2e0(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0xa3c8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_126; // 0xa468(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_125; // 0xa4e8(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_25; // 0xa568(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0xa650(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0xa6f0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0xa790(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_124; // 0xa830(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_123; // 0xa8b0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_122; // 0xa930(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_24; // 0xa9b0(0xe8)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0xaa98(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0xab38(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_121; // 0xab68(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_120; // 0xabe8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_119; // 0xac68(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_118; // 0xace8(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_27; // 0xad68(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_117; // 0xae18(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0xae98(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_116; // 0xaec8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_115; // 0xaf48(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_114; // 0xafc8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_113; // 0xb048(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_26; // 0xb0c8(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_112; // 0xb178(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0xb1f8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_111; // 0xb228(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_110; // 0xb2a8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_109; // 0xb328(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_108; // 0xb3a8(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_25; // 0xb428(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_107; // 0xb4d8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0xb558(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_106; // 0xb588(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_105; // 0xb608(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_104; // 0xb688(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_103; // 0xb708(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_102; // 0xb788(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_101; // 0xb808(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_24; // 0xb888(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_100; // 0xb938(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_99; // 0xb9b8(0x80)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0xba38(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_23; // 0xbb00(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0xbbe8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_98; // 0xbca8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0xbd28(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_97; // 0xbd58(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_96; // 0xbdd8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_95; // 0xbe58(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_94; // 0xbed8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_93; // 0xbf58(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_92; // 0xbfd8(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_23; // 0xc058(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_91; // 0xc108(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_90; // 0xc188(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_22; // 0xc208(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0xc2f0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_89; // 0xc3b8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0xc438(0xc0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0xc4f8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_88; // 0xc528(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_87; // 0xc5a8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_86; // 0xc628(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_85; // 0xc6a8(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_22; // 0xc728(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84; // 0xc7d8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0xc858(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83; // 0xc888(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82; // 0xc908(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81; // 0xc988(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80; // 0xca08(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_21; // 0xca88(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79; // 0xcb38(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0xcbb8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78; // 0xcbe8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77; // 0xcc68(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76; // 0xcce8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75; // 0xcd68(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_20; // 0xcde8(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74; // 0xce98(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0xcf18(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73; // 0xcf48(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72; // 0xcfc8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71; // 0xd048(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70; // 0xd0c8(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_19; // 0xd148(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69; // 0xd1f8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0xd278(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68; // 0xd2a8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67; // 0xd328(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0xd3a8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0xd428(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_18; // 0xd4a8(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0xd558(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xd5d8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0xd608(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0xd688(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0xd708(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0xd788(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_17; // 0xd808(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59; // 0xd8b8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58; // 0xd938(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xd9b8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57; // 0xd9e8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56; // 0xda68(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55; // 0xdae8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54; // 0xdb68(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53; // 0xdbe8(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_16; // 0xdc68(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52; // 0xdd18(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51; // 0xdd98(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50; // 0xde18(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_15; // 0xde98(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0xdf48(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0xdfc8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0xe048(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0xe0e8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0xe118(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0xe198(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0xe218(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0xe298(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0xe318(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0xe3b8(0x30)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_14; // 0xe3e8(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_13; // 0xe498(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0xe548(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0xe5c8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0xe648(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0xe6c8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0xe748(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0xe7c8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0xe848(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0xe8c8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0xe948(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xe9c8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0xea90(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xeb10(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0xeb40(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0xebc0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0xec40(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0xecc0(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_12; // 0xed40(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0xedf0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xee70(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0xeea0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0xef20(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0xefa0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0xf020(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_11; // 0xf0a0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0xf150(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xf1d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0xf200(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0xf280(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0xf300(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0xf380(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10; // 0xf400(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0xf4b0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xf530(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_21; // 0xf560(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_20; // 0xf648(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_19; // 0xf730(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0xf818(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9; // 0xf8b8(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18; // 0xf968(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17; // 0xfa50(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16; // 0xfb38(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0xfc20(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0xfd08(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0xfda8(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0xfe58(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0xff40(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x10028(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x100d8(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0x10178(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x10228(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x102d8(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x10378(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x10460(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x10548(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x10630(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x10718(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x10800(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x108e8(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x109d0(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x10a98(0xe8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x10b80(0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x10c48(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x10cf8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x10de0(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x10ec8(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x10f68(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x11018(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x11100(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x111e8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x11218(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x112c8(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x11348(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x11408(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x11430(0x158)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x11588(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x11608(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x11688(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x116b0(0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x116f8(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x117a8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x117d0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x11928(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x11950(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x11a00(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x11a80(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x11b00(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x11b80(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x11c00(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x11c80(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x11d40(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x11d68(0x80)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x11de8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x11f40(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x11f68(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x11f90(0x158)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x120e8(0x80)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x12168(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x121b0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x12250(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x122d0(0x80)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x12350(0x158)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x124a8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x12528(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x125a8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x12628(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x126a8(0x80)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x12728(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x12758(0x80)
	float Delta Time X; // 0x127d8(0x04)
	char pad_127DC[0x4]; // 0x127dc(0x04)
	struct ASurvivorMasterBP_C* Surv; // 0x127e0(0x08)
	bool IsInAir?; // 0x127e8(0x01)
	char pad_127E9[0x3]; // 0x127e9(0x03)
	float Speed; // 0x127ec(0x04)
	float Direction; // 0x127f0(0x04)
	float Blend Weights 0; // 0x127f4(0x04)
	bool Capture Mode?; // 0x127f8(0x01)
	enum class MovementTypeEnum MovementType; // 0x127f9(0x01)
	bool Idle2?; // 0x127fa(0x01)
	enum class SurvChars Surv Char; // 0x127fb(0x01)
	struct FRotator HeadRotation; // 0x127fc(0x0c)
	int32_t Health; // 0x12808(0x04)
	int32_t KillerType; // 0x1280c(0x04)
	float VerticalCameraAxis; // 0x12810(0x04)
	enum class SurvStateEnum SurvStateEnum; // 0x12814(0x01)
	bool Attack?; // 0x12815(0x01)
	bool EndJump?; // 0x12816(0x01)
	char pad_12817[0x1]; // 0x12817(0x01)
	float HorizontalCameraAxis; // 0x12818(0x04)
	bool TurnLeft?; // 0x1281c(0x01)
	bool TurnRight?; // 0x1281d(0x01)
	bool GetReady?; // 0x1281e(0x01)
	bool Crawl?; // 0x1281f(0x01)
	bool Grapple?; // 0x12820(0x01)
	bool OnChair?; // 0x12821(0x01)
	bool AlarmReloading?; // 0x12822(0x01)
	bool FPP?; // 0x12823(0x01)
	bool Stop Move?; // 0x12824(0x01)
	bool Custom Play Anim Walk?; // 0x12825(0x01)
	char pad_12826[0x2]; // 0x12826(0x02)
	struct UAnimMontage* IdleToIdleCrawl; // 0x12828(0x08)
	struct UAnimMontage* DropChairMontage; // 0x12830(0x08)
	struct UAnimMontage* SelfGetOutMontage; // 0x12838(0x08)
	struct UAnimMontage* HelpGetOutMontage; // 0x12840(0x08)
	bool Hitted?; // 0x12848(0x01)
	char pad_12849[0x3]; // 0x12849(0x03)
	float HasItem; // 0x1284c(0x04)
	enum class ItemType ItemType; // 0x12850(0x01)
	bool StartCrawl?; // 0x12851(0x01)
	bool IsOwner?; // 0x12852(0x01)
	bool ItemTake?; // 0x12853(0x01)
	bool Failed?; // 0x12854(0x01)
	bool RandomSelfGetOut?; // 0x12855(0x01)
	bool TaigaBonesTransform?; // 0x12856(0x01)
	bool NotTestMode?; // 0x12857(0x01)
	bool Escape Loop; // 0x12858(0x01)
	bool Intro Anim?; // 0x12859(0x01)
	char pad_1285A[0x2]; // 0x1285a(0x02)
	float RandomPlayRateIntro; // 0x1285c(0x04)
	float AlphaAdditiveSpeed; // 0x12860(0x04)
	float Rotation; // 0x12864(0x04)
	bool Escape?; // 0x12868(0x01)
	bool Tutorial?; // 0x12869(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function BPA_RHG_AnimGame.BPA_RHG_AnimGame_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_AnimGame_AnimGraphNode_TransitionResult_DB87C69F4BEC55F36C9BA7B9ED5C635F(); // Function BPA_RHG_AnimGame.BPA_RHG_AnimGame_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_AnimGame_AnimGraphNode_TransitionResult_DB87C69F4BEC55F36C9BA7B9ED5C635F // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_AnimGame_AnimGraphNode_TransitionResult_6CCAB0244D383B0A7E8A4C8C9D93487B(); // Function BPA_RHG_AnimGame.BPA_RHG_AnimGame_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_AnimGame_AnimGraphNode_TransitionResult_6CCAB0244D383B0A7E8A4C8C9D93487B // (BlueprintEvent) // @ game+0x132e1a0
