// AnimBlueprintGeneratedClass BPA_RHG_Lobby.BPA_RHG_Lobby_C
// Size: 0x1f4a (Inherited: 0x2c0)
struct UBPA_RHG_Lobby_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x2f8(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x3a8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x3d0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x450(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x480(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x500(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_12; // 0x530(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x5e0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x608(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x688(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x6b8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x738(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_11; // 0x768(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x818(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x840(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x8c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x8f0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x970(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_10; // 0x9a0(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xa50(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0xa78(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0xaf8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0xb28(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0xba8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0xbd8(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xc88(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0xcb0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0xd30(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0xd60(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0xde0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0xe10(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0xec0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0xf40(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0xf70(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0xff0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x1020(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x10d0(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1170(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x1220(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x1248(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x12c8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x12f8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x1378(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x13a8(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x1458(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1480(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1500(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1530(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x15b0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x15e0(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x1690(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x16b8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1738(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1768(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x17e8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x1818(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x18c8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x18f0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1970(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x19a0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1a20(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x1a50(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1b00(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1b28(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1ba8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x1bd8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1c58(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x1c88(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x1d38(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1db8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1de8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1e68(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1e98(0xb0)
	enum class SurvChars SurvChar; // 0x1f48(0x01)
	bool Reset?; // 0x1f49(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function BPA_RHG_Lobby.BPA_RHG_Lobby_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_F506E56142FB833D6B6AF4B3BC654F56(); // Function BPA_RHG_Lobby.BPA_RHG_Lobby_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_F506E56142FB833D6B6AF4B3BC654F56 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_90AFDA004E5411A6716327B0B670240D(); // Function BPA_RHG_Lobby.BPA_RHG_Lobby_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_90AFDA004E5411A6716327B0B670240D // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_53065F4A4E8C52C979D028AF12271F7C(); // Function BPA_RHG_Lobby.BPA_RHG_Lobby_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_53065F4A4E8C52C979D028AF12271F7C // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_CF8AAD2B4396CE0A463661AAC3BE4269(); // Function BPA_RHG_Lobby.BPA_RHG_Lobby_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_CF8AAD2B4396CE0A463661AAC3BE4269 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_5C7169D14048F35A35A841B7D187A3D9(); // Function BPA_RHG_Lobby.BPA_RHG_Lobby_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_5C7169D14048F35A35A841B7D187A3D9 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_97C47E4A40AF61D907616E969389AA41(); // Function BPA_RHG_Lobby.BPA_RHG_Lobby_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_97C47E4A40AF61D907616E969389AA41 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_42759A1842B6EDB0D647D4A0DACF4BB8(); // Function BPA_RHG_Lobby.BPA_RHG_Lobby_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_42759A1842B6EDB0D647D4A0DACF4BB8 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_227E00DD4CA9B0AD6773D9BEE60C7B9D(); // Function BPA_RHG_Lobby.BPA_RHG_Lobby_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_227E00DD4CA9B0AD6773D9BEE60C7B9D // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_C73CE4A3453857CEA7E75483A1D81A04(); // Function BPA_RHG_Lobby.BPA_RHG_Lobby_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_C73CE4A3453857CEA7E75483A1D81A04 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_C387604448A4B222F5CEC2A61793EA3D(); // Function BPA_RHG_Lobby.BPA_RHG_Lobby_C.EvaluateGraphExposedInputs_ExecuteUbergraph_BPA_RHG_Lobby_AnimGraphNode_TransitionResult_C387604448A4B222F5CEC2A61793EA3D // (BlueprintEvent) // @ game+0x132e1a0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function BPA_RHG_Lobby.BPA_RHG_Lobby_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void ResetAnim(); // Function BPA_RHG_Lobby.BPA_RHG_Lobby_C.ResetAnim // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void Timer(); // Function BPA_RHG_Lobby.BPA_RHG_Lobby_C.Timer // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void ExecuteUbergraph_BPA_RHG_Lobby(int32_t EntryPoint); // Function BPA_RHG_Lobby.BPA_RHG_Lobby_C.ExecuteUbergraph_BPA_RHG_Lobby // (Final|UbergraphFunction|HasDefaults) // @ game+0x132e1a0
};

