// AnimBlueprintGeneratedClass Doppel_Knife_AnimBP.Doppel_Knife_AnimBP_C
// Size: 0xa16 (Inherited: 0x2c0)
struct UDoppel_Knife_AnimBP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x3c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x3e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x410(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x438(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x460(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x4e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x510(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x590(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x5c0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x640(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x6e0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x760(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7e0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x880(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x8b0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x930(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x960(0xb0)
	bool ImSurv?; // 0xa10(0x01)
	bool Switch?; // 0xa11(0x01)
	bool HiddenAttack?; // 0xa12(0x01)
	bool HardHit?; // 0xa13(0x01)
	bool TPP?; // 0xa14(0x01)
	bool Local?; // 0xa15(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function Doppel_Knife_AnimBP.Doppel_Knife_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_6B6EFD2C427BB4FB18F360AAE5026AFE(); // Function Doppel_Knife_AnimBP.Doppel_Knife_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_6B6EFD2C427BB4FB18F360AAE5026AFE // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_4B813DC9414C58DE69D73B83349A5BEB(); // Function Doppel_Knife_AnimBP.Doppel_Knife_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_4B813DC9414C58DE69D73B83349A5BEB // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_5179A1FC4FC80D8A0C44C282F7828B80(); // Function Doppel_Knife_AnimBP.Doppel_Knife_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_5179A1FC4FC80D8A0C44C282F7828B80 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_B04A31A247AC72487D3C238F5B49185B(); // Function Doppel_Knife_AnimBP.Doppel_Knife_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_B04A31A247AC72487D3C238F5B49185B // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_E62F6A5A4CDFED119206F2A4EF767EA7(); // Function Doppel_Knife_AnimBP.Doppel_Knife_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_E62F6A5A4CDFED119206F2A4EF767EA7 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_C3812D6D4B45E834BFDA0A94DBEABD35(); // Function Doppel_Knife_AnimBP.Doppel_Knife_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_C3812D6D4B45E834BFDA0A94DBEABD35 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_BC16FC3D4026F1D4244A6D81D3652CC0(); // Function Doppel_Knife_AnimBP.Doppel_Knife_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_BC16FC3D4026F1D4244A6D81D3652CC0 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_DE2A613848F75B8E5879AFBCACE3E7FC(); // Function Doppel_Knife_AnimBP.Doppel_Knife_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_DE2A613848F75B8E5879AFBCACE3E7FC // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_3FAA408E4AE3B140A7750BA50DBEB751(); // Function Doppel_Knife_AnimBP.Doppel_Knife_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_Knife_AnimBP_AnimGraphNode_TransitionResult_3FAA408E4AE3B140A7750BA50DBEB751 // (BlueprintEvent) // @ game+0x132e1a0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Doppel_Knife_AnimBP.Doppel_Knife_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void HardHit(); // Function Doppel_Knife_AnimBP.Doppel_Knife_AnimBP_C.HardHit // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void ExecuteUbergraph_Doppel_Knife_AnimBP(int32_t EntryPoint); // Function Doppel_Knife_AnimBP.Doppel_Knife_AnimBP_C.ExecuteUbergraph_Doppel_Knife_AnimBP // (Final|UbergraphFunction) // @ game+0x132e1a0
};

