// AnimBlueprintGeneratedClass Doppel_FPP_AnimBP.Doppel_FPP_AnimBP_C
// Size: 0x3234 (Inherited: 0x2c0)
struct UDoppel_FPP_AnimBP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x2c8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x420(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x448(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x4c8(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x548(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x570(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x630(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x658(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x6f8(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x798(0x158)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x8f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x918(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x940(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x968(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x990(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x9b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x9e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0xa08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0xa30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0xa58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0xa80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0xaa8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0xad0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0xaf8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0xb20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0xb48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0xb70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0xb98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0xbc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0xbe8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0xc10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0xc38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0xc60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0xc88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0xcb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0xcd8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0xd00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0xd28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0xd50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0xd78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0xda0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0xdc8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0xdf0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0xe18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0xe40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0xe68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0xe90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0xeb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0xee0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0xf08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0xf30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xf58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xf80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xfa8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xfd0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xff8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x1020(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x1048(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x1070(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x1098(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x10c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x10e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x1110(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x1138(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x1160(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x1188(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x11b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x11d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1200(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x1228(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x12c8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x1348(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x13c8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x1468(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x14e8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x1568(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x1608(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1688(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x16b8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x1738(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x17d8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x1858(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x1888(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x1970(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1a10(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x1af8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x1b28(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1ba8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x1bd8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1c58(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x1c88(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1d08(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x1d38(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1db8(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x1de8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x1e88(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x1f08(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x1f88(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x2028(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x20a8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x2128(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x21c8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2248(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x2278(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x2318(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x2398(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x2418(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x2448(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x24c8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x2548(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x25e8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x2688(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x2708(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x2788(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x2828(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x2858(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x28d8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x2958(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x29f8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x2a28(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x2aa8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x2b28(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x2bc8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x2c68(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x2d08(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x2d88(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2e08(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x2e38(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x2eb8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2f38(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2fd8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3008(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x30b8(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x30e8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3188(0x80)
	float keepSurv; // 0x3208(0x04)
	bool IsInAir; // 0x320c(0x01)
	char pad_320D[0x3]; // 0x320d(0x03)
	float Speed; // 0x3210(0x04)
	float Direction; // 0x3214(0x04)
	int32_t TypeAttack; // 0x3218(0x04)
	bool AttackBool; // 0x321c(0x01)
	bool JumpEndChek; // 0x321d(0x01)
	bool FIRE; // 0x321e(0x01)
	bool Plant; // 0x321f(0x01)
	bool MarioStun; // 0x3220(0x01)
	bool ImSurv?; // 0x3221(0x01)
	bool Switch?; // 0x3222(0x01)
	bool SchoolBell?; // 0x3223(0x01)
	bool Flashed; // 0x3224(0x01)
	bool HiddenAttack?; // 0x3225(0x01)
	bool HardHit?; // 0x3226(0x01)
	bool PropHunt?; // 0x3227(0x01)
	float SpeedRateF; // 0x3228(0x04)
	float Delta Time X; // 0x322c(0x04)
	float TimeRun; // 0x3230(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function Doppel_FPP_AnimBP.Doppel_FPP_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void speedTime(); // Function Doppel_FPP_AnimBP.Doppel_FPP_AnimBP_C.speedTime // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void SpeedRate(); // Function Doppel_FPP_AnimBP.Doppel_FPP_AnimBP_C.SpeedRate // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_FPP_AnimBP_AnimGraphNode_BlendListByBool_338B054945347B4F9CB5C0853EB2B785(); // Function Doppel_FPP_AnimBP.Doppel_FPP_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppel_FPP_AnimBP_AnimGraphNode_BlendListByBool_338B054945347B4F9CB5C0853EB2B785 // (BlueprintEvent) // @ game+0x132e1a0
