// AnimBlueprintGeneratedClass Doppelganger_AnimBP.Doppelganger_AnimBP_C
// Size: 0x3a78 (Inherited: 0x2c0)
struct UDoppelganger_AnimBP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x2c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x2f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x318(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x340(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x368(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x390(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x3b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x3e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x408(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x430(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x458(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x480(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x4a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x4d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x4f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x520(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x548(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x570(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x598(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x5c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x5e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x610(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x638(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x660(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x688(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x6b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x6d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x700(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x728(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x750(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x778(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x7a0(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x888(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x948(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x9c8(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x9f8(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0xae0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0xba0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0xc20(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0xc50(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0xd38(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0xdf8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0xe78(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0xea8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0xf48(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0xfc8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x1048(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x10c8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1168(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x1198(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1218(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x1248(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x12c8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x12f8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x1378(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x13f8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x1478(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x14f8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x1578(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x15f8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x1678(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x16f8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x1798(0xa0)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x1838(0xa0)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x18d8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x1978(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x1a18(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x1ad8(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1bc0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x1bf0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1c70(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x1ca0(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x1d20(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x1de8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1e68(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x1e98(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x1f18(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x1fe0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x2060(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x2090(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x2158(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x21d8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2258(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x2288(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x2308(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x2388(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x2428(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x24a8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x2528(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x25c8(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x2688(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x2770(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x2858(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x28d8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x2958(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x29f8(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x2a98(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x2b80(0xc0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2c40(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x2d08(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x2df0(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2ed8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2f08(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x2fb8(0x158)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x3110(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x3190(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x3250(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x32f0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x3318(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x33b8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x33e0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x34a0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x34c8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x3620(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x3648(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x36c8(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x3788(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3828(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x3850(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x38d0(0xa0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x3970(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x39a0(0x80)
	int32_t KillerType; // 0x3a20(0x04)
	float IsHolded; // 0x3a24(0x04)
	bool IsOnAir?; // 0x3a28(0x01)
	char pad_3A29[0x3]; // 0x3a29(0x03)
	float Speed; // 0x3a2c(0x04)
	float SpeedChek; // 0x3a30(0x04)
	int32_t TypeAttack; // 0x3a34(0x04)
	bool Attak; // 0x3a38(0x01)
	char pad_3A39[0x3]; // 0x3a39(0x03)
	float Direction; // 0x3a3c(0x04)
	bool JumpEndChek; // 0x3a40(0x01)
	bool FIRE; // 0x3a41(0x01)
	bool Plant; // 0x3a42(0x01)
	bool Flashed; // 0x3a43(0x01)
	bool Drop; // 0x3a44(0x01)
	bool ChairDrop; // 0x3a45(0x01)
	bool Catch; // 0x3a46(0x01)
	bool MarioStun; // 0x3a47(0x01)
	bool Runaway; // 0x3a48(0x01)
	char pad_3A49[0x3]; // 0x3a49(0x03)
	struct FRotator HeadR; // 0x3a4c(0x0c)
	float Vertical rotation; // 0x3a58(0x04)
	float HorizontalValue; // 0x3a5c(0x04)
	bool bTurnL; // 0x3a60(0x01)
	bool bTurnR; // 0x3a61(0x01)
	bool IsOwner?; // 0x3a62(0x01)
	bool GrabbedChar?; // 0x3a63(0x01)
	bool SchoolBell?; // 0x3a64(0x01)
	bool HiddenAttack?; // 0x3a65(0x01)
	bool HardHit?; // 0x3a66(0x01)
	char pad_3A67[0x1]; // 0x3a67(0x01)
	float Blend Weights 0; // 0x3a68(0x04)
	float Delta Time X; // 0x3a6c(0x04)
	bool Get Ready; // 0x3a70(0x01)
	bool PropHunt?; // 0x3a71(0x01)
	char pad_3A72[0x2]; // 0x3a72(0x02)
	float SpeedRateF; // 0x3a74(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void SpeedRate(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.SpeedRate // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_BlendListByBool_A29B6EC84B2815B9B7B5F293D5EA2425(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_BlendListByBool_A29B6EC84B2815B9B7B5F293D5EA2425 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_BlendListByBool_6A1ED1B14029AFBF562D318A8DB814E7(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_BlendListByBool_6A1ED1B14029AFBF562D318A8DB814E7 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_3A8721374A8A767E3BE23B9F64126455(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_3A8721374A8A767E3BE23B9F64126455 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_1B1442F843356FFF9DBDB5806E373370(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_1B1442F843356FFF9DBDB5806E373370 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_F8F9D6E645C6C5010C5FCCA596FE8091(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_F8F9D6E645C6C5010C5FCCA596FE8091 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_C73BF9134C0E132F59DD26B582FA6BD6(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_C73BF9134C0E132F59DD26B582FA6BD6 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_9011775C47C133945D3772AA6B12E91D(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_9011775C47C133945D3772AA6B12E91D // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_C73011C24C75FB03A7F1969A19D5A761(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_C73011C24C75FB03A7F1969A19D5A761 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_3BD28C674A5F41E658E9D7AD4B435205(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_3BD28C674A5F41E658E9D7AD4B435205 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_42E3D7A64123A66135594C9C2427CD23(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_42E3D7A64123A66135594C9C2427CD23 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_5CD0379C42B9296050609BA690D3F6FA(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_5CD0379C42B9296050609BA690D3F6FA // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_80CF305A49565A24AC29EE9A32F8A9C4(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_80CF305A49565A24AC29EE9A32F8A9C4 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_C94007A84A2F243B48BCD4903884727E(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_C94007A84A2F243B48BCD4903884727E // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_E65AC498478E1406D0279D95F8672EB0(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_E65AC498478E1406D0279D95F8672EB0 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_76DBA84149E54E78DAD549863214878F(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_76DBA84149E54E78DAD549863214878F // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_25DA8E9043BD6518B8B2F78ADA3F0140(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_25DA8E9043BD6518B8B2F78ADA3F0140 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_40486D264D59265D175FF7AF26673E9B(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_40486D264D59265D175FF7AF26673E9B // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_C46B14A4458F2CF37AE9418D0C3061D6(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_C46B14A4458F2CF37AE9418D0C3061D6 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_795D23CB42ABB0D7C02EC19E7F66B9E5(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_795D23CB42ABB0D7C02EC19E7F66B9E5 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_1405674E408B5CA77B3B43BF2AE65541(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_1405674E408B5CA77B3B43BF2AE65541 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_32662F844B5C6997967B0997070BD8F1(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_32662F844B5C6997967B0997070BD8F1 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_878D7D0F47C02C77BCA9D3A55FD6C22D(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_878D7D0F47C02C77BCA9D3A55FD6C22D // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_5553A3654299E41436078E950E591BFE(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_5553A3654299E41436078E950E591BFE // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_232B3A1D4803035FD0B7BF9BFCA50F25(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_232B3A1D4803035FD0B7BF9BFCA50F25 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_20604CC247F20B9051A3779C4F48B8B9(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_20604CC247F20B9051A3779C4F48B8B9 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_2071DB864C27EF339539F0A210925DC7(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_2071DB864C27EF339539F0A210925DC7 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_FF28FF95426181CD5B224C94D7DE1229(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Doppelganger_AnimBP_AnimGraphNode_TransitionResult_FF28FF95426181CD5B224C94D7DE1229 // (BlueprintEvent) // @ game+0x132e1a0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void BlueprintBeginPlay(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.BlueprintBeginPlay // (Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void AnimNotify_R_Leg(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.AnimNotify_R_Leg // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void AnimNotify_JumpEnd(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.AnimNotify_JumpEnd // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void AnimNotify_L_Leg(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.AnimNotify_L_Leg // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void AnimNotify_JumpStart(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.AnimNotify_JumpStart // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void AnimNotify_CloseLeg(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.AnimNotify_CloseLeg // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void AnimNotify_Close_Left(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.AnimNotify_Close_Left // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void AnimNotify_Close_right(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.AnimNotify_Close_right // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void HardHit(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.HardHit // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void AnimNotify_Close_Leg(); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.AnimNotify_Close_Leg // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void ExecuteUbergraph_Doppelganger_AnimBP(int32_t EntryPoint); // Function Doppelganger_AnimBP.Doppelganger_AnimBP_C.ExecuteUbergraph_Doppelganger_AnimBP // (Final|UbergraphFunction|HasDefaults) // @ game+0x132e1a0
};

