// AnimBlueprintGeneratedClass FPAnimBlueprint.FPAnimBlueprint_C
// Size: 0x22ad (Inherited: 0x2c0)
struct UFPAnimBlueprint_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0x3c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0x3e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0x410(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0x438(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0x460(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0x488(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0x4b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x4d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x500(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x528(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x550(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x578(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x5a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x5c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x5f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x618(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x640(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x668(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x690(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x6b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x6e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x708(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x730(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0x758(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0x780(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x7a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x7d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x7f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x820(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x848(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x870(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x898(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x8c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x8e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x910(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x938(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x960(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x988(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x9b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x9d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0xa00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0xa28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0xa50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0xa78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0xaa0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0xac8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0xaf0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0xb18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0xb40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0xb68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0xb90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0xbb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0xbe0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0xc08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0xc30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0xc58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xc80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xca8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xcd0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xcf8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xd20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xd48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xd70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xd98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xdc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xde8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xe10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xe38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xe60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xe88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xeb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xed8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xf00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xf28(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0xf50(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0xfd0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x1000(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x1080(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x10b0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x1130(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x1160(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x11e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x1210(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1290(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x12c0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x1340(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x1370(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x13f0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x14b8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x1538(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x1568(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x15e8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x1618(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1698(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x16c8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1748(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1778(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x17f8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1828(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x18a8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1948(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x19c8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x19f8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1a78(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1b18(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1b98(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1bc8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1c48(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1ce8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1d68(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1d98(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1e80(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x1eb0(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1f30(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x1ff8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2078(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x20a8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2128(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2158(0xb0)
	struct FAnimNode_Inertialization AnimGraphNode_Inertialization; // 0x2208(0x70)
	float Speed; // 0x2278(0x04)
	bool IsInAir; // 0x227c(0x01)
	bool AttackBool; // 0x227d(0x01)
	char pad_227E[0x2]; // 0x227e(0x02)
	float keepSurv; // 0x2280(0x04)
	bool JumpEndChek; // 0x2284(0x01)
	bool FIRE; // 0x2285(0x01)
	bool Plant; // 0x2286(0x01)
	char pad_2287[0x1]; // 0x2287(0x01)
	float Direction; // 0x2288(0x04)
	int32_t TypeAttack; // 0x228c(0x04)
	bool MarioStun; // 0x2290(0x01)
	bool Flashed; // 0x2291(0x01)
	bool PropHunt?; // 0x2292(0x01)
	char pad_2293[0x1]; // 0x2293(0x01)
	float Delta Time X; // 0x2294(0x04)
	bool SpeedB; // 0x2298(0x01)
	bool StopRunB; // 0x2299(0x01)
	char pad_229A[0x2]; // 0x229a(0x02)
	float StopRunDelay; // 0x229c(0x04)
	bool Hard Hit?; // 0x22a0(0x01)
	char pad_22A1[0x3]; // 0x22a1(0x03)
	float SpeedRateF; // 0x22a4(0x04)
	float TimeRun; // 0x22a8(0x04)
	bool NewVar_1; // 0x22ac(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function FPAnimBlueprint.FPAnimBlueprint_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void speedTime(); // Function FPAnimBlueprint.FPAnimBlueprint_C.speedTime // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void SpeedRate(float NewParam); // Function FPAnimBlueprint.FPAnimBlueprint_C.SpeedRate // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPAnimBlueprint_AnimGraphNode_TransitionResult_C82DA16146693852AB56E28266B3C9D1(); // Function FPAnimBlueprint.FPAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_FPAnimBlueprint_AnimGraphNode_TransitionResult_C82DA16146693852AB56E28266B3C9D1 // (BlueprintEvent) // @ game+0x132e1a0
