// AnimBlueprintGeneratedClass FPGrannyAnimBP.FPGrannyAnimBP_C
// Size: 0x35f0 (Inherited: 0x2c0)
struct UFPGrannyAnimBP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_125; // 0x2f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_124; // 0x320(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_123; // 0x348(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_122; // 0x370(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_121; // 0x398(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_120; // 0x3c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_119; // 0x3e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_118; // 0x410(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_117; // 0x438(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_116; // 0x460(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_115; // 0x488(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_114; // 0x4b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_113; // 0x4d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_112; // 0x500(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_111; // 0x528(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_110; // 0x550(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_109; // 0x578(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_108; // 0x5a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_107; // 0x5c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_106; // 0x5f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_105; // 0x618(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_104; // 0x640(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_103; // 0x668(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_102; // 0x690(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_101; // 0x6b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_100; // 0x6e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_99; // 0x708(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_98; // 0x730(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_97; // 0x758(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_96; // 0x780(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_95; // 0x7a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_94; // 0x7d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93; // 0x7f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92; // 0x820(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91; // 0x848(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90; // 0x870(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89; // 0x898(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88; // 0x8c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87; // 0x8e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86; // 0x910(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85; // 0x938(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84; // 0x960(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83; // 0x988(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82; // 0x9b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81; // 0x9d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80; // 0xa00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79; // 0xa28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78; // 0xa50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0xa78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0xaa0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0xac8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0xaf0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0xb18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0xb40(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0xb68(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0xb90(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0xbb8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0xbe0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0xc08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0xc30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0xc58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0xc80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0xca8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0xcd0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0xcf8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0xd20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0xd48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0xd70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0xd98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0xdc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0xde8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0xe10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0xe38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0xe60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0xe88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0xeb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0xed8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0xf00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0xf28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0xf50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0xf78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0xfa0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0xfc8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0xff0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x1018(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x1040(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x1068(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x1090(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x10b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x10e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x1108(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x1130(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x1158(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x1180(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x11a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x11d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x11f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x1220(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x1248(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x1270(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x1298(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x12c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x12e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x1310(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x1338(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x1360(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x1388(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x13b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x13d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x1400(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x1428(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x1450(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x1478(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x14a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x14c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x14f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x1518(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x1540(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x1568(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x1590(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x15b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x15e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x1608(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x1630(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1658(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x1680(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x1700(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x1730(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x17b0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x17e0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x1860(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x1890(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x1910(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x1940(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x19c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x19f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x1a70(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x1af0(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x1bb8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x1be8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x1c68(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x1c98(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x1d18(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x1d98(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x1e60(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x1e90(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1f10(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x1f40(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x1fc0(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x2060(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x2128(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x21a8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x2228(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x2258(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x22d8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x2378(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x23f8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x2428(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x24a8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x2570(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x25f0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x2620(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x26a0(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x2768(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x27e8(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x2818(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x28e0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x2960(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x29e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x2a10(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x2a90(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x2ac0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2b40(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x2b70(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x2bf0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x2c20(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x2ca0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x2d40(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x2dc0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x2df0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x2e70(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2ef0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2f90(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x3030(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x30b0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x30e0(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x3160(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x3200(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x32c8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3348(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x33c8(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x33f8(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x34e0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3510(0xb0)
	float keepSurv; // 0x35c0(0x04)
	bool IsInAir; // 0x35c4(0x01)
	char pad_35C5[0x3]; // 0x35c5(0x03)
	float Speed; // 0x35c8(0x04)
	bool AttackBool; // 0x35cc(0x01)
	bool JumpEndChek; // 0x35cd(0x01)
	bool FIRE; // 0x35ce(0x01)
	bool Plant; // 0x35cf(0x01)
	bool KnifeIn; // 0x35d0(0x01)
	bool KnifeSpawn; // 0x35d1(0x01)
	char pad_35D2[0x2]; // 0x35d2(0x02)
	float Direction; // 0x35d4(0x04)
	bool MarioStun; // 0x35d8(0x01)
	char pad_35D9[0x3]; // 0x35d9(0x03)
	int32_t TypeAttack; // 0x35dc(0x04)
	bool Astral; // 0x35e0(0x01)
	bool Flashed; // 0x35e1(0x01)
	bool PropHunt?; // 0x35e2(0x01)
	char pad_35E3[0x1]; // 0x35e3(0x01)
	float SpeedRateF; // 0x35e4(0x04)
	float TimeRun; // 0x35e8(0x04)
	float Delta Time X; // 0x35ec(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function FPGrannyAnimBP.FPGrannyAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void SpeedRate(); // Function FPGrannyAnimBP.FPGrannyAnimBP_C.SpeedRate // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_FPGrannyAnimBP_AnimGraphNode_TransitionResult_3CDE99F04D5B89874FA09FA431AFBBA4(); // Function FPGrannyAnimBP.FPGrannyAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_FPGrannyAnimBP_AnimGraphNode_TransitionResult_3CDE99F04D5B89874FA09FA431AFBBA4 // (BlueprintEvent) // @ game+0x132e1a0
