// AnimBlueprintGeneratedClass GrandmaAnimBP.GrandmaAnimBP_C
// Size: 0x38bc (Inherited: 0x2c0)
struct UGrandmaAnimBP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x2c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x2f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x318(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x340(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x368(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x390(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x3b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x3e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x408(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x430(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x458(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x480(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x4a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x4d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x4f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0x520(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0x548(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x570(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x598(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x5c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x5e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x610(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x638(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x660(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x688(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x6b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x6d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x700(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x728(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x750(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x778(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x7a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x7c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x7f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x818(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x840(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x868(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x890(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x8b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x8e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x908(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x930(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x958(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x980(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x9a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x9d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x9f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0xa20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xa48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xa70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xa98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xac0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xae8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xb10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xb38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xb60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xb88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xbb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xbd8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xc00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xc28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xc50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xc78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xca0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xcc8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xcf0(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0xd18(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0xe00(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0xec0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0xf40(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0xf70(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x1058(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x1118(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x1198(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x11c8(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x12b0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x1370(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x13f0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x1420(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x14a0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x1520(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x15c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x15f0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1670(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x16a0(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x1720(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x17e0(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x18c8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x18f8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x1978(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x19a8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1a28(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x1a58(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1ad8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x1b08(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1b88(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x1bb8(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x1ca0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x1d60(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1de0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1e10(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x1e90(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x1f78(0xc0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2038(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x2068(0x80)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x20e8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x21b0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x2230(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x2260(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x2328(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x23a8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x2428(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x2458(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x2520(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x25a0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x2620(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x2650(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x2718(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x2800(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x28e8(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x29a8(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2a90(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x2ac0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2b60(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x2c00(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x2c80(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x2d00(0xe8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x2de8(0xc8)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2eb0(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x2f78(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x3060(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x3148(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x3208(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x32f0(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x33b0(0xe8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3498(0xc0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3558(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3640(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3670(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3720(0xa0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x37c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x37f0(0x80)
	int32_t KillerType; // 0x3870(0x04)
	float IsHolded; // 0x3874(0x04)
	bool IsOnAir?; // 0x3878(0x01)
	char pad_3879[0x3]; // 0x3879(0x03)
	float Speed; // 0x387c(0x04)
	float SpeedChek; // 0x3880(0x04)
	bool Attak; // 0x3884(0x01)
	char pad_3885[0x3]; // 0x3885(0x03)
	float Direction; // 0x3888(0x04)
	bool JumpEndChek; // 0x388c(0x01)
	bool FIRE; // 0x388d(0x01)
	bool Plant; // 0x388e(0x01)
	bool Flashed; // 0x388f(0x01)
	bool Drop; // 0x3890(0x01)
	bool ChairDrop; // 0x3891(0x01)
	bool Catch; // 0x3892(0x01)
	bool Runaway; // 0x3893(0x01)
	struct FRotator HeadR; // 0x3894(0x0c)
	float Vertical rotation; // 0x38a0(0x04)
	float HorizontalValue; // 0x38a4(0x04)
	bool bTurnL; // 0x38a8(0x01)
	bool bTurnR; // 0x38a9(0x01)
	bool KnifeIn; // 0x38aa(0x01)
	bool IsOwner?; // 0x38ab(0x01)
	bool KnifeSpawn; // 0x38ac(0x01)
	bool AstralBuild; // 0x38ad(0x01)
	char pad_38AE[0x2]; // 0x38ae(0x02)
	int32_t TypeAttack; // 0x38b0(0x04)
	bool MarioStun; // 0x38b4(0x01)
	bool Get Ready; // 0x38b5(0x01)
	bool PropHunt?; // 0x38b6(0x01)
	char pad_38B7[0x1]; // 0x38b7(0x01)
	float SpeedRateF; // 0x38b8(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function GrandmaAnimBP.GrandmaAnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void Speed Rate(); // Function GrandmaAnimBP.GrandmaAnimBP_C.Speed Rate // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GrandmaAnimBP_AnimGraphNode_BlendListByBool_7F38875B407199F460C9F28550462893(); // Function GrandmaAnimBP.GrandmaAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_GrandmaAnimBP_AnimGraphNode_BlendListByBool_7F38875B407199F460C9F28550462893 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_GrandmaAnimBP_AnimGraphNode_TwoWayBlend_AA06690649A6B8AF043F8290B14713EB(); // Function GrandmaAnimBP.GrandmaAnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_GrandmaAnimBP_AnimGraphNode_TwoWayBlend_AA06690649A6B8AF043F8290B14713EB // (BlueprintEvent) // @ game+0x132e1a0
