// AnimBlueprintGeneratedClass Grandma_Facerig_Skeleton_AnimBlueprint_Lobby.Grandma_Facerig_Skeleton_AnimBlueprint_Lobby_C
// Size: 0x809 (Inherited: 0x2c0)
struct UGrandma_Facerig_Skeleton_AnimBlueprint_Lobby_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2c8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x2f8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x320(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x3a0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x3d0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x450(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x480(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x530(0xa0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x5d0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x5f8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x678(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6a8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x728(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x758(0xb0)
	bool Reset?; // 0x808(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function Grandma_Facerig_Skeleton_AnimBlueprint_Lobby.Grandma_Facerig_Skeleton_AnimBlueprint_Lobby_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Grandma_Facerig_Skeleton_AnimBlueprint_Lobby_AnimGraphNode_TransitionResult_DA7F60C44F071D5702AC0FAB42083D34(); // Function Grandma_Facerig_Skeleton_AnimBlueprint_Lobby.Grandma_Facerig_Skeleton_AnimBlueprint_Lobby_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Grandma_Facerig_Skeleton_AnimBlueprint_Lobby_AnimGraphNode_TransitionResult_DA7F60C44F071D5702AC0FAB42083D34 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Grandma_Facerig_Skeleton_AnimBlueprint_Lobby_AnimGraphNode_TransitionResult_441F1BD846DAEA611FA1FD99747E61BE(); // Function Grandma_Facerig_Skeleton_AnimBlueprint_Lobby.Grandma_Facerig_Skeleton_AnimBlueprint_Lobby_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Grandma_Facerig_Skeleton_AnimBlueprint_Lobby_AnimGraphNode_TransitionResult_441F1BD846DAEA611FA1FD99747E61BE // (BlueprintEvent) // @ game+0x132e1a0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Grandma_Facerig_Skeleton_AnimBlueprint_Lobby.Grandma_Facerig_Skeleton_AnimBlueprint_Lobby_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void ExecuteUbergraph_Grandma_Facerig_Skeleton_AnimBlueprint_Lobby(int32_t EntryPoint); // Function Grandma_Facerig_Skeleton_AnimBlueprint_Lobby.Grandma_Facerig_Skeleton_AnimBlueprint_Lobby_C.ExecuteUbergraph_Grandma_Facerig_Skeleton_AnimBlueprint_Lobby // (Final|UbergraphFunction) // @ game+0x132e1a0
};

