// UserDefinedStruct ItemDrop.ItemDrop
// Size: 0x24 (Inherited: 0x00)
struct FItemDrop {
	float ItemDropChance_8_D6248C6541DAA7F3CE6B3785A5A0ED7D; // 0x00(0x04)
	float CommonChance_18_7CF7F79748CEFAF8A3D8D39011423D7D; // 0x04(0x04)
	float RareChance_22_CBAC848F490149EF430A04BE43B4190F; // 0x08(0x04)
	float EpicChance_23_A4F4549C45E760B47A4A43A6B8F5B5A8; // 0x0c(0x04)
	float LegendaryChance_24_4A356FF048244B28BF25EC8893CA2CDD; // 0x10(0x04)
	char pad_14[0x4]; // 0x14(0x04)
	struct UStaticMesh* ItemMesh_27_AAE054B0441866D0C22B739F0DCE472D; // 0x18(0x08)
	int32_t Amount_37_0D2ACC734EE0F398A4262CA4BBE0F8A8; // 0x20(0x04)
};

