// UserDefinedStruct ItemStructure.ItemStructure
// Size: 0x28 (Inherited: 0x00)
struct FItemStructure {
	struct AItemsBPHand_C* ClassType_17_EEB62D934DDA8335475757A08EBF5D74; // 0x00(0x08)
	enum class ItemType ItemType_16_FA342E8D42CD4619F85BC1910E58EA95; // 0x08(0x01)
	enum class Rarity Rarity_6_3EC419A94BB7BA10A49EAFAEF87ED344; // 0x09(0x01)
	char pad_A[0x2]; // 0x0a(0x02)
	int32_t Charges_9_AFFB73B748526E18AA853EAF63CCBF6E; // 0x0c(0x04)
	bool CD?_18_3D72EBF7446A0D2767A5539B9CD640E8; // 0x10(0x01)
	char pad_11[0x3]; // 0x11(0x03)
	float TimerCD_21_9DC10C674F935EAD3A94059434C78B60; // 0x14(0x04)
	float CurrentTimerCD_23_4200051A40A5F36786960FB193271DAE; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct AItemsBP_C* ClassTypePickUp_27_16B64D1443A9018F9E85FC83ABEFC2A6; // 0x20(0x08)
};

