// BlueprintGeneratedClass KillerMasterBP.KillerMasterBP_C
// Size: 0x1226 (Inherited: 0x4e0)
struct AKillerMasterBP_C : APhysicsCharacter {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4e0(0x08)
	struct USceneComponent* CoinSpawn; // 0x4e8(0x08)
	struct UCameraComponent* FPPCamera; // 0x4f0(0x08)
	struct USoundCommandKiller_C* SoundCommandKiller; // 0x4f8(0x08)
	struct USceneComponent* KnifeLoc; // 0x500(0x08)
	struct USceneCaptureComponent2D* SceneCaptureComponent2D; // 0x508(0x08)
	struct UBoxComponent* Box1; // 0x510(0x08)
	struct UGraffityMakerHit_C* GraffityMakerHit; // 0x518(0x08)
	struct UPerkManager_C* PerkManager; // 0x520(0x08)
	struct UWidgetComponent* NicknameWidget; // 0x528(0x08)
	struct UShootProphunt_C* ShootProphunt; // 0x530(0x08)
	struct UAIPerceptionStimuliSourceComponent* AIPerceptionStimuliSource; // 0x538(0x08)
	struct UFMODAudioComponent* KillerIdle; // 0x540(0x08)
	struct UGraffityMaker_C* GraffityMaker; // 0x548(0x08)
	struct UFMODAudioComponent* JumpSound; // 0x550(0x08)
	struct UFMODAudioComponent* ChaseAudio; // 0x558(0x08)
	struct USceneComponent* StunSceneCheck; // 0x560(0x08)
	struct UParticleSystemComponent* Stund; // 0x568(0x08)
	struct USoundChatSounds_C* SoundChatSounds; // 0x570(0x08)
	struct UBoxComponent* StunCollision; // 0x578(0x08)
	struct UCheckInteractableKiller_C* CheckInteractableKiller; // 0x580(0x08)
	struct UAlarmsWidgetSize_C* AlarmsWidgetSize; // 0x588(0x08)
	struct UBoxComponent* Box; // 0x590(0x08)
	struct USceneComponent* SurvEndPlace; // 0x598(0x08)
	struct USceneComponent* SurvBeginPlace; // 0x5a0(0x08)
	struct UVoipAudioComponent* VoipAudio; // 0x5a8(0x08)
	struct UVoipManagerComponent* VoipManager; // 0x5b0(0x08)
	struct UPostProcessComponent* PostProcess1; // 0x5b8(0x08)
	struct USmoothSync* SmoothSync; // 0x5c0(0x08)
	struct USpringArmComponent* SpringArm; // 0x5c8(0x08)
	struct USceneComponent* KnifeLocation; // 0x5d0(0x08)
	struct UFMODAudioComponent* HitAudi; // 0x5d8(0x08)
	struct USceneComponent* FPMeshPlace; // 0x5e0(0x08)
	struct USkeletalMeshComponent* FPPSM; // 0x5e8(0x08)
	struct USoundKiller_C* SoundKiller; // 0x5f0(0x08)
	struct USphereComponent* Sphere; // 0x5f8(0x08)
	struct UFMODAudioComponent* FMODAudio1; // 0x600(0x08)
	struct UCameraComponent* FollowCamera; // 0x608(0x08)
	struct UATPCCameraComponent* ATPCCamera; // 0x610(0x08)
	struct UFMODAudioComponent* FmodAudio; // 0x618(0x08)
	struct UFootprintComponent_C* FootprintComponent1; // 0x620(0x08)
	struct UChargeSpell_C* ChargeSpell; // 0x628(0x08)
	struct UScreamSpell_C* ScreamSpell; // 0x630(0x08)
	struct UWallhackSpell_C* WallhackSpell; // 0x638(0x08)
	struct UCapsuleComponent* ContactCapsule; // 0x640(0x08)
	struct USpotLightComponent* SpotLight; // 0x648(0x08)
	struct UCapsuleComponent* Capsule; // 0x650(0x08)
	struct USceneComponent* GrabLocation; // 0x658(0x08)
	struct UPhysicsHandleComponent* PhysicsHandle; // 0x660(0x08)
	float Timeline_5_Alpha_7015A4DA41ED7E73DA445D8FB29046BE; // 0x668(0x04)
	enum class ETimelineDirection Timeline_5__Direction_7015A4DA41ED7E73DA445D8FB29046BE; // 0x66c(0x01)
	char pad_66D[0x3]; // 0x66d(0x03)
	struct UTimelineComponent* Timeline_6; // 0x670(0x08)
	float AfterStunColor_f_A70514EE49D40D103AD3BF8B9384BA66; // 0x678(0x04)
	enum class ETimelineDirection AfterStunColor__Direction_A70514EE49D40D103AD3BF8B9384BA66; // 0x67c(0x01)
	char pad_67D[0x3]; // 0x67d(0x03)
	struct UTimelineComponent* AfterStunColor; // 0x680(0x08)
	float ScaleSizer_fX_77CCFD67432753C30A0F0B9123C98C2A; // 0x688(0x04)
	float ScaleSizer_fZ_77CCFD67432753C30A0F0B9123C98C2A; // 0x68c(0x04)
	enum class ETimelineDirection ScaleSizer__Direction_77CCFD67432753C30A0F0B9123C98C2A; // 0x690(0x01)
	char pad_691[0x7]; // 0x691(0x07)
	struct UTimelineComponent* ScaleSizer; // 0x698(0x08)
	float Timeline_4_Alpha_FFBAA07C4FFE0AC4EFCCB2808F29A056; // 0x6a0(0x04)
	enum class ETimelineDirection Timeline_4__Direction_FFBAA07C4FFE0AC4EFCCB2808F29A056; // 0x6a4(0x01)
	char pad_6A5[0x3]; // 0x6a5(0x03)
	struct UTimelineComponent* Timeline_5; // 0x6a8(0x08)
	float Timeline_3_Alpha_CCB2811B4D6B40280DAFDA9812E93AA9; // 0x6b0(0x04)
	enum class ETimelineDirection Timeline_3__Direction_CCB2811B4D6B40280DAFDA9812E93AA9; // 0x6b4(0x01)
	char pad_6B5[0x3]; // 0x6b5(0x03)
	struct UTimelineComponent* Timeline_4; // 0x6b8(0x08)
	float Timeline_2_Alpha_6A7565474A6C83519B89AABBB688C874; // 0x6c0(0x04)
	enum class ETimelineDirection Timeline_2__Direction_6A7565474A6C83519B89AABBB688C874; // 0x6c4(0x01)
	char pad_6C5[0x3]; // 0x6c5(0x03)
	struct UTimelineComponent* Timeline_3; // 0x6c8(0x08)
	float Timeline_1_Param_D056C010468E2F57128C429FAA65DEE4; // 0x6d0(0x04)
	enum class ETimelineDirection Timeline_1__Direction_D056C010468E2F57128C429FAA65DEE4; // 0x6d4(0x01)
	char pad_6D5[0x3]; // 0x6d5(0x03)
	struct UTimelineComponent* Timeline_2; // 0x6d8(0x08)
	float StopSoundChaseTimeline_Alpha_06FAF5A548A0915B6864099F049D7C6A; // 0x6e0(0x04)
	enum class ETimelineDirection StopSoundChaseTimeline__Direction_06FAF5A548A0915B6864099F049D7C6A; // 0x6e4(0x01)
	char pad_6E5[0x3]; // 0x6e5(0x03)
	struct UTimelineComponent* StopSoundChaseTimeline; // 0x6e8(0x08)
	float SoundTimeline_Alpha_1F3BABE64CBB7521448AC3810D011723; // 0x6f0(0x04)
	enum class ETimelineDirection SoundTimeline__Direction_1F3BABE64CBB7521448AC3810D011723; // 0x6f4(0x01)
	char pad_6F5[0x3]; // 0x6f5(0x03)
	struct UTimelineComponent* SoundTimeline; // 0x6f8(0x08)
	float DecreasorSpeed_AlphaTime_7C7B01AF4FA603E5695B4EBEC9B01716; // 0x700(0x04)
	enum class ETimelineDirection DecreasorSpeed__Direction_7C7B01AF4FA603E5695B4EBEC9B01716; // 0x704(0x01)
	char pad_705[0x3]; // 0x705(0x03)
	struct UTimelineComponent* DecreasorSpeed; // 0x708(0x08)
	float IncreasorSpeed_AlphaTime_73C5FA014C02BF17B95C0094FD9E37EA; // 0x710(0x04)
	enum class ETimelineDirection IncreasorSpeed__Direction_73C5FA014C02BF17B95C0094FD9E37EA; // 0x714(0x01)
	char pad_715[0x3]; // 0x715(0x03)
	struct UTimelineComponent* IncreasorSpeed; // 0x718(0x08)
	float Timeline_0_lerp_258C0C6E4CF25F31EF1A08BE14D3F049; // 0x720(0x04)
	enum class ETimelineDirection Timeline_0__Direction_258C0C6E4CF25F31EF1A08BE14D3F049; // 0x724(0x01)
	char pad_725[0x3]; // 0x725(0x03)
	struct UTimelineComponent* Timeline_1; // 0x728(0x08)
	float BaseTurnRate; // 0x730(0x04)
	float BaseLookUpRate; // 0x734(0x04)
	bool Stunned?; // 0x738(0x01)
	char pad_739[0x3]; // 0x739(0x03)
	float WalkSpeed; // 0x73c(0x04)
	bool Atack?; // 0x740(0x01)
	bool Contact; // 0x741(0x01)
	char pad_742[0x6]; // 0x742(0x06)
	struct FString NewVar_1; // 0x748(0x10)
	struct FVector V3Forward; // 0x758(0x0c)
	bool mouseClick?; // 0x764(0x01)
	char pad_765[0x3]; // 0x765(0x03)
	float mouseClickTime; // 0x768(0x04)
	float ReduceMaxWalkSpeedTime; // 0x76c(0x04)
	bool SuperSmash; // 0x770(0x01)
	bool AbilityWallhackCd; // 0x771(0x01)
	bool IsHolded; // 0x772(0x01)
	char pad_773[0x5]; // 0x773(0x05)
	struct AActor* GrabbedChar; // 0x778(0x08)
	struct ASurvivorMasterBP_C* HittedSurv; // 0x780(0x08)
	struct TArray<struct AHypnoChairBP_C*> HypnoChairsArrayRef; // 0x788(0x10)
	bool ChairOverlap?; // 0x798(0x01)
	char pad_799[0x7]; // 0x799(0x07)
	struct AHypnoChairBP_C* OverlappedChair; // 0x7a0(0x08)
	struct TArray<struct ASurvivorMasterBP_C*> SurvArrayRef; // 0x7a8(0x10)
	struct TArray<struct ASurvivorMasterBP_C*> SurvInRadiusArrayRef; // 0x7b8(0x10)
	bool ToShakeSurv; // 0x7c8(0x01)
	char pad_7C9[0x7]; // 0x7c9(0x07)
	struct UCoolDownWBP_C* CDWBPRed; // 0x7d0(0x08)
	bool AbilityScreamCd; // 0x7d8(0x01)
	char pad_7D9[0x7]; // 0x7d9(0x07)
	struct UCoolDownWBP_C* WidgetCDRef; // 0x7e0(0x08)
	struct FName abilit1; // 0x7e8(0x08)
	struct FName abilit2; // 0x7f0(0x08)
	struct FVector EndLineTraceV3; // 0x7f8(0x0c)
	struct FName abiliti3; // 0x804(0x08)
	bool SuperSmashCD; // 0x80c(0x01)
	char pad_80D[0x3]; // 0x80d(0x03)
	struct UFlashWidget_C* FlashEffectWidget; // 0x810(0x08)
	float DeltaSeconds; // 0x818(0x04)
	char pad_81C[0x4]; // 0x81c(0x04)
	struct ABulletBP_C* BulletRef; // 0x820(0x08)
	bool BulletCD?; // 0x828(0x01)
	char pad_829[0x7]; // 0x829(0x07)
	struct UAmmoKillerWBP_C* AmmoWBPRef; // 0x830(0x08)
	struct UAudioComponent* SpyEyeSound; // 0x838(0x08)
	float MaxSpeed; // 0x840(0x04)
	float CurrentSpeed; // 0x844(0x04)
	bool IncreaseWalk?; // 0x848(0x01)
	bool IsOwner?; // 0x849(0x01)
	enum class EFootprintStyle CurrentFootwear; // 0x84a(0x01)
	char pad_84B[0x1]; // 0x84b(0x01)
	float MinSpeed; // 0x84c(0x04)
	bool DecreaseWalk?; // 0x850(0x01)
	bool OnSpyEye; // 0x851(0x01)
	char pad_852[0x6]; // 0x852(0x06)
	struct UInteractableButtonsWidget_C* InteractButtonWBP; // 0x858(0x08)
	struct FText toChairText; // 0x860(0x18)
	struct FText pickupSurvText; // 0x878(0x18)
	struct FText dropSurvText; // 0x890(0x18)
	struct UAudioComponent* ExplosionSound; // 0x8a8(0x08)
	struct UProgressBarWBP_C* ProgressBarWBP; // 0x8b0(0x08)
	struct TArray<struct AActor*> ActorsToIgnore; // 0x8b8(0x10)
	float MaxSpeedDefault; // 0x8c8(0x04)
	float MinSpeedDefault; // 0x8cc(0x04)
	struct FFMODEventInstance LevelAmbient; // 0x8d0(0x08)
	float MeleeAttackRadius; // 0x8d8(0x04)
	float Sensivity; // 0x8dc(0x04)
	bool AttackBoolAnim; // 0x8e0(0x01)
	char pad_8E1[0x7]; // 0x8e1(0x07)
	struct AHypnoChairBP_C* ChairSaved; // 0x8e8(0x08)
	struct AHypnoChairBP_C* NewVar_2; // 0x8f0(0x08)
	bool AttackAllow; // 0x8f8(0x01)
	char pad_8F9[0x7]; // 0x8f9(0x07)
	struct FFMODEventInstance Laugh; // 0x900(0x08)
	struct UFMODAudioComponent* LaughComp; // 0x908(0x08)
	float XLocationFPPMESH; // 0x910(0x04)
	int32_t Score; // 0x914(0x04)
	bool JumpEnd; // 0x918(0x01)
	char pad_919[0x7]; // 0x919(0x07)
	struct UCrossHairWBP_C* CrossHair; // 0x920(0x08)
	bool FIRE; // 0x928(0x01)
	bool Plant; // 0x929(0x01)
	bool Flashed; // 0x92a(0x01)
	char pad_92B[0x5]; // 0x92b(0x05)
	struct ASurvivorMasterBP_C* SurvCrawl; // 0x930(0x08)
	struct UFMODAudioComponent* spyEyeSpotter; // 0x938(0x08)
	float VerticalValue; // 0x940(0x04)
	float HorizontalValue; // 0x944(0x04)
	float IncreaseSpeedMultiplyTime; // 0x948(0x04)
	float DecreaseSpeedMultiplyTime; // 0x94c(0x04)
	int32_t KillerType; // 0x950(0x04)
	bool HardHit?; // 0x954(0x01)
	bool LockMouseInput; // 0x955(0x01)
	char pad_956[0x2]; // 0x956(0x02)
	struct AHUD_PropHunt_C* HudKiller; // 0x958(0x08)
	bool AstralIn?; // 0x960(0x01)
	bool KnifeInHand; // 0x961(0x01)
	char pad_962[0x2]; // 0x962(0x02)
	float InertiaSpeed; // 0x964(0x04)
	float InertiaSoef; // 0x968(0x04)
	char pad_96C[0x4]; // 0x96c(0x04)
	struct ASurvivorMasterBP_C* NewVar_3; // 0x970(0x08)
	float ZinterpCoef; // 0x978(0x04)
	bool AfterJump; // 0x97c(0x01)
	bool SimpleDrop; // 0x97d(0x01)
	bool ChairDrop; // 0x97e(0x01)
	bool Catch; // 0x97f(0x01)
	bool Runaway; // 0x980(0x01)
	char pad_981[0x3]; // 0x981(0x03)
	float YawMod; // 0x984(0x04)
	bool ToChairMove; // 0x988(0x01)
	char pad_989[0x3]; // 0x989(0x03)
	struct FRotator HeadRotator; // 0x98c(0x0c)
	float NewVar_4; // 0x998(0x04)
	bool SpawnKnife; // 0x99c(0x01)
	bool AllowVoice; // 0x99d(0x01)
	bool VoiceActive?; // 0x99e(0x01)
	char pad_99F[0x1]; // 0x99f(0x01)
	struct FString ScoreText; // 0x9a0(0x10)
	float DamageMultiply; // 0x9b0(0x04)
	bool StartTrackSurv; // 0x9b4(0x01)
	char pad_9B5[0x3]; // 0x9b5(0x03)
	struct TArray<struct ASurvivorMasterBP_C*> SurfsOnEye; // 0x9b8(0x10)
	struct TArray<float> TimeDelay; // 0x9c8(0x10)
	struct TArray<bool> SeeSurvArray; // 0x9d8(0x10)
	struct AActor* ActorToMove; // 0x9e8(0x08)
	struct UFMODAudioComponent* LaughKiller; // 0x9f0(0x08)
	bool OnKiller?; // 0x9f8(0x01)
	bool CDWidget; // 0x9f9(0x01)
	char pad_9FA[0x6]; // 0x9fa(0x06)
	struct TArray<float> StayDelay; // 0xa00(0x10)
	float XAxis; // 0xa10(0x04)
	float YAxis; // 0xa14(0x04)
	bool SurvCanGetDMG; // 0xa18(0x01)
	char pad_A19[0x3]; // 0xa19(0x03)
	struct FName SurvAttachBoneName; // 0xa1c(0x08)
	char pad_A24[0x4]; // 0xa24(0x04)
	struct USkillPoints_C* SkillPoints; // 0xa28(0x08)
	struct ULevelSystem_C* LevelSystemRef; // 0xa30(0x08)
	int32_t HandAttack; // 0xa38(0x04)
	char pad_A3C[0x4]; // 0xa3c(0x04)
	struct TArray<struct FVector> CoinImpulse; // 0xa40(0x10)
	bool MarioStun; // 0xa50(0x01)
	bool SurvExitCollision; // 0xa51(0x01)
	bool StopKillerMusic?; // 0xa52(0x01)
	bool ImKiller?; // 0xa53(0x01)
	bool PropSound?; // 0xa54(0x01)
	bool AttackBlocked?; // 0xa55(0x01)
	bool HiddenAttack?; // 0xa56(0x01)
	char pad_A57[0x1]; // 0xa57(0x01)
	struct TArray<struct AActor*> AudioIgnore; // 0xa58(0x10)
	bool chase; // 0xa68(0x01)
	char pad_A69[0x7]; // 0xa69(0x07)
	struct TArray<bool> ChaseArray; // 0xa70(0x10)
	struct FFMODEventInstance ChaseSound2D; // 0xa80(0x08)
	float JumpTime; // 0xa88(0x04)
	bool chaseb; // 0xa8c(0x01)
	char pad_A8D[0x3]; // 0xa8d(0x03)
	float SurvEscapeAnimationLenght; // 0xa90(0x04)
	char pad_A94[0xc]; // 0xa94(0x0c)
	struct FTransform SurvMeshLastPosition; // 0xaa0(0x30)
	struct TArray<struct UMaterialInstanceDynamic*> arrayDynMatInst; // 0xad0(0x10)
	bool UnStunned; // 0xae0(0x01)
	bool DoOnceChase; // 0xae1(0x01)
	bool DetectDelay; // 0xae2(0x01)
	char pad_AE3[0x5]; // 0xae3(0x05)
	struct APostProcessVolume* PostProcessVolumeVar; // 0xae8(0x08)
	struct FPostProcessSettings DefaultPostProcessSettings; // 0xaf0(0x550)
	struct UMaterialInstanceDynamic* MaterialOutline; // 0x1040(0x08)
	struct UMaterialInstanceDynamic* MaterialLens; // 0x1048(0x08)
	bool gameStarted; // 0x1050(0x01)
	char pad_1051[0x3]; // 0x1051(0x03)
	float IdleTime; // 0x1054(0x04)
	bool IdleBool; // 0x1058(0x01)
	char pad_1059[0x3]; // 0x1059(0x03)
	float IdleTimeReady; // 0x105c(0x04)
	struct FVector ToChairLoc; // 0x1060(0x0c)
	char pad_106C[0x4]; // 0x106c(0x04)
	struct TArray<float> SurvChaseDelay; // 0x1070(0x10)
	float DeltaSec; // 0x1080(0x04)
	bool IdleBlock; // 0x1084(0x01)
	char pad_1085[0x3]; // 0x1085(0x03)
	struct UMaterialInstanceDynamic* MaterialVignette; // 0x1088(0x08)
	struct UMaterialInstanceDynamic* MaterialBlur; // 0x1090(0x08)
	bool StopMove?; // 0x1098(0x01)
	char pad_1099[0x3]; // 0x1099(0x03)
	float StunTimeBySurv; // 0x109c(0x04)
	float LastAirTime; // 0x10a0(0x04)
	bool Tutorial?; // 0x10a4(0x01)
	bool BlockSurvTrack?; // 0x10a5(0x01)
	char pad_10A6[0x2]; // 0x10a6(0x02)
	float CDAttackDuration; // 0x10a8(0x04)
	float AttackAnimDuration; // 0x10ac(0x04)
	float CDAttackDurationBig; // 0x10b0(0x04)
	float AttackAnimDurationBig; // 0x10b4(0x04)
	bool chaseDelayer; // 0x10b8(0x01)
	bool UberRotate; // 0x10b9(0x01)
	char pad_10BA[0x2]; // 0x10ba(0x02)
	float DeltaSecSpeed; // 0x10bc(0x04)
	bool SeekBool; // 0x10c0(0x01)
	bool GetReady; // 0x10c1(0x01)
	bool SeekDetectCheck; // 0x10c2(0x01)
	bool OnlyTPP?; // 0x10c3(0x01)
	bool DoOnceTrack; // 0x10c4(0x01)
	char pad_10C5[0x3]; // 0x10c5(0x03)
	struct TArray<struct ASurvivorMasterBP_C*> SurfsOnEye2; // 0x10c8(0x10)
	float ImpulseStunMultiply; // 0x10d8(0x04)
	char pad_10DC[0x4]; // 0x10dc(0x04)
	struct ASurvivorMasterBP_C* SurvivorStunRef; // 0x10e0(0x08)
	bool NewVar_5; // 0x10e8(0x01)
	char pad_10E9[0x7]; // 0x10e9(0x07)
	struct UPhysicalMaterial* Phys Mat; // 0x10f0(0x08)
	bool Freeze; // 0x10f8(0x01)
	char pad_10F9[0x7]; // 0x10f9(0x07)
	struct AActor* Stun Actor; // 0x1100(0x08)
	float BloodLustLvl; // 0x1108(0x04)
	float BloodLustSpeedAdd; // 0x110c(0x04)
	float BloodLustTimeActual; // 0x1110(0x04)
	float BloodLustSpeedSubtraction; // 0x1114(0x04)
	bool BloodLustOffB; // 0x1118(0x01)
	char pad_1119[0x3]; // 0x1119(0x03)
	float BloodLustTimeOff; // 0x111c(0x04)
	bool BloodLustHitted; // 0x1120(0x01)
	char pad_1121[0x3]; // 0x1121(0x03)
	float NewVar_6; // 0x1124(0x04)
	float BloodLustTimeLvl; // 0x1128(0x04)
	int32_t BloodLustLvlInt; // 0x112c(0x04)
	float BloodLustTimeDiv; // 0x1130(0x04)
	bool Range?; // 0x1134(0x01)
	char pad_1135[0x3]; // 0x1135(0x03)
	struct TArray<float> SurvsSeeTimer; // 0x1138(0x10)
	bool BInFocus; // 0x1148(0x01)
	char pad_1149[0x3]; // 0x1149(0x03)
	float InFocusTime; // 0x114c(0x04)
	bool BQuietHour; // 0x1150(0x01)
	bool BTimeIsTicking; // 0x1151(0x01)
	bool BNightmare; // 0x1152(0x01)
	bool BObservation; // 0x1153(0x01)
	bool BPunishment; // 0x1154(0x01)
	bool BDeadMansChest; // 0x1155(0x01)
	bool BImprisonment; // 0x1156(0x01)
	bool BBrokenTime; // 0x1157(0x01)
	bool BBait; // 0x1158(0x01)
	char pad_1159[0x7]; // 0x1159(0x07)
	struct FFMODEventInstance BloodLustFMOD; // 0x1160(0x08)
	float UntouchMaxSpeedDefault; // 0x1168(0x04)
	struct FVector Scale; // 0x116c(0x0c)
	float StunTimeBeforeAnim; // 0x1178(0x04)
	float StunTimeAfterAnim; // 0x117c(0x04)
	bool ChairDropChecker; // 0x1180(0x01)
	char pad_1181[0x3]; // 0x1181(0x03)
	struct FName Socket Name; // 0x1184(0x08)
	int32_t CoinsCount; // 0x118c(0x04)
	struct ANewAlarmBP_C* As New Alarm BP; // 0x1190(0x08)
	bool BrokeAlarm; // 0x1198(0x01)
	char pad_1199[0x3]; // 0x1199(0x03)
	float BrokeTime; // 0x119c(0x04)
	struct FVector NewVar_7; // 0x11a0(0x0c)
	char pad_11AC[0x4]; // 0x11ac(0x04)
	struct AActor* TempCalculateRay; // 0x11b0(0x08)
	float DistanceSurvPropSee; // 0x11b8(0x04)
	char pad_11BC[0x4]; // 0x11bc(0x04)
	struct ASurvivorMasterBP_C* SurvPropSeeRef; // 0x11c0(0x08)
	struct ASurvivorMasterBP_C* tempPropSeeSurv; // 0x11c8(0x08)
	float PropSeeTime; // 0x11d0(0x04)
	char pad_11D4[0x4]; // 0x11d4(0x04)
	struct FFMODEventInstance KillerSpottedFmod; // 0x11d8(0x08)
	struct FFMODEventInstance KillerSpotted2; // 0x11e0(0x08)
	struct UMaterialInstanceDynamic* SoftOutline; // 0x11e8(0x08)
	struct UFMODAudioComponent* MoveAmbAudio; // 0x11f0(0x08)
	bool TestViewB; // 0x11f8(0x01)
	bool TPPCamEvent; // 0x11f9(0x01)
	char pad_11FA[0x6]; // 0x11fa(0x06)
	struct AKIllerCoin_C* NewVar_8; // 0x1200(0x08)
	bool CheatEnabled; // 0x1208(0x01)
	char pad_1209[0x7]; // 0x1209(0x07)
	struct UStaticMeshComponent* RangeMeshHit; // 0x1210(0x08)
	struct FVector RangeLocHit; // 0x1218(0x0c)
	bool TutorialBlock?; // 0x1224(0x01)
	bool PickupSurv; // 0x1225(0x01)

	void HeadRotationFunc(struct FRotator Rotation); // Function KillerMasterBP.KillerMasterBP_C.HeadRotationFunc // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void get level name(bool B, struct FString Name); // Function KillerMasterBP.KillerMasterBP_C.get level name // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void SurfaceSoundPlayer(struct UFMODEvent* Event); // Function KillerMasterBP.KillerMasterBP_C.SurfaceSoundPlayer // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void ChairCheckFunc(bool NewParam); // Function KillerMasterBP.KillerMasterBP_C.ChairCheckFunc // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void ScreenshotFunc(); // Function KillerMasterBP.KillerMasterBP_C.ScreenshotFunc // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
