// AnimBlueprintGeneratedClass Mainchar1_AnimBP.Mainchar1_AnimBP_C
// Size: 0x95e7 (Inherited: 0x2c0)
struct UMainchar1_AnimBP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x2c8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x2f0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x448(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x470(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x4b8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x4e0(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x638(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x6d8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x700(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10; // 0x728(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x7d8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x800(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x958(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0xab0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0xad8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0xb00(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0xb28(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0xb70(0x158)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0xcc8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0xd68(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0xd90(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0xdb8(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0xf10(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0xf38(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x1090(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_110; // 0x10b8(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x1138(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x11d8(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x1298(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_109; // 0x1358(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x13d8(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x1478(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x15d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x15f8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x1620(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_108; // 0x1648(0x80)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x16c8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x16f0(0x158)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9; // 0x1848(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x18f8(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x1940(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x19e0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_107; // 0x1aa0(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0x1b20(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x1bd0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x1d28(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x1d50(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1d78(0x158)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x1ed0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1f90(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_106; // 0x1fb8(0x80)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2038(0x20)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89; // 0x2058(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88; // 0x2080(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87; // 0x20a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86; // 0x20d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85; // 0x20f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84; // 0x2120(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83; // 0x2148(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82; // 0x2170(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81; // 0x2198(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80; // 0x21c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79; // 0x21e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78; // 0x2210(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0x2238(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0x2260(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0x2288(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0x22b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0x22d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0x2300(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0x2328(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0x2350(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0x2378(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0x23a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x23c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x23f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x2418(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x2440(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x2468(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x2490(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x24b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x24e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x2508(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x2530(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x2558(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x2580(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x25a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x25d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x25f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x2620(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0x2648(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0x2670(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x2698(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x26c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x26e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x2710(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x2738(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x2760(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x2788(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x27b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x27d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x2800(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x2828(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x2850(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x2878(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x28a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x28c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x28f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x2918(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x2940(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x2968(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x2990(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x29b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x29e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x2a08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x2a30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x2a58(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x2a80(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x2aa8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x2ad0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x2af8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x2b20(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x2b48(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x2b70(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x2b98(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x2bc0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x2be8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x2c10(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x2c38(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x2c60(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x2c88(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x2cb0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x2cd8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x2d00(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x2d28(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x2d50(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2d78(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2da0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x2dc8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x2df0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2e18(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_105; // 0x2e40(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_47; // 0x2ec0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_104; // 0x2ef0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_103; // 0x2f70(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_102; // 0x2ff0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_101; // 0x3070(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x30f0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_100; // 0x31a0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_46; // 0x3220(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_99; // 0x3250(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_98; // 0x32d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_97; // 0x3350(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_8; // 0x33d0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_96; // 0x3470(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_45; // 0x34f0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_95; // 0x3520(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_94; // 0x35a0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_93; // 0x3620(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_7; // 0x36a0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_92; // 0x3740(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_44; // 0x37c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_91; // 0x37f0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_90; // 0x3870(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_89; // 0x38f0(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_6; // 0x3970(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_88; // 0x3a10(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_43; // 0x3a90(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_87; // 0x3ac0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_42; // 0x3b40(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_86; // 0x3b70(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_41; // 0x3bf0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_85; // 0x3c20(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_40; // 0x3ca0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84; // 0x3cd0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x3d50(0xa0)
	struct FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel_2; // 0x3df0(0x68)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0x3e58(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17; // 0x3f08(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16; // 0x3ff0(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x40d8(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x4178(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83; // 0x4260(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_39; // 0x42e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82; // 0x4310(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_38; // 0x4390(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81; // 0x43c0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_37; // 0x4440(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80; // 0x4470(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_36; // 0x44f0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79; // 0x4520(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x45a0(0xa0)
	struct FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel; // 0x4640(0x68)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x46a8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x4790(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x4878(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x4918(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x49c8(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78; // 0x4ab0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_35; // 0x4b30(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77; // 0x4b60(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_34; // 0x4be0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76; // 0x4c10(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_33; // 0x4c90(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75; // 0x4cc0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_32; // 0x4d40(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74; // 0x4d70(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_31; // 0x4df0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73; // 0x4e20(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_30; // 0x4ea0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72; // 0x4ed0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_29; // 0x4f50(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71; // 0x4f80(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_28; // 0x5000(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70; // 0x5030(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_27; // 0x50b0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69; // 0x50e0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68; // 0x5160(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67; // 0x51e0(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_5; // 0x5260(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0x5300(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x5380(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0x53b0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0x5430(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0x54b0(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_4; // 0x5530(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0x55d0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x5650(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0x5680(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0x5700(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_3; // 0x5780(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59; // 0x5820(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58; // 0x58a0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x5920(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57; // 0x5950(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x59d0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56; // 0x5a00(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x5a80(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x5ab0(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55; // 0x5b98(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x5c18(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x5cb8(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54; // 0x5da0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x5e20(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x5ec0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x5fa8(0xe8)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x6090(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x6130(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53; // 0x6160(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x61e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52; // 0x6210(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x6290(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51; // 0x62c0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x6340(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50; // 0x6370(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x63f0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0x6420(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x64a0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0x64d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0x6550(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0x65d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0x6650(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0x66d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0x6750(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0x67d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x6850(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x68d0(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x6950(0xb0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x6a00(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x6ac0(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x6b40(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x6c28(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x6ca8(0xc0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x6d68(0x30)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x6d98(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x6e58(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x6f18(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x6f98(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x7018(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x7098(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x7118(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x7198(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x7218(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x7298(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x7318(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x73c8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x7448(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x74c8(0x80)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x7548(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x7630(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x7660(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x76e0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x7710(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x7790(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x77c0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x7840(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x7870(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x78f0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x7920(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x79a0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x79d0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x7a50(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x7a80(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x7b20(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x7ba0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x7c20(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x7c50(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x7cd0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x7d50(0x80)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x7dd0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x7e70(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x7ef0(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x7f20(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x8008(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x8038(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x80b8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x80e8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x8168(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x8198(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x8218(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x8248(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x8330(0xe8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x8418(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x84b8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x8538(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x85b8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x8638(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x86b8(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x8738(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x87e8(0xe8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x88d0(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x8950(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x89d0(0x80)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x8a50(0xc0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x8b10(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x8bc0(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8ca8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x8cd8(0xb0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x8d88(0x20)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x8da8(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x8dd8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x8ee0(0x108)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x8fe8(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x90a8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x90d0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x9150(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x91f0(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x92b0(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x9408(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9430(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x9458(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x94d8(0x80)
	bool IsOwner?; // 0x9558(0x01)
	bool IsInAir?; // 0x9559(0x01)
	char pad_955A[0x2]; // 0x955a(0x02)
	float Speed; // 0x955c(0x04)
	float Direction; // 0x9560(0x04)
	bool Crawl?; // 0x9564(0x01)
	bool FPP?; // 0x9565(0x01)
	bool Grapple?; // 0x9566(0x01)
	bool OnChair?; // 0x9567(0x01)
	bool AlarmReloading?; // 0x9568(0x01)
	bool EndJump?; // 0x9569(0x01)
	bool OpenDoor?; // 0x956a(0x01)
	enum class ItemType ItemType; // 0x956b(0x01)
	bool ImHealing?; // 0x956c(0x01)
	bool UseFlashlight?; // 0x956d(0x01)
	char pad_956E[0x2]; // 0x956e(0x02)
	float HasItem; // 0x9570(0x04)
	struct FRotator HeadRotation; // 0x9574(0x0c)
	bool TurnLeft?; // 0x9580(0x01)
	bool TurnRight?; // 0x9581(0x01)
	char pad_9582[0x2]; // 0x9582(0x02)
	float HorizontalCameraAxis; // 0x9584(0x04)
	float VerticalCameraAxis; // 0x9588(0x04)
	bool ImHealingAlly?; // 0x958c(0x01)
	bool HealingMe?; // 0x958d(0x01)
	enum class SurvStateEnum SurvStateEnum; // 0x958e(0x01)
	enum class MovementTypeEnum MovementType; // 0x958f(0x01)
	bool Idle2?; // 0x9590(0x01)
	char pad_9591[0x7]; // 0x9591(0x07)
	struct ASurvivorMasterBP_C* Surv; // 0x9598(0x08)
	bool Hitted?; // 0x95a0(0x01)
	bool ItemTake?; // 0x95a1(0x01)
	char pad_95A2[0x2]; // 0x95a2(0x02)
	int32_t KillerType; // 0x95a4(0x04)
	int32_t Health; // 0x95a8(0x04)
	bool RandomSelfGetOut?; // 0x95ac(0x01)
	bool Failed?; // 0x95ad(0x01)
	bool Attack?; // 0x95ae(0x01)
	bool GetReady?; // 0x95af(0x01)
	bool CrouchAnimStart?; // 0x95b0(0x01)
	bool UnCrouch?; // 0x95b1(0x01)
	bool Capture Mode?; // 0x95b2(0x01)
	char pad_95B3[0x1]; // 0x95b3(0x01)
	float Delta Time X; // 0x95b4(0x04)
	float Blend Weights 0; // 0x95b8(0x04)
	char pad_95BC[0x4]; // 0x95bc(0x04)
	struct UAnimMontage* HelpGetOutMontage; // 0x95c0(0x08)
	struct UAnimMontage* SelfGetOutMontage; // 0x95c8(0x08)
	struct UAnimMontage* DropChairMontage; // 0x95d0(0x08)
	struct UAnimMontage* IdleToIdleCrawl; // 0x95d8(0x08)
	enum class SurvChars Surv Char; // 0x95e0(0x01)
	bool StartCrawl?; // 0x95e1(0x01)
	bool Custom Play Anim Walk?; // 0x95e2(0x01)
	bool TaigaBonesTransform?; // 0x95e3(0x01)
	bool Stop Move?; // 0x95e4(0x01)
	bool Close Door; // 0x95e5(0x01)
	bool NotTestMode?; // 0x95e6(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function Mainchar1_AnimBP.Mainchar1_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_AnimGraphNode_TransitionResult_C066CB1240D0B3FD79D9CAA08618671C(); // Function Mainchar1_AnimBP.Mainchar1_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_AnimGraphNode_TransitionResult_C066CB1240D0B3FD79D9CAA08618671C // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_AnimGraphNode_TransitionResult_493C3CFF487E9D70A51530B135E58632(); // Function Mainchar1_AnimBP.Mainchar1_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_AnimGraphNode_TransitionResult_493C3CFF487E9D70A51530B135E58632 // (BlueprintEvent) // @ game+0x132e1a0
