// AnimBlueprintGeneratedClass Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C
// Size: 0x2ee3 (Inherited: 0x2c0)
struct UMainchar1_AnimBP_FPP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2c0(0x08)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x2c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x2f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x318(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x340(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x368(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x390(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x3b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x3e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x408(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x430(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x458(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x480(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x4a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x4d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x4f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x520(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x548(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x5c8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x648(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x6c8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x748(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x7c8(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x848(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x8c8(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x948(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x9f8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0xa28(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xaa8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0xad8(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0xb58(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0xb88(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0xc08(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0xc38(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0xd20(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0xe08(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0xef0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0xfd8(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x10c0(0xe8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x11a8(0xe8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x1290(0xb0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x1340(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1428(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1458(0xe8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1540(0x30)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_3; // 0x1570(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x1610(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x1690(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x1710(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x1790(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x1810(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x1890(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x1910(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x1990(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x1a10(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x1ac0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1b40(0x30)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x1b70(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x1c10(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x1c90(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x1d10(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x1d90(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x1e10(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x1e90(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x1f10(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x1f90(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x2010(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x20c0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2140(0x30)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x2170(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x2210(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x2290(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x2310(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x2390(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x2410(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x2490(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x2510(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x2590(0x80)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2610(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x26c0(0x80)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2740(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2770(0xb0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2820(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x2850(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x28f0(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2970(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x2a10(0x158)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2b68(0x158)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x2cc0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2ce8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x2d10(0x80)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2d90(0x80)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2e10(0xa0)
	bool IsOwner?; // 0x2eb0(0x01)
	bool IsInAir?; // 0x2eb1(0x01)
	char pad_2EB2[0x2]; // 0x2eb2(0x02)
	float Speed; // 0x2eb4(0x04)
	float Direction; // 0x2eb8(0x04)
	bool Crawl?; // 0x2ebc(0x01)
	bool FPP?; // 0x2ebd(0x01)
	bool OnChair?; // 0x2ebe(0x01)
	bool Grapple?; // 0x2ebf(0x01)
	bool EndJump?; // 0x2ec0(0x01)
	char pad_2EC1[0x3]; // 0x2ec1(0x03)
	float HasItem; // 0x2ec4(0x04)
	enum class ItemType ItemType; // 0x2ec8(0x01)
	bool UseFlashlight?; // 0x2ec9(0x01)
	enum class SurvStateEnum SurvStateEnum; // 0x2eca(0x01)
	enum class MovementTypeEnum MovementType; // 0x2ecb(0x01)
	bool ItemTake?; // 0x2ecc(0x01)
	bool ItemSwap?; // 0x2ecd(0x01)
	char pad_2ECE[0x2]; // 0x2ece(0x02)
	struct FVector NewVar_1; // 0x2ed0(0x0c)
	float XYSpeed; // 0x2edc(0x04)
	enum class SurvChars Surv Char; // 0x2ee0(0x01)
	bool Energy Drnk Anim B; // 0x2ee1(0x01)
	bool KBook Anim B; // 0x2ee2(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_C77FC88B44B6DD122AD850872D4B54B5(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_C77FC88B44B6DD122AD850872D4B54B5 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_55FBB1ED45B02668EB5D5DB9BE61A5C8(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_55FBB1ED45B02668EB5D5DB9BE61A5C8 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_BlendListByInt_39A4AC9743382A30848694BCA1D96857(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_BlendListByInt_39A4AC9743382A30848694BCA1D96857 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_BlendListByInt_A5A4770F48D2FEFF31400B949B889F37(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_BlendListByInt_A5A4770F48D2FEFF31400B949B889F37 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_BlendListByInt_23B75C524450D0FDD4D8E98A08DF68AA(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_BlendListByInt_23B75C524450D0FDD4D8E98A08DF68AA // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_BlendSpacePlayer_162DEEE04C9561A167642FBBB47B2B38(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_BlendSpacePlayer_162DEEE04C9561A167642FBBB47B2B38 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_0CCACD864C81FAC79D919B81336CD1F2(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_0CCACD864C81FAC79D919B81336CD1F2 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_CB529EE44EECBAF57C5696A1C2616DFF(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_CB529EE44EECBAF57C5696A1C2616DFF // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_BBCF7EB7476B82C0A263CEB58767E1A9(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_BBCF7EB7476B82C0A263CEB58767E1A9 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_F5ECCD214B7B4BD6E6B77284AD666A48(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_F5ECCD214B7B4BD6E6B77284AD666A48 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_F102EF4848D2CD5AE0A87B8427F5CC4C(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_F102EF4848D2CD5AE0A87B8427F5CC4C // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_14B563194CD9C43BDF13449F03A7828D(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_14B563194CD9C43BDF13449F03A7828D // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_F6FBF8E04F1D571717C2DD9F60AE9F4E(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_F6FBF8E04F1D571717C2DD9F60AE9F4E // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_5E1A8CEF48353FE0749D60AE7FED512E(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_5E1A8CEF48353FE0749D60AE7FED512E // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_BE4683AC4725A74ACBC872BA8A9AD86B(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_BE4683AC4725A74ACBC872BA8A9AD86B // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_79B2853947291BB2C2EB78952A95D057(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_79B2853947291BB2C2EB78952A95D057 // (BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_25C21A2E4DA6B0E71CDFD7A7F37E804E(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_25C21A2E4DA6B0E71CDFD7A7F37E804E // (BlueprintEvent) // @ game+0x132e1a0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void AnimNotify_L_Footprint(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.AnimNotify_L_Footprint // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void AnimNotify_R_Footprint(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.AnimNotify_R_Footprint // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void AnimNotify_JumpEnd(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.AnimNotify_JumpEnd // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_B8CE64394967BDDF50F7168B9EAF873B(); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Mainchar1_AnimBP_FPP_AnimGraphNode_TransitionResult_B8CE64394967BDDF50F7168B9EAF873B // (BlueprintEvent) // @ game+0x132e1a0
	void SendState(enum class SurvStateEnum SurvState, enum class MovementTypeEnum MovementType); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.SendState // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void ExecuteUbergraph_Mainchar1_AnimBP_FPP(int32_t EntryPoint); // Function Mainchar1_AnimBP_FPP.Mainchar1_AnimBP_FPP_C.ExecuteUbergraph_Mainchar1_AnimBP_FPP // (Final|UbergraphFunction) // @ game+0x132e1a0
};

