// UserDefinedStruct PropData.PropData
// Size: 0x89 (Inherited: 0x00)
struct FPropData {
	float HealthCoefficient_5_CCE4098145CF24DCE8BFBD99718A56DE; // 0x00(0x04)
	struct FRotator Rotation_15_77419AAA4EFF7D326C6FADBC23FEAE3B; // 0x04(0x0c)
	struct FVector AddingLocation_31_EB7ED9FB4664C1B2FACFC8986AF02A9A; // 0x10(0x0c)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct UFMODEvent* HitSound_20_6A185A9E45FCAEEF4F82A8BB445079A8; // 0x20(0x08)
	struct UFMODEvent* PropSound_22_89FB965B4B311C052760AC9F1A0E9343; // 0x28(0x08)
	struct TSoftObjectPtr<struct UStaticMesh> Mesh_54_FCE273C7465EEC67D83A07A273142771; // 0x30(0x28)
	bool SmallProp?_24_9EC5373D4F1A9CCC70BE33A878C9722E; // 0x58(0x01)
	bool BigPropJump?_26_2D960C1045CEF2ED7BA9A89EC61ACF32; // 0x59(0x01)
	bool Replicate?_28_9B784DEF4BAA5D4E2E6F2184782EA739; // 0x5a(0x01)
	bool StartStraight?_33_47ECB8D2425387E685B8F6B7EAD06206; // 0x5b(0x01)
	bool Burning?_35_458D7B9C4B8EE68CB9D6D0AD8FF35B2C; // 0x5c(0x01)
	bool ApplyDamage?_48_50CE6E2747CDF6353BDFB99BF3681FF1; // 0x5d(0x01)
	char pad_5E[0x2]; // 0x5e(0x02)
	struct TArray<struct UStaticMesh*> MainMesh_43_75D571DC4BAD7097B112E4B574A97EB0; // 0x60(0x10)
	struct TArray<struct UDestructibleMesh*> DestroyedMesh_44_EC0B66AB4B90AD80FD17CB9F1CC5DBB6; // 0x70(0x10)
	struct UFMODEvent* DestroyedSound_51_508D8E764CB398A8E748C9B2EA99A3FC; // 0x80(0x08)
	bool ChangingSound?_53_7E63A4C84576D4A6EF1F4B88130C766B; // 0x88(0x01)
};

