// UserDefinedStruct S_LobbyStateTransport.S_LobbyStateTransport
// Size: 0x64 (Inherited: 0x00)
struct FS_LobbyStateTransport {
	struct AActor* killer1_23_38E9F1E94D93F5F3C4D657ACBE876F0C; // 0x00(0x08)
	struct AActor* killer2_20_0A48C6124A0BAA75692C92B6F6DFD2A9; // 0x08(0x08)
	struct AActor* killer3_22_D0C816484F36EA19A083A2ACBBA7A761; // 0x10(0x08)
	struct AActor* killer4_40_2004D3DE4DC93A2FF9A99FAE092209BD; // 0x18(0x08)
	struct AActor* Survivor1_11_6D199C294C4CF5320C3CB887D58988E6; // 0x20(0x08)
	struct AActor* Survivor2_12_BAD87727437B632257A01EACD834A0C4; // 0x28(0x08)
	struct AActor* Survivor3_13_7C58E4194D1ECB8071E3A5A134128EF4; // 0x30(0x08)
	struct AActor* Survivor4_14_CC709D1F4E17E79BB8B66AA954A40A60; // 0x38(0x08)
	struct AActor* Survivor5_33_FD221D9C4AEDD961A4697BAEA68F0077; // 0x40(0x08)
	struct AActor* Survivor6_36_8BEA0FE14153CBEE766E9DA46A54F45C; // 0x48(0x08)
	struct AActor* Survivor7_37_F5C652B94B65B50F5BC6E08494E8AAB3; // 0x50(0x08)
	bool IsGranny_16_3B399A2840D8088FF4546F8799F16F35; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	int32_t Killers_26_6B237B754574C57E05965CB3742E5BC5; // 0x5c(0x04)
	int32_t Survivors_28_843B725E4CDCF5065648959C3E0FC769; // 0x60(0x04)
};

