// BlueprintGeneratedClass SurvivorMasterBP.SurvivorMasterBP_C
// Size: 0x16f8 (Inherited: 0x4e0)
struct ASurvivorMasterBP_C : APhysicsCharacter {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4e0(0x08)
	struct UCameraComponent* FPPCamera; // 0x4e8(0x08)
	struct USpringArmComponent* SpringArm1; // 0x4f0(0x08)
	struct UNiagaraComponent* StaticMeshNiagaraDestructable; // 0x4f8(0x08)
	struct USurvPropDestruction_C* SurvPropDestruction; // 0x500(0x08)
	struct UFMODAudioComponent* FMODPropBurningAudio; // 0x508(0x08)
	struct UWidgetComponent* NicknameWidget; // 0x510(0x08)
	struct UWidgetComponent* SurvRoleWidget; // 0x518(0x08)
	struct UNiagaraComponent* StaticMeshNiagaraCursed; // 0x520(0x08)
	struct UNiagaraComponent* SkeletalMeshNiagara; // 0x528(0x08)
	struct UNiagaraComponent* StaticMeshNiagara; // 0x530(0x08)
	struct USpringArmComponent* PropArm; // 0x538(0x08)
	struct UChildActorComponent* PropFPPCamera; // 0x540(0x08)
	struct UGraffityMaker_C* GraffityMaker; // 0x548(0x08)
	struct UFMODAudioComponent* FMODOnceVoices; // 0x550(0x08)
	struct UFMODAudioComponent* FMODLoopVoices; // 0x558(0x08)
	struct UFMODAudioComponent* FMODChair; // 0x560(0x08)
	struct USphereComponent* StaticMeshContainer; // 0x568(0x08)
	struct UStaticMeshComponent* PlayerStaticMesh; // 0x570(0x08)
	struct USceneComponent* StunScene; // 0x578(0x08)
	struct USoundChatSounds_C* SoundChatSounds; // 0x580(0x08)
	struct USceneComponent* FPPCamerasPlace; // 0x588(0x08)
	struct UCheckInteractable_C* CheckInteractable; // 0x590(0x08)
	struct UAlarmsWidgetSize_C* AlarmsWidgetSize; // 0x598(0x08)
	struct UCableComponent* Cable; // 0x5a0(0x08)
	struct UFMODAudioComponent* FMODAudio2; // 0x5a8(0x08)
	struct UItemWorker_C* ItemWorker; // 0x5b0(0x08)
	struct UFMODAudioComponent* FMODAudio1; // 0x5b8(0x08)
	struct USkeletalMeshComponent* InvisFPPMesh; // 0x5c0(0x08)
	struct USkeletalMeshComponent* InvisMesh; // 0x5c8(0x08)
	struct UVoipManagerComponent* VoipManager; // 0x5d0(0x08)
	struct UVoipAudioComponent* VoipAudio; // 0x5d8(0x08)
	struct USceneComponent* DropItemPosition; // 0x5e0(0x08)
	struct UBoxComponent* InteractBox; // 0x5e8(0x08)
	struct USceneComponent* InteractBoxContainer; // 0x5f0(0x08)
	struct USpotLightComponent* SpotLight; // 0x5f8(0x08)
	struct USceneComponent* AudioListener; // 0x600(0x08)
	struct UATPCCameraComponent* ATPCCamera; // 0x608(0x08)
	struct USceneComponent* Scene; // 0x610(0x08)
	struct USurvFart_C* SurvFart; // 0x618(0x08)
	struct USpringArmComponent* SpringArm; // 0x620(0x08)
	struct URegeneration_C* Regeneration1; // 0x628(0x08)
	struct USurvivorSoundsMaster-2D_C* SurvivorSoundMaster; // 0x630(0x08)
	struct USurvivorInteraction_C* SurvInteraction; // 0x638(0x08)
	struct USceneComponent* DefaultPointProp; // 0x640(0x08)
	struct UBoxComponent* Box1; // 0x648(0x08)
	struct UFMODAudioComponent* FMODPropLoopAudio; // 0x650(0x08)
	struct USceneComponent* FPPMeshContainer; // 0x658(0x08)
	struct UFMODAudioComponent* FMODPropHitAudio; // 0x660(0x08)
	struct USceneComponent* CameraGrapplePoint; // 0x668(0x08)
	struct USkeletalMeshComponent* FPPMesh; // 0x670(0x08)
	struct UCameraComponent* FollowCamera; // 0x678(0x08)
	struct UFMODAudioComponent* FmodAudio; // 0x680(0x08)
	struct UPostProcessComponent* PostProcess; // 0x688(0x08)
	struct UFootprintComponent_C* FootprintComponent; // 0x690(0x08)
	struct USmoothSync* SmoothSync; // 0x698(0x08)
	float Timeline_4_Alpha_4D4D07A64AF531E051135BB4A10EAAE4; // 0x6a0(0x04)
	enum class ETimelineDirection Timeline_4__Direction_4D4D07A64AF531E051135BB4A10EAAE4; // 0x6a4(0x01)
	char pad_6A5[0x3]; // 0x6a5(0x03)
	struct UTimelineComponent* Timeline_5; // 0x6a8(0x08)
	float Timeline_3_Alpha_EDD8D8BB42BC6EFFD204ACB3F90E9A23; // 0x6b0(0x04)
	enum class ETimelineDirection Timeline_3__Direction_EDD8D8BB42BC6EFFD204ACB3F90E9A23; // 0x6b4(0x01)
	char pad_6B5[0x3]; // 0x6b5(0x03)
	struct UTimelineComponent* Timeline_4; // 0x6b8(0x08)
	float ZoomOutTimeline_Alpha_56FD6C724DFA377C7F5A27A71D58F2DB; // 0x6c0(0x04)
	enum class ETimelineDirection ZoomOutTimeline__Direction_56FD6C724DFA377C7F5A27A71D58F2DB; // 0x6c4(0x01)
	char pad_6C5[0x3]; // 0x6c5(0x03)
	struct UTimelineComponent* ZoomOutTimeline; // 0x6c8(0x08)
	float Timeline_0_Alpha_D8903D0E43C9C9AC8C494192B318AADB; // 0x6d0(0x04)
	enum class ETimelineDirection Timeline_0__Direction_D8903D0E43C9C9AC8C494192B318AADB; // 0x6d4(0x01)
	char pad_6D5[0x3]; // 0x6d5(0x03)
	struct UTimelineComponent* Timeline_1; // 0x6d8(0x08)
	enum class ETimelineDirection DropItemHold__Direction_5E24FDAC43B39BF64E2B2E89568AAD81; // 0x6e0(0x01)
	char pad_6E1[0x7]; // 0x6e1(0x07)
	struct UTimelineComponent* DropItemHold; // 0x6e8(0x08)
	float DeathEffectTimeline_Lerp_1AD56D5F482733F5B7FF21945C716C1A; // 0x6f0(0x04)
	enum class ETimelineDirection DeathEffectTimeline__Direction_1AD56D5F482733F5B7FF21945C716C1A; // 0x6f4(0x01)
	char pad_6F5[0x3]; // 0x6f5(0x03)
	struct UTimelineComponent* DeathEffectTimeline; // 0x6f8(0x08)
	float Timeline_2_Alpha_F590837A4D182D3C48036EA9ACD1FE91; // 0x700(0x04)
	enum class ETimelineDirection Timeline_2__Direction_F590837A4D182D3C48036EA9ACD1FE91; // 0x704(0x01)
	char pad_705[0x3]; // 0x705(0x03)
	struct UTimelineComponent* Timeline_3; // 0x708(0x08)
	float BlurTimeline_Alpha_E678B1E44A3CA3CCBC33F2870F4D589F; // 0x710(0x04)
	enum class ETimelineDirection BlurTimeline__Direction_E678B1E44A3CA3CCBC33F2870F4D589F; // 0x714(0x01)
	char pad_715[0x3]; // 0x715(0x03)
	struct UTimelineComponent* BlurTimeline; // 0x718(0x08)
	float CapsuleTimeline_Alpha_3931415B4DA717316CBCC4B2447C088F; // 0x720(0x04)
	enum class ETimelineDirection CapsuleTimeline__Direction_3931415B4DA717316CBCC4B2447C088F; // 0x724(0x01)
	char pad_725[0x3]; // 0x725(0x03)
	struct UTimelineComponent* CapsuleTimeline; // 0x728(0x08)
	float TimelineFOV_Alpha_BB6E0F3D4368D461E87B1DA7C8A0706C; // 0x730(0x04)
	enum class ETimelineDirection TimelineFOV__Direction_BB6E0F3D4368D461E87B1DA7C8A0706C; // 0x734(0x01)
	char pad_735[0x3]; // 0x735(0x03)
	struct UTimelineComponent* TimelineFOV; // 0x738(0x08)
	float CameraInteract_NewTrack_0_D42A0B284E3720C10D21618BBE3F6A57; // 0x740(0x04)
	enum class ETimelineDirection CameraInteract__Direction_D42A0B284E3720C10D21618BBE3F6A57; // 0x744(0x01)
	char pad_745[0x3]; // 0x745(0x03)
	struct UTimelineComponent* CameraInteract; // 0x748(0x08)
	float Rope_NewTrack_0_79166F2E47E56ABEB7D4D381CFC3C44E; // 0x750(0x04)
	enum class ETimelineDirection Rope__Direction_79166F2E47E56ABEB7D4D381CFC3C44E; // 0x754(0x01)
	char pad_755[0x3]; // 0x755(0x03)
	struct UTimelineComponent* Rope; // 0x758(0x08)
	float HitTimeline_Pitch_033072B4460D8031F3574FA1B2C15E3C; // 0x760(0x04)
	enum class ETimelineDirection HitTimeline__Direction_033072B4460D8031F3574FA1B2C15E3C; // 0x764(0x01)
	char pad_765[0x3]; // 0x765(0x03)
	struct UTimelineComponent* HitTimeline; // 0x768(0x08)
	float Timeline_1_NewTrack_0_28424CF84D5D555B496C44BDBC6E5372; // 0x770(0x04)
	enum class ETimelineDirection Timeline_1__Direction_28424CF84D5D555B496C44BDBC6E5372; // 0x774(0x01)
	char pad_775[0x3]; // 0x775(0x03)
	struct UTimelineComponent* Timeline_2; // 0x778(0x08)
	float PPColorChange_Lerp_E61BC77648192EB1FD5307BB391141EA; // 0x780(0x04)
	enum class ETimelineDirection PPColorChange__Direction_E61BC77648192EB1FD5307BB391141EA; // 0x784(0x01)
	char pad_785[0x3]; // 0x785(0x03)
	struct UTimelineComponent* PPColorChange; // 0x788(0x08)
	enum class ETimelineDirection HitEventTimeline__Direction_06B7D53F4BE6AE8DE3FE4B9B18752BCB; // 0x790(0x01)
	char pad_791[0x7]; // 0x791(0x07)
	struct UTimelineComponent* HitEventTimeline; // 0x798(0x08)
	float TimelineJump_Jump_74BC80A542EA939C26100EB00C9A924D; // 0x7a0(0x04)
	enum class ETimelineDirection TimelineJump__Direction_74BC80A542EA939C26100EB00C9A924D; // 0x7a4(0x01)
	char pad_7A5[0x3]; // 0x7a5(0x03)
	struct UTimelineComponent* TimelineJump; // 0x7a8(0x08)
	float LerpAlphaTimeline_Lerp_281CB55F46C7C7F578BF9F88611AAA8F; // 0x7b0(0x04)
	enum class ETimelineDirection LerpAlphaTimeline__Direction_281CB55F46C7C7F578BF9F88611AAA8F; // 0x7b4(0x01)
	char pad_7B5[0x3]; // 0x7b5(0x03)
	struct UTimelineComponent* LerpAlphaTimeline; // 0x7b8(0x08)
	float BaseTurnRate; // 0x7c0(0x04)
	float BaseLookUpRate; // 0x7c4(0x04)
	float RunSpeed; // 0x7c8(0x04)
	float CrouchSpeed; // 0x7cc(0x04)
	float WalkSpeed; // 0x7d0(0x04)
	float CrawlSpeed; // 0x7d4(0x04)
	int32_t Health; // 0x7d8(0x04)
	bool Hitted?; // 0x7dc(0x01)
	char pad_7DD[0x3]; // 0x7dd(0x03)
	float MeleeSpeedUpPercent; // 0x7e0(0x04)
	enum class MovementTypeEnum MovementType; // 0x7e4(0x01)
	bool SpeedUpAfterMeleeHit?; // 0x7e5(0x01)
	bool ImProp?; // 0x7e6(0x01)
	char pad_7E7[0x1]; // 0x7e7(0x01)
	struct FVector ForwardVector; // 0x7e8(0x0c)
	struct FVector RightVector; // 0x7f4(0x0c)
	struct AActor* Item; // 0x800(0x08)
	struct TArray<struct AItemsBPHand_C*> ItemsInventory; // 0x808(0x10)
	struct AItemsBPHand_C* ItemToSpawn; // 0x818(0x08)
	int32_t InventoryIndex; // 0x820(0x04)
	bool StartRotate?; // 0x824(0x01)
	char pad_825[0x3]; // 0x825(0x03)
	float DeltaSeconds; // 0x828(0x04)
	bool StopMove?; // 0x82c(0x01)
	char pad_82D[0x3]; // 0x82d(0x03)
	float LerpAlpha; // 0x830(0x04)
	bool ItemFound?; // 0x834(0x01)
	char pad_835[0x3]; // 0x835(0x03)
	struct FVector JumpVector; // 0x838(0x0c)
	float HealingProgress; // 0x844(0x04)
	bool EmptyInventory?; // 0x848(0x01)
	char pad_849[0x3]; // 0x849(0x03)
	struct FRotator AxisRotator; // 0x84c(0x0c)
	float ReanimateProgress; // 0x858(0x04)
	bool Grapple?; // 0x85c(0x01)
	bool OnChair?; // 0x85d(0x01)
	char pad_85E[0x2]; // 0x85e(0x02)
	float ZeroSpeed; // 0x860(0x04)
	float RightLeft; // 0x864(0x04)
	bool PressA?; // 0x868(0x01)
	bool PressD?; // 0x869(0x01)
	char pad_86A[0x2]; // 0x86a(0x02)
	float BreakFreeProgress; // 0x86c(0x04)
	bool Shake?; // 0x870(0x01)
	char pad_871[0x7]; // 0x871(0x07)
	struct AActor* KillerActor; // 0x878(0x08)
	struct USoundBase* HeartbeatSound1; // 0x880(0x08)
	float NewDelay; // 0x888(0x04)
	bool change?; // 0x88c(0x01)
	char pad_88D[0x3]; // 0x88d(0x03)
	float FinalDelay; // 0x890(0x04)
	bool NewCall?; // 0x894(0x01)
	char pad_895[0x3]; // 0x895(0x03)
	float PrevDelay; // 0x898(0x04)
	char pad_89C[0x4]; // 0x89c(0x04)
	struct USurvivalProgressBarWidget_C* SurvivalProgressBar; // 0x8a0(0x08)
	struct USurvivalSkillCheckWidget_C* SurvivalSkillCheck; // 0x8a8(0x08)
	float ProgressUI; // 0x8b0(0x04)
	float FullHealTime; // 0x8b4(0x04)
	float FullReanimateTime; // 0x8b8(0x04)
	float CurrentHelpGetOutChair; // 0x8bc(0x04)
	float FullHelpGetOutChair; // 0x8c0(0x04)
	float FullOpenExit; // 0x8c4(0x04)
	float FullReloaingAlarm; // 0x8c8(0x04)
	float CurrentGetOutChair; // 0x8cc(0x04)
	struct AActor* ChairActor; // 0x8d0(0x08)
	float FullGetOutChair; // 0x8d8(0x04)
	int32_t RandomChance; // 0x8dc(0x04)
	struct USurvivalHealthWidget_C* SurvivalHealth; // 0x8e0(0x08)
	struct USurvivalInventoryWidget_C* SurvivalInventory; // 0x8e8(0x08)
	struct AItemsBPHand_C* CurrentItem; // 0x8f0(0x08)
	bool AddItem?; // 0x8f8(0x01)
	bool DeleteItem?; // 0x8f9(0x01)
	bool ItemSwitch?; // 0x8fa(0x01)
	char pad_8FB[0x5]; // 0x8fb(0x05)
	struct FMulticastInlineDelegate ED_MovementType; // 0x900(0x10)
	struct UCoolDownWBP_C* SurvivalAbility; // 0x910(0x08)
	bool Ability1Reloading?; // 0x918(0x01)
	bool Ability2Reloading?; // 0x919(0x01)
	char pad_91A[0x2]; // 0x91a(0x02)
	float FullGetOutKillerHand; // 0x91c(0x04)
	bool FailedSkillCheck?; // 0x920(0x01)
	bool RandomSkillCheck?; // 0x921(0x01)
	char pad_922[0x6]; // 0x922(0x06)
	struct ANewAlarmBP_C* CurrentAlarm; // 0x928(0x08)
	struct FString Skill1; // 0x930(0x10)
	struct FString Skill2; // 0x940(0x10)
	struct FString Skill3Rotate; // 0x950(0x10)
	struct FString Skill3Flashlight; // 0x960(0x10)
	struct FString Skill3Empty; // 0x970(0x10)
	float KillingTime; // 0x980(0x04)
	char pad_984[0x4]; // 0x984(0x04)
	struct UInteractableButtonsWidget_C* InteractableButtons; // 0x988(0x08)
	struct FText AlarmText; // 0x990(0x18)
	struct FText ReanimateText; // 0x9a8(0x18)
	struct FText HealAllyText; // 0x9c0(0x18)
	struct FText HealSelfText; // 0x9d8(0x18)
	struct FText OpenExitText; // 0x9f0(0x18)
	struct FText PickUpText; // 0xa08(0x18)
	bool UpdateInteractable?; // 0xa20(0x01)
	char pad_A21[0x7]; // 0xa21(0x07)
	struct FText FlashlightText; // 0xa28(0x18)
	struct FText RotateText; // 0xa40(0x18)
	bool RotateInteractableActive?; // 0xa58(0x01)
	char pad_A59[0x7]; // 0xa59(0x07)
	struct FString BreakFreeText; // 0xa60(0x10)
	bool ChairInteractableActive?; // 0xa70(0x01)
	char pad_A71[0x3]; // 0xa71(0x03)
	float TorqueValue; // 0xa74(0x04)
	struct FPropData PropData; // 0xa78(0x90)
	float CurrentStamina; // 0xb08(0x04)
	int32_t MaxHP; // 0xb0c(0x04)
	bool IsOwner?; // 0xb10(0x01)
	enum class EFootprintStyle CurrentFootwear; // 0xb11(0x01)
	char pad_B12[0x6]; // 0xb12(0x06)
	struct USurvivalStaminaBarWidget_C* StaminaBar; // 0xb18(0x08)
	float MaxStamina; // 0xb20(0x04)
	bool StaminaActive?; // 0xb24(0x01)
	bool PressedRun?; // 0xb25(0x01)
	bool JumpButtonPressed?; // 0xb26(0x01)
	bool SlowIncrease?; // 0xb27(0x01)
	float StaminaDecreaseAmountValue; // 0xb28(0x04)
	float StaminaJumpAmountValue; // 0xb2c(0x04)
	float MaxValueProgressUI; // 0xb30(0x04)
	bool StaticHit?; // 0xb34(0x01)
	char pad_B35[0x3]; // 0xb35(0x03)
	float RotateInterpSpeed; // 0xb38(0x04)
	bool CanJump?; // 0xb3c(0x01)
	char pad_B3D[0x3]; // 0xb3d(0x03)
	float ImpulseThreshold; // 0xb40(0x04)
	float ImpulseThresholdMax; // 0xb44(0x04)
	float VolumeSensitivity; // 0xb48(0x04)
	float MaxVolume; // 0xb4c(0x04)
	bool PropSoundActive?; // 0xb50(0x01)
	char pad_B51[0x3]; // 0xb51(0x03)
	float PropSpeed; // 0xb54(0x04)
	bool TestSwitchActive?; // 0xb58(0x01)
	char pad_B59[0x3]; // 0xb59(0x03)
	float CurrentCharacterSpeed; // 0xb5c(0x04)
	float PropTempValue; // 0xb60(0x04)
	char pad_B64[0x4]; // 0xb64(0x04)
	struct AActor* CalculateRayHitActor; // 0xb68(0x08)
	struct USoundBase* HeartbeatSound2; // 0xb70(0x08)
	bool StartRegeneration?; // 0xb78(0x01)
	bool StartSelfReanimate?; // 0xb79(0x01)
	char pad_B7A[0x2]; // 0xb7a(0x02)
	float SelfReanimateValue; // 0xb7c(0x04)
	float SelfReanimateFullValue; // 0xb80(0x04)
	bool CrawlStatusStart?; // 0xb84(0x01)
	char pad_B85[0x3]; // 0xb85(0x03)
	float StaminaIncreaseAmountValue; // 0xb88(0x04)
	char pad_B8C[0x4]; // 0xb8c(0x04)
	struct AActor* NewOutline; // 0xb90(0x08)
	struct AActor* OldOutline; // 0xb98(0x08)
	struct FLinearColor CloseColorOutline; // 0xba0(0x10)
	struct UMaterialInstanceDynamic* MaterialOutline; // 0xbb0(0x08)
	struct FLinearColor OpenColorOutline; // 0xbb8(0x10)
	struct FLinearColor DefaultColorOutline; // 0xbc8(0x10)
	struct AActor* LastExitActor; // 0xbd8(0x08)
	struct FFMODEventInstance ChasingFMODSound; // 0xbe0(0x08)
	struct ANewAlarmBP_C* AlarmRef; // 0xbe8(0x08)
	float MaxHealthCalculateValue; // 0xbf0(0x04)
	bool GameStart?; // 0xbf4(0x01)
	char pad_BF5[0x3]; // 0xbf5(0x03)
	float KillerAmbientValue; // 0xbf8(0x04)
	bool ZeroStamina?; // 0xbfc(0x01)
	char pad_BFD[0x3]; // 0xbfd(0x03)
	struct FFMODEventInstance LevelAmbient; // 0xc00(0x08)
	bool FreeCam?; // 0xc08(0x01)
	char pad_C09[0x3]; // 0xc09(0x03)
	int32_t RestoreHealth; // 0xc0c(0x04)
	float JumpAlpha; // 0xc10(0x04)
	struct FVector TempVector; // 0xc14(0x0c)
	struct FText EscapeText; // 0xc20(0x18)
	struct UCameraComponent* ActiveCamera; // 0xc38(0x08)
	bool FPP?; // 0xc40(0x01)
	char pad_C41[0x7]; // 0xc41(0x07)
	struct UFMODAudioComponent* SurvTransform; // 0xc48(0x08)
	struct UFMODAudioComponent* flashlight; // 0xc50(0x08)
	float MouseSensitive; // 0xc58(0x04)
	bool KillerAstral?; // 0xc5c(0x01)
	bool ReloadingAlarm?; // 0xc5d(0x01)
	char pad_C5E[0x2]; // 0xc5e(0x02)
	int32_t Points; // 0xc60(0x04)
	bool EndJump?; // 0xc64(0x01)
	char pad_C65[0x3]; // 0xc65(0x03)
	struct UWaypointWidget_C* WaypointWidget; // 0xc68(0x08)
	struct FString Skill4; // 0xc70(0x10)
	bool Ability4Reloading?; // 0xc80(0x01)
	bool OpenDoor?; // 0xc81(0x01)
	bool MeleeAttack?; // 0xc82(0x01)
	bool RangeAttack?; // 0xc83(0x01)
	float RangeSpeedUpPercent; // 0xc84(0x04)
	bool SpeedUpAfterRangeHit?; // 0xc88(0x01)
	char pad_C89[0x3]; // 0xc89(0x03)
	float MaxWalkSpeed; // 0xc8c(0x04)
	bool ImHealing?; // 0xc90(0x01)
	char pad_C91[0x3]; // 0xc91(0x03)
	int32_t MaxHPForRegeneration; // 0xc94(0x04)
	bool UseFlashlight?; // 0xc98(0x01)
	bool Escape?; // 0xc99(0x01)
	char pad_C9A[0x2]; // 0xc9a(0x02)
	struct FVector Temp2Vector; // 0xc9c(0x0c)
	float RotateLerp; // 0xca8(0x04)
	bool RotateHitted?; // 0xcac(0x01)
	bool ImHealingAlly?; // 0xcad(0x01)
	char pad_CAE[0x2]; // 0xcae(0x02)
	struct FVector4 NormalColor; // 0xcb0(0x10)
	struct FVector4 MonochromeColor; // 0xcc0(0x10)
	bool GetReady?; // 0xcd0(0x01)
	bool HelpGetOutChair?; // 0xcd1(0x01)
	enum class DamageTypeEnum DamageType; // 0xcd2(0x01)
	char pad_CD3[0x5]; // 0xcd3(0x05)
	struct FText BleedingText; // 0xcd8(0x18)
	bool KnifeInTheBody?; // 0xcf0(0x01)
	char pad_CF1[0x3]; // 0xcf1(0x03)
	float MaxPullOut; // 0xcf4(0x04)
	float CurrentPullOut; // 0xcf8(0x04)
	struct FRotator HeadRotation; // 0xcfc(0x0c)
	bool Move?; // 0xd08(0x01)
	bool HealingMe?; // 0xd09(0x01)
	enum class SurvStateEnum SurvStateEnum; // 0xd0a(0x01)
	bool StartRotateProp?; // 0xd0b(0x01)
	struct FRotator RotateProp; // 0xd0c(0x0c)
	struct AItemsBPHand_C* ItemVar; // 0xd18(0x08)
	int32_t ItemSpawnIndex; // 0xd20(0x04)
	char pad_D24[0xc]; // 0xd24(0x0c)
	struct FTransform SpawnItemLocation; // 0xd30(0x30)
	bool BreakFreeFull?; // 0xd60(0x01)
	char pad_D61[0x3]; // 0xd61(0x03)
	float YawMod; // 0xd64(0x04)
	struct UMaterialInstanceDynamic* SurvDynMat1; // 0xd68(0x08)
	struct UMaterialInstanceDynamic* SurvDynMat2; // 0xd70(0x08)
	struct UMaterialInstanceDynamic* SurvDynMat3; // 0xd78(0x08)
	float DeathEffectTime; // 0xd80(0x04)
	float DeathEffectDuration; // 0xd84(0x04)
	struct FTimerHandle DeathEffectTimer; // 0xd88(0x08)
	float Float1; // 0xd90(0x04)
	bool SoundsStop?; // 0xd94(0x01)
	char pad_D95[0x3]; // 0xd95(0x03)
	struct TArray<struct ASurvivorMasterBP_C*> AllSurvs; // 0xd98(0x10)
	struct UMaterialInterface* SurvBodyHitMaterial; // 0xda8(0x08)
	struct UMaterialInterface* SurvPastedClothHitMaterial; // 0xdb0(0x08)
	struct UMaterialInterface* SurvClothHitMaterial; // 0xdb8(0x08)
	struct UMaterialInterface* SurvBodyDefaultMaterial; // 0xdc0(0x08)
	struct UMaterialInterface* SurvPastedClothDefaultMaterial; // 0xdc8(0x08)
	struct UMaterialInterface* SurvClothDefaultMaterial; // 0xdd0(0x08)
	struct AHUD_PropHunt_C* HUDRef; // 0xdd8(0x08)
	bool Allow Voice; // 0xde0(0x01)
	bool VoiceActive?; // 0xde1(0x01)
	char pad_DE2[0x2]; // 0xde2(0x02)
	float EnergyDrinkBoost; // 0xde4(0x04)
	bool Boosted?; // 0xde8(0x01)
	bool Invulnerability?; // 0xde9(0x01)
	char pad_DEA[0x2]; // 0xdea(0x02)
	float InvulnerabilityTime; // 0xdec(0x04)
	struct FText LootboxShopText; // 0xdf0(0x18)
	bool BeginPlayOver?; // 0xe08(0x01)
	char pad_E09[0x7]; // 0xe09(0x07)
	struct FString CoinText; // 0xe10(0x10)
	struct FString ScoreText; // 0xe20(0x10)
	struct ASurvivorMasterBP_C* LastHittedSurv; // 0xe30(0x08)
	bool HelpLeader?; // 0xe38(0x01)
	char pad_E39[0x3]; // 0xe39(0x03)
	struct FVector StartPos; // 0xe3c(0x0c)
	struct FVector TargetPos; // 0xe48(0x0c)
	float DistanceForGraple; // 0xe54(0x04)
	float MovedDistance; // 0xe58(0x04)
	float Speed; // 0xe5c(0x04)
	bool InGraple; // 0xe60(0x01)
	bool HookInHands; // 0xe61(0x01)
	char pad_E62[0x6]; // 0xe62(0x06)
	struct UCurveFloat* HeightCurve; // 0xe68(0x08)
	struct USurvivalEffectsUI_C* SurvEffectsUI; // 0xe70(0x08)
	enum class SurvClass SurvClass; // 0xe78(0x01)
	bool KillerSee?; // 0xe79(0x01)
	char pad_E7A[0x2]; // 0xe7a(0x02)
	float BreakFreeProgressSaved; // 0xe7c(0x04)
	int32_t KillerType; // 0xe80(0x04)
	float SelfReanimateProgressReplicated; // 0xe84(0x04)
	bool Smooth?; // 0xe88(0x01)
	bool CDInteract; // 0xe89(0x01)
	char pad_E8A[0x2]; // 0xe8a(0x02)
	float Bias; // 0xe8c(0x04)
	struct TArray<struct ALootBox_C*> LootBoxs; // 0xe90(0x10)
	float XAxis; // 0xea0(0x04)
	float YAxis; // 0xea4(0x04)
	bool StartRotatePropSoundActive?; // 0xea8(0x01)
	bool Freeze; // 0xea9(0x01)
	char pad_EAA[0x2]; // 0xeaa(0x02)
	struct FVector OldCharPos; // 0xeac(0x0c)
	struct FVector OldWidgetPos; // 0xeb8(0x0c)
	char pad_EC4[0x4]; // 0xec4(0x04)
	struct AActor* TempCalculateRay; // 0xec8(0x08)
	float PhysicsTickDeltaTime; // 0xed0(0x04)
	float BoostExit; // 0xed4(0x04)
	float animationSpeed; // 0xed8(0x04)
	bool SecondJumpProp?; // 0xedc(0x01)
	char pad_EDD[0x3]; // 0xedd(0x03)
	struct TArray<struct AActor*> NicknamePropActorsIgnore; // 0xee0(0x10)
	struct FVector CustomOffset; // 0xef0(0x0c)
	struct FVector StandartOffset; // 0xefc(0x0c)
	bool TransformChangeHealth?; // 0xf08(0x01)
	char pad_F09[0x7]; // 0xf09(0x07)
	struct ADoppelganger_C* Doppelganger; // 0xf10(0x08)
	enum class SurvSkills SurvSkill; // 0xf18(0x01)
	char pad_F19[0x3]; // 0xf19(0x03)
	int32_t NeedPointsLootbox; // 0xf1c(0x04)
	float DefaultFOV; // 0xf20(0x04)
	int32_t ChairStage; // 0xf24(0x04)
	float AirTime; // 0xf28(0x04)
	bool Intro?; // 0xf2c(0x01)
	char pad_F2D[0x3]; // 0xf2d(0x03)
	struct UMaterialInstanceDynamic* MaterialBlur; // 0xf30(0x08)
	struct FString NicknameString; // 0xf38(0x10)
	struct APostProcessVolume* PostProcessVolumeVar; // 0xf48(0x08)
	struct FPostProcessSettings DefaultPostProcessSettings; // 0xf50(0x550)
	struct UMaterialInstanceDynamic* MaterialVignette; // 0x14a0(0x08)
	struct FRotator PropCorrectionRotation; // 0x14a8(0x0c)
	float ScenePropHealth; // 0x14b4(0x04)
	struct TArray<struct FVector> SavedPoints; // 0x14b8(0x10)
	float TempFloat; // 0x14c8(0x04)
	bool TempBool; // 0x14cc(0x01)
	char pad_14CD[0x3]; // 0x14cd(0x03)
	float TempFloat2; // 0x14d0(0x04)
	struct FVector Temp3Vector; // 0x14d4(0x0c)
	struct FVector Temp4Vector; // 0x14e0(0x0c)
	struct FRotator TempRotation; // 0x14ec(0x0c)
	struct FRotator TempRotation2; // 0x14f8(0x0c)
	float TempFloat3; // 0x1504(0x04)
	bool NewVar_1; // 0x1508(0x01)
	char pad_1509[0x3]; // 0x1509(0x03)
	float ProgressUISpectator; // 0x150c(0x04)
	float MaxProgressUISpectator; // 0x1510(0x04)
	float LastAirTime; // 0x1514(0x04)
	bool PullOut?; // 0x1518(0x01)
	char pad_1519[0x3]; // 0x1519(0x03)
	struct FVector PropMovementInterpVar; // 0x151c(0x0c)
	bool BlockLMB?; // 0x1528(0x01)
	bool BlockRMB?; // 0x1529(0x01)
	bool Tutorial?; // 0x152a(0x01)
	bool PropHuntMode?; // 0x152b(0x01)
	enum class E_Mode Mode; // 0x152c(0x01)
	bool isAI; // 0x152d(0x01)
	char pad_152E[0x2]; // 0x152e(0x02)
	struct ASurvivorMasterBP_C* HealAlly; // 0x1530(0x08)
	bool LobbbyWait?; // 0x1538(0x01)
	bool IsaacBoosted?; // 0x1539(0x01)
	char pad_153A[0x2]; // 0x153a(0x02)
	float IsaacTimeBoost; // 0x153c(0x04)
	bool PressedCrouch?; // 0x1540(0x01)
	char pad_1541[0x3]; // 0x1541(0x03)
	int32_t AliveTime; // 0x1544(0x04)
	struct AActor* PropObject; // 0x1548(0x08)
	bool LocalBoolProp; // 0x1550(0x01)
	enum class SurvChars SurvChar; // 0x1551(0x01)
	bool OutlineBlock; // 0x1552(0x01)
	bool Small Prop?; // 0x1553(0x01)
	bool OnlyTPP?; // 0x1554(0x01)
	bool CustomPlayAnimWalk?; // 0x1555(0x01)
	char pad_1556[0x2]; // 0x1556(0x02)
	struct TArray<struct UMaterialInstanceDynamic*> PropMaterials; // 0x1558(0x10)
	float DistanceTraveled; // 0x1568(0x04)
	char pad_156C[0x4]; // 0x156c(0x04)
	struct FText PingText; // 0x1570(0x18)
	bool SurvTrack3000Block?; // 0x1588(0x01)
	bool BlockHelp?; // 0x1589(0x01)
	char pad_158A[0x2]; // 0x158a(0x02)
	int32_t PropJumpCount; // 0x158c(0x04)
	int32_t DefaultJumpCount; // 0x1590(0x04)
	float PropSoundVolumeModifier; // 0x1594(0x04)
	float BreakFreeBonusVar; // 0x1598(0x04)
	float BlockTime; // 0x159c(0x04)
	bool FullHP?; // 0x15a0(0x01)
	char pad_15A1[0x3]; // 0x15a1(0x03)
	int32_t NeedPointsMedkit; // 0x15a4(0x04)
	bool DrDolittle?; // 0x15a8(0x01)
	bool DrDolittleInteractReady?; // 0x15a9(0x01)
	bool AlarmFinished?; // 0x15aa(0x01)
	bool RushActive?; // 0x15ab(0x01)
	float StaminaRushDecreaseAmountValue; // 0x15ac(0x04)
	bool Rush?; // 0x15b0(0x01)
	char pad_15B1[0x3]; // 0x15b1(0x03)
	float BlockTimeMultiply; // 0x15b4(0x04)
	bool CursedPropChallenge?; // 0x15b8(0x01)
	char pad_15B9[0x3]; // 0x15b9(0x03)
	float CursedPropChallengeValue; // 0x15bc(0x04)
	float CursedPropChallengeMaxValue; // 0x15c0(0x04)
	char pad_15C4[0x4]; // 0x15c4(0x04)
	struct ABasePropBP_C* Cursed Prop; // 0x15c8(0x08)
	struct FText HoudiniText; // 0x15d0(0x18)
	struct UMaterialInstanceDynamic* MaterialVignette2; // 0x15e8(0x08)
	struct FVector ImpactPoint; // 0x15f0(0x0c)
	bool WallJump?; // 0x15fc(0x01)
	char pad_15FD[0x3]; // 0x15fd(0x03)
	struct ABP_Spectator_C* BP_Spectator; // 0x1600(0x08)
	char pad_1608[0x8]; // 0x1608(0x08)
	struct FTransform ParticleTransform; // 0x1610(0x30)
	enum class SurvRole SurvRole; // 0x1640(0x01)
	char pad_1641[0x7]; // 0x1641(0x07)
	struct TArray<float> r3; // 0x1648(0x10)
	int32_t I; // 0x1658(0x04)
	float ZLocalMin; // 0x165c(0x04)
	float ZLocal; // 0x1660(0x04)
	char pad_1664[0x4]; // 0x1664(0x04)
	struct ASurvivorMasterBP_C* SREF; // 0x1668(0x08)
	int32_t CountCoins; // 0x1670(0x04)
	int32_t SupportHealedCount; // 0x1674(0x04)
	struct TArray<struct UMaterialInstanceDynamic*> PropDynMaterials; // 0x1678(0x10)
	struct TArray<struct AInteractableDoor_C*> DoorArray; // 0x1688(0x10)
	float DamageMarkerAngle; // 0x1698(0x04)
	bool escapeLoop; // 0x169c(0x01)
	char pad_169D[0x3]; // 0x169d(0x03)
	struct UMaterialInstanceDynamic* SoftOutline; // 0x16a0(0x08)
	struct UFMODAudioComponent* BleedingSound; // 0x16a8(0x08)
	struct UFMODAudioComponent* EscapeStruggle; // 0x16b0(0x08)
	float ChaseValue; // 0x16b8(0x04)
	float PropDistance; // 0x16bc(0x04)
	bool IntroAnim?; // 0x16c0(0x01)
	bool TestViewB; // 0x16c1(0x01)
	bool CanBurning?; // 0x16c2(0x01)
	bool Burning?; // 0x16c3(0x01)
	bool EnergyDrnkAnimB; // 0x16c4(0x01)
	bool KBookAnimB; // 0x16c5(0x01)
	char pad_16C6[0x2]; // 0x16c6(0x02)
	int32_t SkinID; // 0x16c8(0x04)
	int32_t DestructionLvl; // 0x16cc(0x04)
	struct TArray<struct FCoinMaxStruct> MaxScoreInt; // 0x16d0(0x10)
	struct TArray<int32_t> MaxScoreTemp; // 0x16e0(0x10)
	bool IsMessageBlocked; // 0x16f0(0x01)
	bool CheatEnabled; // 0x16f1(0x01)
	char pad_16F2[0x2]; // 0x16f2(0x02)
	float AxisForwardFloat; // 0x16f4(0x04)

	void HeadRotationFunc(struct FRotator Rotation); // Function SurvivorMasterBP.SurvivorMasterBP_C.HeadRotationFunc // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void get level name(bool B, struct FString Name); // Function SurvivorMasterBP.SurvivorMasterBP_C.get level name // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void Exp Score Calc(int32_t Points, enum class CoinEnum CoinType); // Function SurvivorMasterBP.SurvivorMasterBP_C.Exp Score Calc // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void Init Max Score(); // Function SurvivorMasterBP.SurvivorMasterBP_C.Init Max Score // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void CoinAngle(float X, float Y, float Z); // Function SurvivorMasterBP.SurvivorMasterBP_C.CoinAngle // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
