// UserDefinedStruct SurvProfessions.SurvProfessions
// Size: 0x80 (Inherited: 0x00)
struct FSurvProfessions {
	struct FString ProfessionDesc_2_A1B71B1440E8D5B75E11B0A2277D2514; // 0x00(0x10)
	struct FString ProfessionItemName_5_AA2E064C447EC0D6F040879B8D0F2D87; // 0x10(0x10)
	struct FString ProfessionItemDesc_7_1CF8D8FA4FF27BA0CA596DB73EA40F18; // 0x20(0x10)
	struct UPaperSprite* ProfessionItemIcon_10_1874AF0346EE9C6E1819A290F9801D28; // 0x30(0x08)
	struct FText SkillName_17_3D15C4A248F366D96331888A56C0B77C; // 0x38(0x18)
	struct FText SkillDesc_18_B1B9625442DA2DF7C20A12884EA3FB08; // 0x50(0x18)
	struct UPaperSprite* SkillIcon_20_37922BFC4E3033B161F7CA9069A04257; // 0x68(0x08)
	struct FString SkillNameID_24_1DF1B69248A7206A910169B4B36E3C4B; // 0x70(0x10)
};

