// WidgetBlueprintGeneratedClass W_GameResult.W_GameResult_C
// Size: 0x75b (Inherited: 0x260)
struct UW_GameResult_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* ButtonMapHovered3; // 0x268(0x08)
	struct UWidgetAnimation* ButtonMapHovered2; // 0x270(0x08)
	struct UWidgetAnimation* ButtonMapHovered1; // 0x278(0x08)
	struct UWidgetAnimation* ButtonMapAnim3; // 0x280(0x08)
	struct UWidgetAnimation* ButtonMapAnim2; // 0x288(0x08)
	struct UWidgetAnimation* ButtonMapAnim1; // 0x290(0x08)
	struct UWidgetAnimation* ButtonVoteAnim3; // 0x298(0x08)
	struct UWidgetAnimation* ButtonVoteAnim2; // 0x2a0(0x08)
	struct UWidgetAnimation* ButtonVoteAnim1; // 0x2a8(0x08)
	struct UWidgetAnimation* FadeOutMatchRes; // 0x2b0(0x08)
	struct UWidgetAnimation* FadeOutVotMap; // 0x2b8(0x08)
	struct UWidgetAnimation* FadeInMatchRes; // 0x2c0(0x08)
	struct UImage* AvatarImage1; // 0x2c8(0x08)
	struct UImage* AvatarImage1_2; // 0x2d0(0x08)
	struct UImage* AvatarImage1_3; // 0x2d8(0x08)
	struct UBackgroundBlur* BackgroundBlur_114; // 0x2e0(0x08)
	struct UButton* ButtonVoteMap1; // 0x2e8(0x08)
	struct UButton* ButtonVoteMap1_2; // 0x2f0(0x08)
	struct UButton* ButtonVoteMap1_3; // 0x2f8(0x08)
	struct UCanvasPanel* Canvas; // 0x300(0x08)
	struct USizeBox* Category1; // 0x308(0x08)
	struct USizeBox* Category2; // 0x310(0x08)
	struct USizeBox* Category3; // 0x318(0x08)
	struct UTextBlock* CategoryType1; // 0x320(0x08)
	struct UTextBlock* CategoryType2; // 0x328(0x08)
	struct UTextBlock* CategoryType3; // 0x330(0x08)
	struct UTextBlock* CategoryValue1; // 0x338(0x08)
	struct UTextBlock* CategoryValue2; // 0x340(0x08)
	struct UTextBlock* CategoryValue3; // 0x348(0x08)
	struct UImage* Image; // 0x350(0x08)
	struct UImage* Image_16; // 0x358(0x08)
	struct UImage* Image_17; // 0x360(0x08)
	struct UImage* Image_18; // 0x368(0x08)
	struct UImage* Image_19; // 0x370(0x08)
	struct UImage* Image_113; // 0x378(0x08)
	struct UImage* Image_118; // 0x380(0x08)
	struct UImage* Image_120; // 0x388(0x08)
	struct UImage* Image_149; // 0x390(0x08)
	struct UImage* Image_156; // 0x398(0x08)
	struct UImage* Image_255; // 0x3a0(0x08)
	struct UImage* Image_287; // 0x3a8(0x08)
	struct UImage* Image_320; // 0x3b0(0x08)
	struct UImage* Image_334; // 0x3b8(0x08)
	struct UImage* Image_484; // 0x3c0(0x08)
	struct UImage* Image_634; // 0x3c8(0x08)
	struct UImage* Image_768; // 0x3d0(0x08)
	struct UImage* Image_BG_Border; // 0x3d8(0x08)
	struct UImage* Image_BG_Border_2; // 0x3e0(0x08)
	struct UImage* Image_BG_Border_3; // 0x3e8(0x08)
	struct UImage* Image_BG_Border_Selected; // 0x3f0(0x08)
	struct UImage* Image_BG_Border_Selected_2; // 0x3f8(0x08)
	struct UImage* Image_BG_Border_Selected_3; // 0x400(0x08)
	struct UImage* Image_L1; // 0x408(0x08)
	struct UImage* Image_L2; // 0x410(0x08)
	struct UImage* Image_L3; // 0x418(0x08)
	struct UImage* Image_MapRef; // 0x420(0x08)
	struct UImage* Image_PlayersRef; // 0x428(0x08)
	struct USizeBox* Line; // 0x430(0x08)
	struct UImage* MapBG1; // 0x438(0x08)
	struct UImage* MapBG2; // 0x440(0x08)
	struct UImage* MapBG3; // 0x448(0x08)
	struct UImage* MapBG_Border1; // 0x450(0x08)
	struct UImage* MapBG_Border2; // 0x458(0x08)
	struct UImage* MapBG_Border3; // 0x460(0x08)
	struct UImage* MapBG_Border_Selected1; // 0x468(0x08)
	struct UImage* MapBG_Border_Selected2; // 0x470(0x08)
	struct UImage* MapBG_Border_Selected3; // 0x478(0x08)
	struct UImage* MapImage1; // 0x480(0x08)
	struct UImage* MapImage1_2; // 0x488(0x08)
	struct UImage* MapImage1_3; // 0x490(0x08)
	struct UTextBlock* MapName; // 0x498(0x08)
	struct UTextBlock* MapName1; // 0x4a0(0x08)
	struct UTextBlock* MapName1_2; // 0x4a8(0x08)
	struct UTextBlock* MapName1_3; // 0x4b0(0x08)
	struct UTextBlock* MapVote1; // 0x4b8(0x08)
	struct UTextBlock* MapVote1_2; // 0x4c0(0x08)
	struct UTextBlock* MapVote1_3; // 0x4c8(0x08)
	struct UButton* MatchResult; // 0x4d0(0x08)
	struct UTextBlock* MatchTime; // 0x4d8(0x08)
	struct UTextBlock* NextGameTimer; // 0x4e0(0x08)
	struct UTextBlock* Nickname1; // 0x4e8(0x08)
	struct UTextBlock* Nickname2; // 0x4f0(0x08)
	struct UTextBlock* Nickname3; // 0x4f8(0x08)
	struct UHorizontalBox* PlayersBoxProphunt; // 0x500(0x08)
	struct UHorizontalBox* PlayersBoxPropnight; // 0x508(0x08)
	struct UProgressBar* ProgressBar_377; // 0x510(0x08)
	struct URetainerBox* RetainerBox_155; // 0x518(0x08)
	struct URetainerBox* RetainerBox_245; // 0x520(0x08)
	struct URetainerBox* RetainerBox_258; // 0x528(0x08)
	struct USizeBox* Selected1; // 0x530(0x08)
	struct USizeBox* Selected2; // 0x538(0x08)
	struct USizeBox* Selected3; // 0x540(0x08)
	struct UTextBlock* TextBlock_Map; // 0x548(0x08)
	struct UTextBlock* TextBlock_Match; // 0x550(0x08)
	struct UTextBlock* TextBlock_Match_2; // 0x558(0x08)
	struct UUniformGridPanel* UniformGridPanel_107; // 0x560(0x08)
	struct UUniformGridPanel* UniformGridPanel_141; // 0x568(0x08)
	struct UUniformGridPanel* UniformGridPanel_181; // 0x570(0x08)
	struct UTextBlock* VictoryText; // 0x578(0x08)
	struct UTextBlock* VictoryText_Shadow; // 0x580(0x08)
	struct UButton* VoteButton1; // 0x588(0x08)
	struct UButton* VoteButton1_2; // 0x590(0x08)
	struct UButton* VoteButton1_3; // 0x598(0x08)
	struct UButton* VoteButtonBig_2; // 0x5a0(0x08)
	struct UButton* VoteButtonBig_3; // 0x5a8(0x08)
	struct UButton* VoteButtonBig_4; // 0x5b0(0x08)
	struct UTextBlock* VoteCount1; // 0x5b8(0x08)
	struct UTextBlock* VoteCount2; // 0x5c0(0x08)
	struct UTextBlock* VoteCount3; // 0x5c8(0x08)
	struct UButton* VotingMap; // 0x5d0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_1; // 0x5d8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_5; // 0x5e0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_151; // 0x5e8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_418; // 0x5f0(0x08)
	struct TArray<struct APlayerState*> PlayersState; // 0x5f8(0x10)
	float FadeTime; // 0x608(0x04)
	int32_t RollNumber; // 0x60c(0x04)
	struct TArray<int32_t> RollArray; // 0x610(0x10)
	int32_t Index; // 0x620(0x04)
	bool WinSurv; // 0x624(0x01)
	char pad_625[0x3]; // 0x625(0x03)
	struct TArray<struct UPaperSprite*> imageArray; // 0x628(0x10)
	bool RollStart; // 0x638(0x01)
	char pad_639[0x3]; // 0x639(0x03)
	int32_t RollNum; // 0x63c(0x04)
	float RollFloat; // 0x640(0x04)
	bool Serv?; // 0x644(0x01)
	char pad_645[0x3]; // 0x645(0x03)
	float RollSpeed; // 0x648(0x04)
	char pad_64C[0x4]; // 0x64c(0x04)
	struct FFMODEventInstance LootSoundStart; // 0x650(0x08)
	struct AEndGameRenderMesh_C* RenderActor; // 0x658(0x08)
	bool EndGame?; // 0x660(0x01)
	bool Clicked?; // 0x661(0x01)
	char pad_662[0x2]; // 0x662(0x02)
	float Seconds; // 0x664(0x04)
	bool StartFadeOut?; // 0x668(0x01)
	char pad_669[0x7]; // 0x669(0x07)
	struct FFMODEventInstance MistSound; // 0x670(0x08)
	bool FadeSound?; // 0x678(0x01)
	char pad_679[0x3]; // 0x679(0x03)
	float MistVolume; // 0x67c(0x04)
	int32_t TempCategory; // 0x680(0x04)
	int32_t Killers?; // 0x684(0x04)
	float ProgressBarPercentTemp; // 0x688(0x04)
	char pad_68C[0x4]; // 0x68c(0x04)
	struct TMap<struct FString, struct UTexture2D*> Mapimage; // 0x690(0x50)
	struct TArray<struct UW_GameResultRow_C*> GameResultRow; // 0x6e0(0x10)
	struct TArray<struct APlayerState*> KillerArr; // 0x6f0(0x10)
	struct TArray<struct APlayerState*> PlayerArr; // 0x700(0x10)
	bool Voted; // 0x710(0x01)
	bool VotedMap; // 0x711(0x01)
	char pad_712[0x6]; // 0x712(0x06)
	struct TArray<struct UWidgetAnimation*> PlayedAnim; // 0x718(0x10)
	struct TArray<struct UImage*> SelectedMap; // 0x728(0x10)
	struct TArray<struct USizeBox*> SelectadArr; // 0x738(0x10)
	struct TArray<struct UImage*> imageL; // 0x748(0x10)
	bool VotedMap_3; // 0x758(0x01)
	bool VotedMap_4; // 0x759(0x01)
	bool IsSelectingAnimPlaying; // 0x75a(0x01)

	void AddSurvIcon(enum class SurvChars Selection, struct UImage* Image); // Function W_GameResult.W_GameResult_C.AddSurvIcon // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void AddKillerIcon(enum class KillerType KillerType, struct UImage* Image); // Function W_GameResult.W_GameResult_C.AddKillerIcon // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void Deselect Other Maps(struct UObject* MapBG, struct UObject* ImageLight, struct UObject* Checkimage); // Function W_GameResult.W_GameResult_C.Deselect Other Maps // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void PlayAnimAndSetColor(struct UWidgetAnimation* InAnimation, struct UImage* Target); // Function W_GameResult.W_GameResult_C.PlayAnimAndSetColor // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	struct FSlateBrush Get_MapImage1_2_Brush_1(); // Function W_GameResult.W_GameResult_C.Get_MapImage1_2_Brush_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FSlateBrush Get_MapImage1_1_Brush_1(); // Function W_GameResult.W_GameResult_C.Get_MapImage1_1_Brush_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FSlateBrush Get_MapImage1_Brush_1(); // Function W_GameResult.W_GameResult_C.Get_MapImage1_Brush_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText Get_MapName1_2_Text_1(); // Function W_GameResult.W_GameResult_C.Get_MapName1_2_Text_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText Get_MapName1_1_Text_1(); // Function W_GameResult.W_GameResult_C.Get_MapName1_1_Text_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText Get_MapName_Text_1(); // Function W_GameResult.W_GameResult_C.Get_MapName_Text_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText Get_MapName1_Text_1(); // Function W_GameResult.W_GameResult_C.Get_MapName1_Text_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText Get_VoteCount3_Text_1(); // Function W_GameResult.W_GameResult_C.Get_VoteCount3_Text_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText Get_VoteCount2_Text_1(); // Function W_GameResult.W_GameResult_C.Get_VoteCount2_Text_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText Get_VoteCount1_Text_1(); // Function W_GameResult.W_GameResult_C.Get_VoteCount1_Text_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText Get_MapVote1_2_Text_1(); // Function W_GameResult.W_GameResult_C.Get_MapVote1_2_Text_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText Get Map Vote 1 1 Text 0(); // Function W_GameResult.W_GameResult_C.Get Map Vote 1 1 Text 0 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText Get_MapVote1_Text_1(); // Function W_GameResult.W_GameResult_C.Get_MapVote1_Text_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	float PercentageLVL(); // Function W_GameResult.W_GameResult_C.PercentageLVL // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText LvlText(); // Function W_GameResult.W_GameResult_C.LvlText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FEventReply OnKeyDown(struct FGeometry MyGeometry, struct FKeyEvent InKeyEvent); // Function W_GameResult.W_GameResult_C.OnKeyDown // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void HasAnyEscapedSurvivor(bool Result); // Function W_GameResult.W_GameResult_C.HasAnyEscapedSurvivor // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void Construct(); // Function W_GameResult.W_GameResult_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function W_GameResult.W_GameResult_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void OnEndGameUI(bool EndGame?); // Function W_GameResult.W_GameResult_C.OnEndGameUI // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void StartCreate(); // Function W_GameResult.W_GameResult_C.StartCreate // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void UploadExp(); // Function W_GameResult.W_GameResult_C.UploadExp // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__ButtonVoteMap1_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__ButtonVoteMap1_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__ButtonVoteMap1_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__ButtonVoteMap1_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__ButtonVoteMap1_2_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__ButtonVoteMap1_2_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__VoteButton1_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__VoteButton1_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__VoteButton1_1_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__VoteButton1_1_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__VoteButton1_2_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__VoteButton1_2_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__VotingMap_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__VotingMap_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__MatchResult_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__MatchResult_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void StopEndGameSounds(); // Function W_GameResult.W_GameResult_C.StopEndGameSounds // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void PreConstruct(bool IsDesignTime); // Function W_GameResult.W_GameResult_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void OpenVotingMap(); // Function W_GameResult.W_GameResult_C.OpenVotingMap // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void PressE(); // Function W_GameResult.W_GameResult_C.PressE // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void PressQ(); // Function W_GameResult.W_GameResult_C.PressQ // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void Keyboard(); // Function W_GameResult.W_GameResult_C.Keyboard // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void SetMatchRes(); // Function W_GameResult.W_GameResult_C.SetMatchRes // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_GameResult_ButtonVoteMap1_1_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__W_GameResult_ButtonVoteMap1_1_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_GameResult_ButtonVoteMap1_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__W_GameResult_ButtonVoteMap1_1_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_GameResult_ButtonVoteMap1_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__W_GameResult_ButtonVoteMap1_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_GameResult_ButtonVoteMap1_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__W_GameResult_ButtonVoteMap1_K2Node_ComponentBoundEvent_11_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_GameResult_ButtonVoteMap1_2_K2Node_ComponentBoundEvent_12_OnButtonHoverEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__W_GameResult_ButtonVoteMap1_2_K2Node_ComponentBoundEvent_12_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_GameResult_ButtonVoteMap1_2_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__W_GameResult_ButtonVoteMap1_2_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_GameResult_VoteButtonBig_1_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__W_GameResult_VoteButtonBig_1_K2Node_ComponentBoundEvent_14_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_GameResult_VoteButtonBig_2_K2Node_ComponentBoundEvent_16_OnButtonClickedEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__W_GameResult_VoteButtonBig_2_K2Node_ComponentBoundEvent_16_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_GameResult_VoteButtonBig_3_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature(); // Function W_GameResult.W_GameResult_C.BndEvt__W_GameResult_VoteButtonBig_3_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void UnhoverMap_4(); // Function W_GameResult.W_GameResult_C.UnhoverMap_4 // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void UnhoverMap_3(); // Function W_GameResult.W_GameResult_C.UnhoverMap_3 // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void UnhoverMap_2(); // Function W_GameResult.W_GameResult_C.UnhoverMap_2 // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EndCamera(); // Function W_GameResult.W_GameResult_C.EndCamera // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void SetSettingsWidgetForQuickMatchSetUp(bool That_QM?); // Function W_GameResult.W_GameResult_C.SetSettingsWidgetForQuickMatchSetUp // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void ExecuteUbergraph_W_GameResult(int32_t EntryPoint); // Function W_GameResult.W_GameResult_C.ExecuteUbergraph_W_GameResult // (Final|UbergraphFunction|HasDefaults) // @ game+0x132e1a0
};

