// WidgetBlueprintGeneratedClass W_LoadingScreen.W_LoadingScreen_C
// Size: 0x4d8 (Inherited: 0x260)
struct UW_LoadingScreen_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* FadeOut; // 0x268(0x08)
	struct UWidgetAnimation* FadeIn; // 0x270(0x08)
	struct UWidgetAnimation* Loading; // 0x278(0x08)
	struct UImage* BootScreenich; // 0x280(0x08)
	struct UImage* Image; // 0x288(0x08)
	struct UImage* Image_2; // 0x290(0x08)
	struct UImage* Image_3; // 0x298(0x08)
	struct UImage* Image_4; // 0x2a0(0x08)
	struct UImage* Image_5; // 0x2a8(0x08)
	struct UImage* Image_6; // 0x2b0(0x08)
	struct UImage* Image_7; // 0x2b8(0x08)
	struct UImage* Image_8; // 0x2c0(0x08)
	struct UImage* Image_9; // 0x2c8(0x08)
	struct UImage* Image_58; // 0x2d0(0x08)
	struct UImage* Image_92; // 0x2d8(0x08)
	struct UImage* Image_100; // 0x2e0(0x08)
	struct UImage* Image_112; // 0x2e8(0x08)
	struct UImage* Image_144; // 0x2f0(0x08)
	struct UImage* Image_273; // 0x2f8(0x08)
	struct UImage* Image_320; // 0x300(0x08)
	struct UImage* Image_353; // 0x308(0x08)
	struct UImage* Image_BG; // 0x310(0x08)
	struct UImage* Image_BG_2; // 0x318(0x08)
	struct UImage* Image_BG_3; // 0x320(0x08)
	struct UImage* Image_FirstFrame; // 0x328(0x08)
	struct UImage* Image_FirstFrame_2; // 0x330(0x08)
	struct UImage* Image_LoadBG; // 0x338(0x08)
	struct UImage* Image_Progress; // 0x340(0x08)
	struct UImage* Image_ProphuntRef; // 0x348(0x08)
	struct UProgressBar* ProgressBar_Loading; // 0x350(0x08)
	struct USafeZone* SafeZone; // 0x358(0x08)
	struct USafeZone* SafeZone_600; // 0x360(0x08)
	struct UTextBlock* TextBlock_2; // 0x368(0x08)
	struct UTextBlock* TextBlock_3; // 0x370(0x08)
	struct UTextBlock* TextBlock_4; // 0x378(0x08)
	struct UTextBlock* TextBlock_Des1; // 0x380(0x08)
	struct UTextBlock* TextBlock_Des2; // 0x388(0x08)
	struct UTextBlock* TextBlock_Des3; // 0x390(0x08)
	struct UTextBlock* TextBlock_Discription; // 0x398(0x08)
	struct UTextBlock* TextBlock_GameMode; // 0x3a0(0x08)
	struct UTextBlock* TextBlock_gameName; // 0x3a8(0x08)
	struct UTextBlock* TextBlock_MapName; // 0x3b0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_1; // 0x3b8(0x08)
	struct TMap<struct FString, struct UTexture2D*> Maps; // 0x3c0(0x50)
	bool Delete; // 0x410(0x01)
	char pad_411[0x7]; // 0x411(0x07)
	struct FText MapName; // 0x418(0x18)
	struct FText ModeName; // 0x430(0x18)
	struct FString Map; // 0x448(0x10)
	struct TArray<struct FText> Surv Tips; // 0x458(0x10)
	struct TMap<struct FString, struct UPaperSprite*> ScreenTips; // 0x468(0x50)
	struct UMaterialInstanceDynamic* ProgressMaterial; // 0x4b8(0x08)
	struct UTexture2D* Texture; // 0x4c0(0x08)
	struct UMediaPlayer* Boot; // 0x4c8(0x08)
	struct FFMODEventInstance LoadingSound; // 0x4d0(0x08)

	void SetProgress(float Progress); // Function W_LoadingScreen.W_LoadingScreen_C.SetProgress // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void StartFakeLoading(); // Function W_LoadingScreen.W_LoadingScreen_C.StartFakeLoading // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function W_LoadingScreen.W_LoadingScreen_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void Construct(); // Function W_LoadingScreen.W_LoadingScreen_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void StopLoadingMusic(); // Function W_LoadingScreen.W_LoadingScreen_C.StopLoadingMusic // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void Destruct(); // Function W_LoadingScreen.W_LoadingScreen_C.Destruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void ExecuteUbergraph_W_LoadingScreen(int32_t EntryPoint); // Function W_LoadingScreen.W_LoadingScreen_C.ExecuteUbergraph_W_LoadingScreen // (Final|UbergraphFunction|HasDefaults) // @ game+0x132e1a0
};

