// WidgetBlueprintGeneratedClass W_MainMenu.W_MainMenu_C
// Size: 0x12b3 (Inherited: 0x260)
struct UW_MainMenu_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* ShowHide_Social; // 0x268(0x08)
	struct UWidgetAnimation* FadeBlur; // 0x270(0x08)
	struct UWidgetAnimation* QuitMove_Anim; // 0x278(0x08)
	struct UWidgetAnimation* SettingsMove_Anim; // 0x280(0x08)
	struct UWidgetAnimation* TutorialMove_Anim; // 0x288(0x08)
	struct UWidgetAnimation* PlayMove_Anim; // 0x290(0x08)
	struct UWidgetAnimation* BackButton_Anim; // 0x298(0x08)
	struct UWidgetAnimation* Chat_Anim; // 0x2a0(0x08)
	struct UWidgetAnimation* ChangeSwitcherWidget_Anim; // 0x2a8(0x08)
	struct UWidgetAnimation* Logo_Anim; // 0x2b0(0x08)
	struct UWidgetAnimation* FadeIn; // 0x2b8(0x08)
	struct UWidgetAnimation* MainMenu_Appearance_Anim; // 0x2c0(0x08)
	struct UWidgetAnimation* Practice_Browser_Anim; // 0x2c8(0x08)
	struct UTextBlock* BuildNumber; // 0x2d0(0x08)
	struct UButton* Button; // 0x2d8(0x08)
	struct UButton* Button_2; // 0x2e0(0x08)
	struct UButton* Button_79; // 0x2e8(0x08)
	struct UButton* Button_198; // 0x2f0(0x08)
	struct UButton* Button_525; // 0x2f8(0x08)
	struct UButton* Button_632; // 0x300(0x08)
	struct UButton* Button_Auth; // 0x308(0x08)
	struct UButton* Button_Back; // 0x310(0x08)
	struct UButton* Button_Browser_Link; // 0x318(0x08)
	struct UButton* Button_Discord_Link; // 0x320(0x08)
	struct UButton* Button_Facebook_Link; // 0x328(0x08)
	struct UButton* Button_FG_CASTLE; // 0x330(0x08)
	struct UButton* Button_FG_FARM; // 0x338(0x08)
	struct UButton* Button_FG_HOUSE; // 0x340(0x08)
	struct UButton* Button_FG_RES; // 0x348(0x08)
	struct UButton* Button_FG_SCHOOL; // 0x350(0x08)
	struct UButton* Button_Home; // 0x358(0x08)
	struct UButton* Button_Instagram_Link; // 0x360(0x08)
	struct UButton* Button_Inventory; // 0x368(0x08)
	struct UButton* Button_Play; // 0x370(0x08)
	struct UButton* Button_QUIT; // 0x378(0x08)
	struct UButton* Button_Settings; // 0x380(0x08)
	struct UButton* Button_SUBSCRIBE; // 0x388(0x08)
	struct UButton* Button_Tutorial; // 0x390(0x08)
	struct UButton* Button_Twitter_Link; // 0x398(0x08)
	struct UCanvasPanel* CanvasPanel_MainMenu; // 0x3a0(0x08)
	struct UCanvasPanel* CanvasPanel_NewMainMenu; // 0x3a8(0x08)
	struct UChatWindow_C* ChatWindow; // 0x3b0(0x08)
	struct UButton* ClearPerkButton; // 0x3b8(0x08)
	struct UButton* CreateServer; // 0x3c0(0x08)
	struct UHorizontalBox* HorizontalBox_Social; // 0x3c8(0x08)
	struct UImage* Image; // 0x3d0(0x08)
	struct UImage* Image_2; // 0x3d8(0x08)
	struct UImage* Image_88; // 0x3e0(0x08)
	struct UImage* Image_100; // 0x3e8(0x08)
	struct UImage* Image_114; // 0x3f0(0x08)
	struct UImage* Image_136; // 0x3f8(0x08)
	struct UImage* Image_284; // 0x400(0x08)
	struct UImage* Image_421; // 0x408(0x08)
	struct UImage* Image_423; // 0x410(0x08)
	struct UImage* Image_905; // 0x418(0x08)
	struct UImage* Image_Background; // 0x420(0x08)
	struct UImage* Image_BackIcon; // 0x428(0x08)
	struct UImage* Image_BG; // 0x430(0x08)
	struct UImage* Image_ButtonPlayHovered; // 0x438(0x08)
	struct UImage* Image_ButtonQuitHovered; // 0x440(0x08)
	struct UImage* Image_ButtonSettingsHovered; // 0x448(0x08)
	struct UImage* Image_ButtonTutorialHovered; // 0x450(0x08)
	struct UImage* Image_HomeHover; // 0x458(0x08)
	struct UImage* Image_InventoryGlow; // 0x460(0x08)
	struct UImage* Image_Logo; // 0x468(0x08)
	struct UImage* Image_MainMenu; // 0x470(0x08)
	struct UImage* Image_PlayGlow; // 0x478(0x08)
	struct UImage* Image_QuitHover; // 0x480(0x08)
	struct UImage* Image_SettingGlow; // 0x488(0x08)
	struct UButton* KillerPerkButton; // 0x490(0x08)
	struct UOverlay* Overlay_RedLine; // 0x498(0x08)
	struct UButton* Perk1; // 0x4a0(0x08)
	struct UTextBlock* Perk1Name; // 0x4a8(0x08)
	struct UButton* Perk2; // 0x4b0(0x08)
	struct UTextBlock* Perk2Name; // 0x4b8(0x08)
	struct UButton* Perk3; // 0x4c0(0x08)
	struct UTextBlock* Perk3Name; // 0x4c8(0x08)
	struct UTextBlock* PerkDesc; // 0x4d0(0x08)
	struct UHorizontalBox* PerkList; // 0x4d8(0x08)
	struct UTextBlock* PerkName; // 0x4e0(0x08)
	struct UOverlay* PerkWindow; // 0x4e8(0x08)
	struct UHorizontalBox* PlayerType; // 0x4f0(0x08)
	struct UProgressBar* ProgressBar_KB; // 0x4f8(0x08)
	struct UProgressBar* ProgressBar_Mouse; // 0x500(0x08)
	struct UButton* RefreshButton; // 0x508(0x08)
	struct UButton* RefreshV2Button; // 0x510(0x08)
	struct UButton* ServerButton; // 0x518(0x08)
	struct UListView* ServerList; // 0x520(0x08)
	struct USizeBox* SizeBox_BackButton; // 0x528(0x08)
	struct USizeBox* SizeBox_Buttons; // 0x530(0x08)
	struct USizeBox* SizeBox_TopMenu; // 0x538(0x08)
	struct UComboBoxString* SMap; // 0x540(0x08)
	struct UComboBoxString* SMode; // 0x548(0x08)
	struct UButton* SurvPerkButton; // 0x550(0x08)
	struct UHorizontalBox* TestSkinHBox; // 0x558(0x08)
	struct UVerticalBox* TestSkinVBox; // 0x560(0x08)
	struct UTextBlock* Text_Logo; // 0x568(0x08)
	struct UTextBlock* TextBlock_BackButton; // 0x570(0x08)
	struct UTextBlock* TextBlock_FG_RESIDNC; // 0x578(0x08)
	struct UTextBlock* TextBlock_FGCASTLE; // 0x580(0x08)
	struct UTextBlock* TextBlock_FGCASTLE_2; // 0x588(0x08)
	struct UTextBlock* TextBlock_FGFARM; // 0x590(0x08)
	struct UTextBlock* TextBlock_FGHouse; // 0x598(0x08)
	struct UTextBlock* TextBlock_FGSCHOOL; // 0x5a0(0x08)
	struct UTextBlock* TextBlock_Follow; // 0x5a8(0x08)
	struct UTextBlock* TextBlock_Inventory; // 0x5b0(0x08)
	struct UTextBlock* TextBlock_Play; // 0x5b8(0x08)
	struct UTextBlock* TextBlock_PrivateServer; // 0x5c0(0x08)
	struct UTextBlock* TextBlock_Quit; // 0x5c8(0x08)
	struct UTextBlock* TextBlock_Settings; // 0x5d0(0x08)
	struct UTextBlock* TextBlock_Subscribe; // 0x5d8(0x08)
	struct UTextBlock* TextBlock_Tutorial; // 0x5e0(0x08)
	struct UW_PlayScreen_C* W_PlayScreen; // 0x5e8(0x08)
	struct UW_PressAnyKeyScreen_C* W_PressAnyKeyScreen; // 0x5f0(0x08)
	struct UWBP_ButtonBar_C* WBP_ButtonBar; // 0x5f8(0x08)
	struct UWBP_PracticeBar_C* WBP_PracticeBar; // 0x600(0x08)
	struct UWBP_QuickSearch_C* WBP_QuickSearch; // 0x608(0x08)
	struct UWBP_QuitDialog_C* WBP_QuitDialog; // 0x610(0x08)
	struct UWBP_ServerMessage_C* WBP_ServerMessage; // 0x618(0x08)
	struct UWBP_SocialUI_C* WBP_SocialUI; // 0x620(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_MainMenu; // 0x628(0x08)
	int32_t NumberOfSessions; // 0x630(0x04)
	char pad_634[0x4]; // 0x634(0x04)
	struct TArray<struct FBlueprintSessionResult> Sessions; // 0x638(0x10)
	int32_t MinPing; // 0x648(0x04)
	char pad_64C[0x4]; // 0x64c(0x04)
	struct FBlueprintSessionResult AvialableSession; // 0x650(0x108)
	bool Found?; // 0x758(0x01)
	char pad_759[0x3]; // 0x759(0x03)
	int32_t MaxPlayers; // 0x75c(0x04)
	struct FName HostLevel; // 0x760(0x08)
	struct UGI_Prophunt_C* GI; // 0x768(0x08)
	int32_t ServPing; // 0x770(0x04)
	bool SettingsOpen?; // 0x774(0x01)
	bool SearchingOpen?; // 0x775(0x01)
	char pad_776[0x2]; // 0x776(0x02)
	int32_t int; // 0x778(0x04)
	char pad_77C[0x4]; // 0x77c(0x04)
	struct TArray<struct UTexture2D*> arrayImg; // 0x780(0x10)
	struct TArray<struct FString> arrayName; // 0x790(0x10)
	struct FFMODEventInstance MainMenuSound; // 0x7a0(0x08)
	bool MenuSoundStarted?; // 0x7a8(0x01)
	char pad_7A9[0x7]; // 0x7a9(0x07)
	struct UButton* LastKnowButton; // 0x7b0(0x08)
	struct FButtonStyle FocusedStyleButton; // 0x7b8(0x278)
	struct FButtonStyle UnFocusedStyleButton; // 0xa30(0x278)
	bool SettingButtonIsHover?; // 0xca8(0x01)
	char pad_CA9[0x7]; // 0xca9(0x07)
	struct TArray<struct UButton*> ButtonsArray; // 0xcb0(0x10)
	struct TArray<struct UObject*> ImgNormalArray; // 0xcc0(0x10)
	struct TArray<struct UObject*> ImgHoverArray; // 0xcd0(0x10)
	struct TArray<struct UObject*> ImgPressedArray; // 0xce0(0x10)
	int32_t ButtonsIndex; // 0xcf0(0x04)
	struct FVector2D ButtonImageSize_Normal; // 0xcf4(0x08)
	struct FVector2D ButtonImageSize_Hovered; // 0xcfc(0x08)
	struct FVector2D ButtonImageSizePressed; // 0xd04(0x08)
	char pad_D0C[0x4]; // 0xd0c(0x04)
	struct TArray<struct UButton*> Buttons_LinksArray; // 0xd10(0x10)
	struct TArray<struct UTextBlock*> TextBlockArray; // 0xd20(0x10)
	struct TArray<struct UObject*> ImgPressedLinksArray; // 0xd30(0x10)
	struct TArray<struct UObject*> ImgNormalLinksArray; // 0xd40(0x10)
	struct TArray<struct UObject*> ImgHoverLinksArray; // 0xd50(0x10)
	struct FVector2D ButtonImageSize_Links; // 0xd60(0x08)
	bool BlockButtonIsHover?; // 0xd68(0x01)
	char pad_D69[0x3]; // 0xd69(0x03)
	int32_t SkinID; // 0xd6c(0x04)
	int32_t KillersCount; // 0xd70(0x04)
	int32_t SurvCount; // 0xd74(0x04)
	struct TArray<struct UBP_SessionData_C*> SessionList; // 0xd78(0x10)
	bool IsInventoryButtonHovered?; // 0xd88(0x01)
	bool IsPlayButtonHovered?; // 0xd89(0x01)
	bool IsPracticeButtonPressed?; // 0xd8a(0x01)
	char pad_D8B[0x5]; // 0xd8b(0x05)
	struct UButton* HoveredButton; // 0xd90(0x08)
	bool IsBackButtonHovered; // 0xd98(0x01)
	char pad_D99[0x3]; // 0xd99(0x03)
	int32_t PerkNumber; // 0xd9c(0x04)
	bool SurvPerk?; // 0xda0(0x01)
	char pad_DA1[0x7]; // 0xda1(0x07)
	struct FText Last Text Name S; // 0xda8(0x18)
	struct FText Last Text Desc S; // 0xdc0(0x18)
	struct FText Last Text Name K; // 0xdd8(0x18)
	struct FText Last Text Desc K; // 0xdf0(0x18)
	struct FSlateBrush In Style Hovered; // 0xe08(0x88)
	struct FSlateBrush In Style Normal; // 0xe90(0x88)
	struct FSlateBrush In Style Normal_1; // 0xf18(0x88)
	struct FSlateBrush In Style Hovered_1; // 0xfa0(0x88)
	struct TMap<struct UButton*, struct UWidgetAnimation*> ButtonAnimsMap; // 0x1028(0x50)
	bool IsButtonsUnpressible; // 0x1078(0x01)
	char pad_1079[0x3]; // 0x1079(0x03)
	float SliderValueFocus; // 0x107c(0x04)
	float SliderValueFocus_KB; // 0x1080(0x04)
	char pad_1084[0x4]; // 0x1084(0x04)
	struct FSlateBrush In Style Normal_2; // 0x1088(0x88)
	struct FSlateBrush In Style Normal_3; // 0x1110(0x88)
	struct FSlateBrush In Style Normal_4; // 0x1198(0x88)
	struct FSlateBrush In Style Normal_5; // 0x1220(0x88)
	struct UW_PlayScreen_C* Target; // 0x12a8(0x08)
	enum class SurvChars Char; // 0x12b0(0x01)
	bool IsMenuReady; // 0x12b1(0x01)
	bool IsTutorialBlocked; // 0x12b2(0x01)

	void BlockTutotialButton(bool Block); // Function W_MainMenu.W_MainMenu_C.BlockTutotialButton // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void MouseFocus?(bool Result); // Function W_MainMenu.W_MainMenu_C.MouseFocus? // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void Get Anim(struct UButton* Button, struct UWidgetAnimation* Anim); // Function W_MainMenu.W_MainMenu_C.Get Anim // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void PrintError(struct FString Text); // Function W_MainMenu.W_MainMenu_C.PrintError // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	struct FText Get_LVL_Text_1(); // Function W_MainMenu.W_MainMenu_C.Get_LVL_Text_1 // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
