// WidgetBlueprintGeneratedClass W_MiniLobby.W_MiniLobby_C
// Size: 0x912 (Inherited: 0x260)
struct UW_MiniLobby_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* ClickedReady_3; // 0x268(0x08)
	struct UWidgetAnimation* ButtonReadyAnimWHITE_3; // 0x270(0x08)
	struct UWidgetAnimation* ButtonReadyAnimRED_3; // 0x278(0x08)
	struct UWidgetAnimation* ButtonReadyAnimWHITE; // 0x280(0x08)
	struct UWidgetAnimation* PrivateButtonAnim; // 0x288(0x08)
	struct UWidgetAnimation* ShowReady; // 0x290(0x08)
	struct UWidgetAnimation* HideStart; // 0x298(0x08)
	struct UWidgetAnimation* ClickedReady; // 0x2a0(0x08)
	struct UWidgetAnimation* ButtonReadyAnimRED; // 0x2a8(0x08)
	struct UWidgetAnimation* ButtonConfirmAnim; // 0x2b0(0x08)
	struct UWidgetAnimation* ButtonStartAnim; // 0x2b8(0x08)
	struct UBackgroundBlur* BackgroundBlur_Timer_Middle; // 0x2c0(0x08)
	struct UButton* Button_139; // 0x2c8(0x08)
	struct UButton* Button_208; // 0x2d0(0x08)
	struct UButton* Button_352; // 0x2d8(0x08)
	struct UButton* Button_KillerBoost; // 0x2e0(0x08)
	struct UButton* Button_start; // 0x2e8(0x08)
	struct UButton* Button_SurvBoost; // 0x2f0(0x08)
	struct UButton* ButtonCont; // 0x2f8(0x08)
	struct UTextBlock* ButtonTextBlock; // 0x300(0x08)
	struct UCanvasPanel* CanvasPanel_1; // 0x308(0x08)
	struct UCanvasPanel* CanvasPlayers; // 0x310(0x08)
	struct UComboBoxString* ComboBoxString_1; // 0x318(0x08)
	struct UComboBoxString* ComboBoxString_154; // 0x320(0x08)
	struct UScrollBox* FriendsScroll; // 0x328(0x08)
	struct UVerticalBox* FriendsVB; // 0x330(0x08)
	struct UTextBlock* Gsi; // 0x338(0x08)
	struct UTextBlock* Gsi_2; // 0x340(0x08)
	struct UHorizontalBox* HorizontalBox_InviteCode; // 0x348(0x08)
	struct UHorizontalBox* HorizontalBox_SkillButton; // 0x350(0x08)
	struct UImage* Image; // 0x358(0x08)
	struct UImage* Image_2; // 0x360(0x08)
	struct UImage* Image_3; // 0x368(0x08)
	struct UImage* Image_4; // 0x370(0x08)
	struct UImage* Image_5; // 0x378(0x08)
	struct UImage* Image_6; // 0x380(0x08)
	struct UImage* Image_7; // 0x388(0x08)
	struct UImage* Image_64; // 0x390(0x08)
	struct UImage* Image_69; // 0x398(0x08)
	struct UImage* Image_73; // 0x3a0(0x08)
	struct UImage* Image_112; // 0x3a8(0x08)
	struct UImage* Image_119; // 0x3b0(0x08)
	struct UImage* Image_130; // 0x3b8(0x08)
	struct UImage* Image_137; // 0x3c0(0x08)
	struct UImage* Image_139; // 0x3c8(0x08)
	struct UImage* Image_155; // 0x3d0(0x08)
	struct UImage* Image_328; // 0x3d8(0x08)
	struct UImage* Image_403; // 0x3e0(0x08)
	struct UImage* Image_531; // 0x3e8(0x08)
	struct UImage* Image_599; // 0x3f0(0x08)
	struct UImage* Image_711; // 0x3f8(0x08)
	struct UImage* Image_2Start; // 0x400(0x08)
	struct UImage* Image_396C; // 0x408(0x08)
	struct UImage* Image_3Start; // 0x410(0x08)
	struct UImage* Image_494C; // 0x418(0x08)
	struct UImage* Image_BGBoostPick; // 0x420(0x08)
	struct UImage* Image_BGBoostSurv; // 0x428(0x08)
	struct UImage* Image_ready; // 0x430(0x08)
	struct UImage* Image_SS; // 0x438(0x08)
	struct UImage* Image_SS_VerticalPick; // 0x440(0x08)
	struct UImage* Image_start; // 0x448(0x08)
	struct UImage* ImageK; // 0x450(0x08)
	struct UImage* images; // 0x458(0x08)
	struct UTextBlock* ItemDesc; // 0x460(0x08)
	struct UTextBlock* ItemDesc_2; // 0x468(0x08)
	struct UTextBlock* ItemDesc_3; // 0x470(0x08)
	struct UImage* ItemIcon; // 0x478(0x08)
	struct UImage* ItemIcon_BoostKiller; // 0x480(0x08)
	struct UImage* ItemIcon_BoostSurv; // 0x488(0x08)
	struct UTextBlock* ItemName; // 0x490(0x08)
	struct UTextBlock* ItemName_2; // 0x498(0x08)
	struct UTextBlock* ItemName_3; // 0x4a0(0x08)
	struct UHorizontalBox* KillerBox; // 0x4a8(0x08)
	struct UTextBlock* KillerName; // 0x4b0(0x08)
	struct UUniformGridPanel* KillerTypes; // 0x4b8(0x08)
	struct UCanvasPanel* LobbyCanvas; // 0x4c0(0x08)
	struct UTextBlock* Location; // 0x4c8(0x08)
	struct UTextBlock* LocationName; // 0x4d0(0x08)
	struct UTextBlock* MapName; // 0x4d8(0x08)
	struct UOverlay* Overlay_386; // 0x4e0(0x08)
	struct UOverlay* Overlay_107_Practice; // 0x4e8(0x08)
	struct UOverlay* Overlay_Text_Classic; // 0x4f0(0x08)
	struct UOverlay* Overlay_Time; // 0x4f8(0x08)
	struct UTextBlock* PrivateKey_2; // 0x500(0x08)
	struct UTextBlock* ProfessionDesc; // 0x508(0x08)
	struct UTextBlock* ProfessionName; // 0x510(0x08)
	struct UOverlay* prophunt_classic; // 0x518(0x08)
	struct UHorizontalBox* ProphuntHorizontalBox; // 0x520(0x08)
	struct UVerticalBox* ProphuntVerticalBox; // 0x528(0x08)
	struct UTextBlock* ReadyText; // 0x530(0x08)
	struct UButton* RefreshList; // 0x538(0x08)
	struct UImage* RenderTexture; // 0x540(0x08)
	struct UImage* sample; // 0x548(0x08)
	struct UTextBlock* ServerName; // 0x550(0x08)
	struct USizeBox* SizeBox_4; // 0x558(0x08)
	struct USizeBox* SizeBox_115; // 0x560(0x08)
	struct USizeBox* SizeBox_Booster; // 0x568(0x08)
	struct USizeBox* SizeBox_ct; // 0x570(0x08)
	struct USizeBox* SizeBox_Item; // 0x578(0x08)
	struct USizeBox* SizeBox_KillerBoost; // 0x580(0x08)
	struct USizeBox* SizeBox_Prop; // 0x588(0x08)
	struct USizeBox* SizeBox_Ready; // 0x590(0x08)
	struct USizeBox* SizeBox_Skill; // 0x598(0x08)
	struct USizeBox* SizeBox_st; // 0x5a0(0x08)
	struct USizeBox* SizeBox_SurvBoost; // 0x5a8(0x08)
	struct USizeBox* SizeBox_TestMode; // 0x5b0(0x08)
	struct USizeBox* SizeBox_Waiting_players; // 0x5b8(0x08)
	struct UW_KillerInfo2_C* Skill1; // 0x5c0(0x08)
	struct UW_KillerInfo2_C* Skill2; // 0x5c8(0x08)
	struct UW_KillerInfo2_C* Skill3; // 0x5d0(0x08)
	struct UTextBlock* SkillDesc_2; // 0x5d8(0x08)
	struct UImage* SkillIcon_2; // 0x5e0(0x08)
	struct UTextBlock* SkillName_2; // 0x5e8(0x08)
	struct UUniformGridPanel* SlotsBox; // 0x5f0(0x08)
	struct UUniformGridPanel* SlotsBox_2; // 0x5f8(0x08)
	struct UVerticalBox* SlotsBox_Kil_2; // 0x600(0x08)
	struct USpacer* SpacerKiller; // 0x608(0x08)
	struct USpacer* SpacerProphunt; // 0x610(0x08)
	struct USpacer* SpacerSurv; // 0x618(0x08)
	struct UHorizontalBox* steamAvatar; // 0x620(0x08)
	struct UHorizontalBox* SurvBox; // 0x628(0x08)
	struct UTextBlock* SurvName_2; // 0x630(0x08)
	struct UUniformGridPanel* SurvProfessions; // 0x638(0x08)
	struct UTextBlock* Text; // 0x640(0x08)
	struct UTextBlock* Text_2; // 0x648(0x08)
	struct UTextBlock* TextBlock_2; // 0x650(0x08)
	struct UTextBlock* TextBlock_193; // 0x658(0x08)
	struct UUniformGridPanel* UniformGridPanel_28PH; // 0x660(0x08)
	struct UVerticalBox* VBoxFriendsList; // 0x668(0x08)
	struct UVerticalBox* VerticalBox_340; // 0x670(0x08)
	struct UW_Lobby_WaitPlayers_C* W_Lobby_WaitPlayers; // 0x678(0x08)
	struct UWBP_SkinSelector_C* WBP_SkinSelector; // 0x680(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_1; // 0x688(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_2; // 0x690(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_INFO_KILLER_SURV; // 0x698(0x08)
	bool IsCanceled; // 0x6a0(0x01)
	char pad_6A1[0x3]; // 0x6a1(0x03)
	int32_t Row; // 0x6a4(0x04)
	int32_t Column; // 0x6a8(0x04)
	char pad_6AC[0x4]; // 0x6ac(0x04)
	struct TArray<struct UW_LobbySurv_C*> SurvProfessionsButtons; // 0x6b0(0x10)
	struct TArray<struct UW_LobbyKiller_C*> KillerTypeButtons; // 0x6c0(0x10)
	struct FFMODEventInstance LobbyMusic; // 0x6d0(0x08)
	float Volume; // 0x6d8(0x04)
	bool Ready?; // 0x6dc(0x01)
	char pad_6DD[0x3]; // 0x6dd(0x03)
	struct TArray<struct UW_LobbySurv_C*> SurvSkillsButtons; // 0x6e0(0x10)
	bool IsSlotsCreated; // 0x6f0(0x01)
	char pad_6F1[0x7]; // 0x6f1(0x07)
	struct TMap<struct FString, struct UWidget*> SlotsMap; // 0x6f8(0x50)
	int32_t TotalPlayers; // 0x748(0x04)
	char pad_74C[0x4]; // 0x74c(0x04)
	struct AMiniLobbyPawn_C* MiniLobbyPawn; // 0x750(0x08)
	struct FS_GameSettings gmset; // 0x758(0x20)
	int32_t Colum; // 0x778(0x04)
	char pad_77C[0x4]; // 0x77c(0x04)
	struct UW_SlotM_C* ResultM; // 0x780(0x08)
	int32_t LobbyStartTime; // 0x788(0x04)
	bool ReadyBlock?; // 0x78c(0x01)
	bool IsMapNameSet; // 0x78d(0x01)
	char pad_78E[0x2]; // 0x78e(0x02)
	struct UW_BoosterInventory_C* W_BoosterInventory; // 0x790(0x08)
	struct FSlateBrush In Brush Boost Killer 0; // 0x798(0x88)
	struct FSlateBrush In Brush Boost Killer 1; // 0x820(0x88)
	struct TArray<struct UW_Slot_C*> W_Slots; // 0x8a8(0x10)
	struct TArray<struct UW_SlotM_C*> W_SlotsM; // 0x8b8(0x10)
	bool IsAllSlotsBusy?; // 0x8c8(0x01)
	char pad_8C9[0x7]; // 0x8c9(0x07)
	struct FString PKey; // 0x8d0(0x10)
	bool IsHover; // 0x8e0(0x01)
	char pad_8E1[0x7]; // 0x8e1(0x07)
	struct TArray<enum class KillerType> KillersOrder; // 0x8e8(0x10)
	struct TArray<int32_t> SlotsOrder; // 0x8f8(0x10)
	struct UWidget* HoverFocus; // 0x908(0x08)
	bool PrevIsKiller; // 0x910(0x01)
	bool CurIsKiller; // 0x911(0x01)

	void IsProphunt(bool IsProphunt); // Function W_MiniLobby.W_MiniLobby_C.IsProphunt // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void GetSurvivorsCount(int32_t Result); // Function W_MiniLobby.W_MiniLobby_C.GetSurvivorsCount // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void GetSlotCountByName(struct FString Name, int32_t Result); // Function W_MiniLobby.W_MiniLobby_C.GetSlotCountByName // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void GetKillersCount(int32_t Result); // Function W_MiniLobby.W_MiniLobby_C.GetKillersCount // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void GetSlotByName(struct FString Name, struct UW_Slot_C* Slot, struct UW_SlotM_C* SlotM); // Function W_MiniLobby.W_MiniLobby_C.GetSlotByName // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void Construct(); // Function W_MiniLobby.W_MiniLobby_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function W_MiniLobby.W_MiniLobby_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void UpdateLobbyState(); // Function W_MiniLobby.W_MiniLobby_C.UpdateLobbyState // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__Button_207_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__Button_207_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void UpdateServerInfo(struct FString MapName, bool Public); // Function W_MiniLobby.W_MiniLobby_C.UpdateServerInfo // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__RefreshList_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__RefreshList_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void StartGameAttempt(); // Function W_MiniLobby.W_MiniLobby_C.StartGameAttempt // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void Cancel(); // Function W_MiniLobby.W_MiniLobby_C.Cancel // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void CreateButtons(bool Killer?); // Function W_MiniLobby.W_MiniLobby_C.CreateButtons // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void CreateSurvButtons(bool Propnight?); // Function W_MiniLobby.W_MiniLobby_C.CreateSurvButtons // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void CreateKillerButtons(bool Propnight?); // Function W_MiniLobby.W_MiniLobby_C.CreateKillerButtons // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__Button_207_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__Button_207_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__Button_207_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__Button_207_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void KillerChange(enum class KillerType KillerType); // Function W_MiniLobby.W_MiniLobby_C.KillerChange // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void SurvChange(enum class SurvChars Char); // Function W_MiniLobby.W_MiniLobby_C.SurvChange // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void CreateSurvSkillsButtons(); // Function W_MiniLobby.W_MiniLobby_C.CreateSurvSkillsButtons // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void SurvSkillChange(enum class SurvSkills SurvSkill); // Function W_MiniLobby.W_MiniLobby_C.SurvSkillChange // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__ComboBoxString_0_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature(struct FString SelectedItem, enum class ESelectInfo SelectionType); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__ComboBoxString_0_K2Node_ComponentBoundEvent_5_OnSelectionChangedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void CreateSlots(); // Function W_MiniLobby.W_MiniLobby_C.CreateSlots // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void ClearButtons(); // Function W_MiniLobby.W_MiniLobby_C.ClearButtons // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__Button_25_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__Button_25_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void HideSwap(); // Function W_MiniLobby.W_MiniLobby_C.HideSwap // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void StartGameButton(); // Function W_MiniLobby.W_MiniLobby_C.StartGameButton // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__Button_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__Button_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void ReadyCustom(); // Function W_MiniLobby.W_MiniLobby_C.ReadyCustom // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void PlayMusicCustom(); // Function W_MiniLobby.W_MiniLobby_C.PlayMusicCustom // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void ButtonSwitch(bool On?); // Function W_MiniLobby.W_MiniLobby_C.ButtonSwitch // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__Button_272_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__Button_272_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__Button_KillerBoost_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__Button_KillerBoost_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void HideBoosterWidget(bool isKillerSlot?); // Function W_MiniLobby.W_MiniLobby_C.HideBoosterWidget // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void W8Slots(); // Function W_MiniLobby.W_MiniLobby_C.W8Slots // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void ResetSwaps(); // Function W_MiniLobby.W_MiniLobby_C.ResetSwaps // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_MiniLobby_ButtonCont_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__W_MiniLobby_ButtonCont_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_MiniLobby_ButtonCont_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__W_MiniLobby_ButtonCont_K2Node_ComponentBoundEvent_10_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_MiniLobby_ButtonCont_K2Node_ComponentBoundEvent_11_OnButtonPressedEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__W_MiniLobby_ButtonCont_K2Node_ComponentBoundEvent_11_OnButtonPressedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_MiniLobby_Button_351_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__W_MiniLobby_Button_351_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_MiniLobby_Button_351_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__W_MiniLobby_Button_351_K2Node_ComponentBoundEvent_13_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_MiniLobby_Button_351_K2Node_ComponentBoundEvent_14_OnButtonHoverEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__W_MiniLobby_Button_351_K2Node_ComponentBoundEvent_14_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_MiniLobby_Button_start_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__W_MiniLobby_Button_start_K2Node_ComponentBoundEvent_15_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_MiniLobby_Button_start_K2Node_ComponentBoundEvent_16_OnButtonHoverEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__W_MiniLobby_Button_start_K2Node_ComponentBoundEvent_16_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_MiniLobby_Button_207_K2Node_ComponentBoundEvent_17_OnButtonHoverEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__W_MiniLobby_Button_207_K2Node_ComponentBoundEvent_17_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void BndEvt__W_MiniLobby_Button_207_K2Node_ComponentBoundEvent_18_OnButtonHoverEvent__DelegateSignature(); // Function W_MiniLobby.W_MiniLobby_C.BndEvt__W_MiniLobby_Button_207_K2Node_ComponentBoundEvent_18_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x132e1a0
	void UpdateLobbyTime(); // Function W_MiniLobby.W_MiniLobby_C.UpdateLobbyTime // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void PreConstruct(bool IsDesignTime); // Function W_MiniLobby.W_MiniLobby_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void ClearSwap_LeaveFromServer(struct APawn* LeftPlayer); // Function W_MiniLobby.W_MiniLobby_C.ClearSwap_LeaveFromServer // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void LosesFocusWidget(); // Function W_MiniLobby.W_MiniLobby_C.LosesFocusWidget // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void HoverFocusButton(); // Function W_MiniLobby.W_MiniLobby_C.HoverFocusButton // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void ExecuteUbergraph_W_MiniLobby(int32_t EntryPoint); // Function W_MiniLobby.W_MiniLobby_C.ExecuteUbergraph_W_MiniLobby // (Final|UbergraphFunction|HasDefaults) // @ game+0x132e1a0
};

