// WidgetBlueprintGeneratedClass W_MiniLobby_Role.W_MiniLobby_Role_C
// Size: 0x5a0 (Inherited: 0x260)
struct UW_MiniLobby_Role_C : UUserWidget {
	struct UImage* Image; // 0x260(0x08)
	struct UImage* Image_2; // 0x268(0x08)
	struct UImage* Image_3; // 0x270(0x08)
	struct UImage* Image_4; // 0x278(0x08)
	struct UImage* Image_5; // 0x280(0x08)
	struct UImage* Image_6; // 0x288(0x08)
	struct UImage* Image_7; // 0x290(0x08)
	struct UImage* Image_8; // 0x298(0x08)
	struct UImage* Image_9; // 0x2a0(0x08)
	struct UImage* Image_10; // 0x2a8(0x08)
	struct UImage* Image_11; // 0x2b0(0x08)
	struct UImage* Image_12; // 0x2b8(0x08)
	struct UImage* Image_13; // 0x2c0(0x08)
	struct UImage* Image_14; // 0x2c8(0x08)
	struct UImage* Image_15; // 0x2d0(0x08)
	struct UImage* Image_16; // 0x2d8(0x08)
	struct UImage* Image_17; // 0x2e0(0x08)
	struct UImage* Image_18; // 0x2e8(0x08)
	struct UImage* Image_19; // 0x2f0(0x08)
	struct UImage* Image_20; // 0x2f8(0x08)
	struct UImage* Image_21; // 0x300(0x08)
	struct UImage* Image_22; // 0x308(0x08)
	struct UImage* Image_23; // 0x310(0x08)
	struct UImage* Image_24; // 0x318(0x08)
	struct UImage* Image_25; // 0x320(0x08)
	struct UImage* Image_26; // 0x328(0x08)
	struct UImage* Image_27; // 0x330(0x08)
	struct UImage* Image_28; // 0x338(0x08)
	struct UImage* Image_29; // 0x340(0x08)
	struct UImage* Image_30; // 0x348(0x08)
	struct UImage* Image_31; // 0x350(0x08)
	struct UImage* Image_32; // 0x358(0x08)
	struct UImage* Image_33; // 0x360(0x08)
	struct UImage* Image_34; // 0x368(0x08)
	struct UImage* Image_35; // 0x370(0x08)
	struct UImage* Image_36; // 0x378(0x08)
	struct UImage* Image_37; // 0x380(0x08)
	struct UImage* Image_38; // 0x388(0x08)
	struct UImage* Image_39; // 0x390(0x08)
	struct UImage* Image_40; // 0x398(0x08)
	struct UImage* Image_41; // 0x3a0(0x08)
	struct UImage* Image_42; // 0x3a8(0x08)
	struct UImage* Image_43; // 0x3b0(0x08)
	struct UImage* Image_44; // 0x3b8(0x08)
	struct UImage* Image_45; // 0x3c0(0x08)
	struct UImage* Image_46; // 0x3c8(0x08)
	struct UImage* Image_47; // 0x3d0(0x08)
	struct UImage* Image_48; // 0x3d8(0x08)
	struct UImage* Image_49; // 0x3e0(0x08)
	struct UImage* Image_50; // 0x3e8(0x08)
	struct UImage* Image_51; // 0x3f0(0x08)
	struct UImage* Image_52; // 0x3f8(0x08)
	struct UImage* Image_53; // 0x400(0x08)
	struct UImage* Image_54; // 0x408(0x08)
	struct UImage* Image_55; // 0x410(0x08)
	struct UImage* Image_56; // 0x418(0x08)
	struct UImage* Image_57; // 0x420(0x08)
	struct UImage* Image_58; // 0x428(0x08)
	struct UImage* Image_59; // 0x430(0x08)
	struct UImage* Image_60; // 0x438(0x08)
	struct UImage* Image_61; // 0x440(0x08)
	struct UImage* Image_62; // 0x448(0x08)
	struct UImage* Image_63; // 0x450(0x08)
	struct UImage* Image_64; // 0x458(0x08)
	struct UImage* Image_65; // 0x460(0x08)
	struct UImage* Image_66; // 0x468(0x08)
	struct UImage* Image_67; // 0x470(0x08)
	struct UImage* Image_68; // 0x478(0x08)
	struct UImage* Image_69; // 0x480(0x08)
	struct UImage* Image_70; // 0x488(0x08)
	struct UImage* Image_71; // 0x490(0x08)
	struct UImage* Image_72; // 0x498(0x08)
	struct UImage* Image_73; // 0x4a0(0x08)
	struct UImage* Image_74; // 0x4a8(0x08)
	struct UImage* Image_75; // 0x4b0(0x08)
	struct UImage* Image_76; // 0x4b8(0x08)
	struct UImage* Image_77; // 0x4c0(0x08)
	struct UImage* Image_78; // 0x4c8(0x08)
	struct UImage* Image_79; // 0x4d0(0x08)
	struct UImage* Image_80; // 0x4d8(0x08)
	struct UImage* Image_81; // 0x4e0(0x08)
	struct UImage* Image_82; // 0x4e8(0x08)
	struct UImage* Image_83; // 0x4f0(0x08)
	struct UImage* Image_84; // 0x4f8(0x08)
	struct UImage* Image_85; // 0x500(0x08)
	struct UImage* Image_86; // 0x508(0x08)
	struct UImage* Image_87; // 0x510(0x08)
	struct UImage* Image_88; // 0x518(0x08)
	struct UImage* Image_89; // 0x520(0x08)
	struct UImage* Image_90; // 0x528(0x08)
	struct UImage* Image_91; // 0x530(0x08)
	struct UImage* Image_92; // 0x538(0x08)
	struct UImage* Image_93; // 0x540(0x08)
	struct UImage* Image_94; // 0x548(0x08)
	struct UImage* Image_95; // 0x550(0x08)
	struct UImage* Image_96; // 0x558(0x08)
	struct UImage* Image_97; // 0x560(0x08)
	struct UImage* Image_98; // 0x568(0x08)
	struct UImage* Image_99; // 0x570(0x08)
	struct UImage* Image_100; // 0x578(0x08)
	struct UImage* Image_113; // 0x580(0x08)
	struct UImage* Image_412; // 0x588(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_BG; // 0x590(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Role; // 0x598(0x08)
};

