// WidgetBlueprintGeneratedClass W_Tutorial_Quest.W_Tutorial_Quest_C
// Size: 0x98c (Inherited: 0x260)
struct UW_Tutorial_Quest_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x260(0x08)
	struct UWidgetAnimation* FadeOut; // 0x268(0x08)
	struct UBackgroundBlur* BackgroundBlur_1; // 0x270(0x08)
	struct UCanvasPanel* CanvasPanel_Main; // 0x278(0x08)
	struct UImage* Image; // 0x280(0x08)
	struct UImage* Image_2; // 0x288(0x08)
	struct UImage* Image_3; // 0x290(0x08)
	struct UImage* Image_4; // 0x298(0x08)
	struct UImage* Image_5; // 0x2a0(0x08)
	struct UImage* Image_6; // 0x2a8(0x08)
	struct UImage* Image_7; // 0x2b0(0x08)
	struct UImage* Image_8; // 0x2b8(0x08)
	struct UImage* Image_9; // 0x2c0(0x08)
	struct UImage* Image_10; // 0x2c8(0x08)
	struct UImage* Image_11; // 0x2d0(0x08)
	struct UImage* Image_12; // 0x2d8(0x08)
	struct UImage* Image_13; // 0x2e0(0x08)
	struct UImage* Image_14; // 0x2e8(0x08)
	struct UImage* Image_15; // 0x2f0(0x08)
	struct UImage* Image_16; // 0x2f8(0x08)
	struct UImage* Image_17; // 0x300(0x08)
	struct UImage* Image_18; // 0x308(0x08)
	struct UImage* Image_19; // 0x310(0x08)
	struct UImage* Image_20; // 0x318(0x08)
	struct UImage* Image_23; // 0x320(0x08)
	struct UImage* Image_24; // 0x328(0x08)
	struct UImage* Image_25; // 0x330(0x08)
	struct UImage* Image_26; // 0x338(0x08)
	struct UImage* Image_27; // 0x340(0x08)
	struct UImage* Image_28; // 0x348(0x08)
	struct UImage* Image_29; // 0x350(0x08)
	struct UImage* Image_30; // 0x358(0x08)
	struct UImage* Image_31; // 0x360(0x08)
	struct UImage* Image_32; // 0x368(0x08)
	struct UImage* Image_33; // 0x370(0x08)
	struct UImage* Image_34; // 0x378(0x08)
	struct UImage* Image_35; // 0x380(0x08)
	struct UImage* Image_36; // 0x388(0x08)
	struct UImage* Image_37; // 0x390(0x08)
	struct UImage* Image_38; // 0x398(0x08)
	struct UImage* Image_39; // 0x3a0(0x08)
	struct UImage* Image_40; // 0x3a8(0x08)
	struct UImage* Image_41; // 0x3b0(0x08)
	struct UImage* Image_42; // 0x3b8(0x08)
	struct UImage* Image_43; // 0x3c0(0x08)
	struct UImage* Image_44; // 0x3c8(0x08)
	struct UImage* Image_45; // 0x3d0(0x08)
	struct UImage* Image_46; // 0x3d8(0x08)
	struct UImage* Image_47; // 0x3e0(0x08)
	struct UImage* Image_48; // 0x3e8(0x08)
	struct UImage* Image_49; // 0x3f0(0x08)
	struct UImage* Image_50; // 0x3f8(0x08)
	struct UImage* Image_110; // 0x400(0x08)
	struct UImage* Image_157; // 0x408(0x08)
	struct UImage* Image_666; // 0x410(0x08)
	struct UImage* Image_BG; // 0x418(0x08)
	struct UImage* Image_BG_2; // 0x420(0x08)
	struct UImage* Image_Separator; // 0x428(0x08)
	struct UImage* Image_SS; // 0x430(0x08)
	struct UImage* Image_SS_2; // 0x438(0x08)
	struct UImage* Image_SS_3; // 0x440(0x08)
	struct UImage* Image_SS_4; // 0x448(0x08)
	struct UImage* Image_SS_5; // 0x450(0x08)
	struct UImage* Image_SS_6; // 0x458(0x08)
	struct UImage* Image_SS_7; // 0x460(0x08)
	struct UImage* Image_SS_8; // 0x468(0x08)
	struct UImage* Image_SS_9; // 0x470(0x08)
	struct UImage* Image_SS_10; // 0x478(0x08)
	struct UImage* Image_SS_11; // 0x480(0x08)
	struct UImage* Image_SS_12; // 0x488(0x08)
	struct UImage* Image_SS_13; // 0x490(0x08)
	struct UImage* Image_SS_14; // 0x498(0x08)
	struct UImage* Image_SS_15; // 0x4a0(0x08)
	struct UImage* Image_SS_16; // 0x4a8(0x08)
	struct UOverlay* Overlay_111; // 0x4b0(0x08)
	struct UOverlay* Overlay_112; // 0x4b8(0x08)
	struct UOverlay* Overlay_113; // 0x4c0(0x08)
	struct UOverlay* Overlay_122; // 0x4c8(0x08)
	struct UOverlay* Overlay_123; // 0x4d0(0x08)
	struct UOverlay* Overlay_127; // 0x4d8(0x08)
	struct USizeBox* SizeBox_Button; // 0x4e0(0x08)
	struct USizeBox* SizeBox_Button_2; // 0x4e8(0x08)
	struct USizeBox* SizeBox_Button_3; // 0x4f0(0x08)
	struct USizeBox* SizeBox_Button_4; // 0x4f8(0x08)
	struct USizeBox* SizeBox_Button_5; // 0x500(0x08)
	struct USizeBox* SizeBox_Button_6; // 0x508(0x08)
	struct USizeBox* SizeBox_Button_7; // 0x510(0x08)
	struct USizeBox* SizeBox_Button_8; // 0x518(0x08)
	struct USizeBox* SizeBox_Button_9; // 0x520(0x08)
	struct USizeBox* SizeBox_Button_10; // 0x528(0x08)
	struct USizeBox* SizeBox_Button_11; // 0x530(0x08)
	struct USizeBox* SizeBox_Button_12; // 0x538(0x08)
	struct USizeBox* SizeBox_Button_13; // 0x540(0x08)
	struct USizeBox* SizeBox_Button_14; // 0x548(0x08)
	struct USizeBox* SizeBox_Button_15; // 0x550(0x08)
	struct USizeBox* SizeBox_Button_16; // 0x558(0x08)
	struct USizeBox* SizeBox_Button_17; // 0x560(0x08)
	struct USizeBox* SizeBox_Button_18; // 0x568(0x08)
	struct UTextBlock* Text_Header; // 0x570(0x08)
	struct UTextBlock* TextBlock_5; // 0x578(0x08)
	struct UTextBlock* TextBlock_6; // 0x580(0x08)
	struct UTextBlock* TextBlock_7; // 0x588(0x08)
	struct UTextBlock* TextBlock_8; // 0x590(0x08)
	struct UTextBlock* TextBlock_9; // 0x598(0x08)
	struct UTextBlock* TextBlock_10; // 0x5a0(0x08)
	struct UTextBlock* TextBlock_13; // 0x5a8(0x08)
	struct UTextBlock* TextBlock_14; // 0x5b0(0x08)
	struct UTextBlock* TextBlock_15; // 0x5b8(0x08)
	struct UTextBlock* TextBlock_35; // 0x5c0(0x08)
	struct UTextBlock* TextBlock_73; // 0x5c8(0x08)
	struct UTextBlock* TextBlock_113; // 0x5d0(0x08)
	struct UTextBlock* TextBlock_159; // 0x5d8(0x08)
	struct UTextBlock* TextBlock_Q1; // 0x5e0(0x08)
	struct UTextBlock* TextBlock_Q1_3; // 0x5e8(0x08)
	struct UTextBlock* TextBlock_Q1_4; // 0x5f0(0x08)
	struct UTextBlock* TextBlock_Q1_6; // 0x5f8(0x08)
	struct UTextBlock* TextBlock_Q1_7; // 0x600(0x08)
	struct UTextBlock* TextBlock_Q1_8; // 0x608(0x08)
	struct UTextBlock* TextBlock_Q1_9; // 0x610(0x08)
	struct UTextBlock* TextBlock_Q1_10; // 0x618(0x08)
	struct UTextBlock* TextBlock_Q1_11; // 0x620(0x08)
	struct UTextBlock* TextBlock_Q1_12; // 0x628(0x08)
	struct UTextBlock* TextBlock_Q1_13; // 0x630(0x08)
	struct UTextBlock* TextBlock_Q1_14; // 0x638(0x08)
	struct UTextBlock* TextBlock_Q1_15; // 0x640(0x08)
	struct UTextBlock* TextBlock_Q1_16; // 0x648(0x08)
	struct UTextBlock* TextBlock_Q1_17; // 0x650(0x08)
	struct UTextBlock* TextBlock_Q1_18; // 0x658(0x08)
	struct UTextBlock* TextBlock_Q1_19; // 0x660(0x08)
	struct UTextBlock* TextBlock_Q1_20; // 0x668(0x08)
	struct UTextBlock* TextBlock_Q1_21; // 0x670(0x08)
	struct UTextBlock* TextBlock_Q1_22; // 0x678(0x08)
	struct UTextBlock* TextBlock_Q1_23; // 0x680(0x08)
	struct UTextBlock* TextBlock_Q1_24; // 0x688(0x08)
	struct UTextBlock* TextBlock_Q1_25; // 0x690(0x08)
	struct UTextBlock* TextBlock_Q1_26; // 0x698(0x08)
	struct UTextBlock* TextBlock_Q1_27; // 0x6a0(0x08)
	struct UTextBlock* TextBlock_Q1_28; // 0x6a8(0x08)
	struct UTextBlock* TextBlock_Q1_29; // 0x6b0(0x08)
	struct UTextBlock* TextBlock_Q1_30; // 0x6b8(0x08)
	struct UTextBlock* TextBlock_Q1_31; // 0x6c0(0x08)
	struct UTextBlock* TextBlock_Q1_32; // 0x6c8(0x08)
	struct UTextBlock* TextBlock_Q1_34; // 0x6d0(0x08)
	struct UTextBlock* TextBlock_Q1_35; // 0x6d8(0x08)
	struct UTextBlock* TextBlock_Q1_36; // 0x6e0(0x08)
	struct UTextBlock* TextBlock_Q1_37; // 0x6e8(0x08)
	struct UTextBlock* TextBlock_Q1_59; // 0x6f0(0x08)
	struct UTextBlock* TextBlock_Q1_62; // 0x6f8(0x08)
	struct UTextBlock* TextBlock_Q1_77; // 0x700(0x08)
	struct UTextBlock* TextBlock_Q1_81; // 0x708(0x08)
	struct UTextBlock* TextBlock_Q1_83; // 0x710(0x08)
	struct UTextBlock* TextBlock_Q1_84; // 0x718(0x08)
	struct UTextBlock* TextBlock_Q1_87; // 0x720(0x08)
	struct UTextBlock* TextBlock_Q1_91; // 0x728(0x08)
	struct UTextBlock* TextBlock_Q1_92; // 0x730(0x08)
	struct UTextBlock* TextBlock_Q1_93; // 0x738(0x08)
	struct UTextBlock* TextBlock_Q1_96; // 0x740(0x08)
	struct UTextBlock* TextBlock_Q1_97; // 0x748(0x08)
	struct UTextBlock* TextBlock_Q1_99; // 0x750(0x08)
	struct UTextBlock* TextBlock_Q1_101; // 0x758(0x08)
	struct UTextBlock* TextBlock_Q1_104; // 0x760(0x08)
	struct UTextBlock* TextBlock_Q1_105; // 0x768(0x08)
	struct UTextBlock* TextBlock_Q1_106; // 0x770(0x08)
	struct UTextBlock* TextBlock_Q1_113; // 0x778(0x08)
	struct UTextBlock* TextBlock_Q1_115; // 0x780(0x08)
	struct UTextBlock* TextBlock_Q1_118; // 0x788(0x08)
	struct UTextBlock* TextBlock_Q1_119; // 0x790(0x08)
	struct UTextBlock* TextBlock_Q1_120; // 0x798(0x08)
	struct UTextBlock* TextBlock_Q1_121; // 0x7a0(0x08)
	struct UTextBlock* TextBlock_Q1_124; // 0x7a8(0x08)
	struct UTextBlock* TextBlock_Q1_128; // 0x7b0(0x08)
	struct UTextBlock* TextBlock_Q1_131; // 0x7b8(0x08)
	struct UTextBlock* TextBlock_StepCount; // 0x7c0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_366; // 0x7c8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck; // 0x7d0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck_2; // 0x7d8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck_3; // 0x7e0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck_4; // 0x7e8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck_5; // 0x7f0(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck_6; // 0x7f8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck_7; // 0x800(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck_8; // 0x808(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck_9; // 0x810(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck_10; // 0x818(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck_11; // 0x820(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck_12; // 0x828(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck_13; // 0x830(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck_14; // 0x838(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck_15; // 0x840(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_QCheck_16; // 0x848(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Quest; // 0x850(0x08)
	struct TArray<float> Array; // 0x858(0x10)
	int32_t IndexQuest; // 0x868(0x04)
	char pad_86C[0x4]; // 0x86c(0x04)
	struct FSlateBrush In Brush; // 0x870(0x88)
	struct FSlateBrush In Brush_Full; // 0x8f8(0x88)
	int32_t NewVar_1; // 0x980(0x04)
	bool IsSurvTutorEnded; // 0x984(0x01)
	char pad_985[0x3]; // 0x985(0x03)
	int32_t StepCounter; // 0x988(0x04)

	void SetText(struct FText QuestText); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.SetText // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	struct FText Get_TextBlock_Q1_Text_1(); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.Get_TextBlock_Q1_Text_1 // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x132e1a0
	void SetDialogue(struct FText Text); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.SetDialogue // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void SetQuest(int32_t Index); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.SetQuest // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void PreConstruct(bool IsDesignTime); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void Construct(); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void Tick(struct FGeometry MyGeometry, float InDeltaTime); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.Tick // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x132e1a0
	void StartAnimKeys(); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.StartAnimKeys // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void EndAnimKeys(); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.EndAnimKeys // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void SetQuestText(); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.SetQuestText // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void QuestCompleted(); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.QuestCompleted // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void QuestNotCompleted(); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.QuestNotCompleted // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void ShowQuest(); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.ShowQuest // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void HideQuest(); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.HideQuest // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void CustomEvent_1(); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.CustomEvent_1 // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void NextQuest(); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.NextQuest // (BlueprintCallable|BlueprintEvent) // @ game+0x132e1a0
	void ExecuteUbergraph_W_Tutorial_Quest(int32_t EntryPoint); // Function W_Tutorial_Quest.W_Tutorial_Quest_C.ExecuteUbergraph_W_Tutorial_Quest // (Final|UbergraphFunction|HasDefaults) // @ game+0x132e1a0
};

